window.LUMINOVA_EXAMS = [
  {
    "id": "quizzes_1778764269450",
    "timestamp": "2026-05-14T13:11:09.450Z",
    "titleAr": "اختبار نظم إدارة التعلم 🏆",
    "titleEn": "Testing of Learning Management Systems 🏆",
    "examCode": "EXM_mp5ibibu8wlz9",
    "isShuffled": false,
    "feedbackMode": "end",
    "subjectId": "subjects_1775908403709",
    "publisherId": "",
    "questions": [
      {
        "type": "mcq",
        "text": "من هو المسئول عن الافراج عن المحتوى للاستخدام؟ ",
        "score": 1,
        "options": [
          "منشئ المحتوى ",
          "المحرر",
          "الناشر",
          "المسئول "
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "حيث أن الناشر هو المسئول عن نشر المحتوى والإفراج عنه لكي يتم استخدامه",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778781484306"
      },
      {
        "type": "mcq",
        "text": "تعتبر من انظمة المدونات...؟ ",
        "score": 1,
        "options": [
          "Zen cart ",
          "Word press ",
          "Tiki wiki ",
          "Joomla"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تُعتبر ال Word press  من انظمة المدونات بجانب ال Flat Press  ايضًا وغيرها من المدونات",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778781642166"
      },
      {
        "type": "mcq",
        "text": "من معوقات نظم إدارة المقرر؟ ",
        "score": 1,
        "options": [
          "محدودية القدرة في التعليم التفاعلي ",
          "تتبع تقدم الطالب ",
          "توفر احصائيات المقرر "
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "حيث انه من تحديات نظم ادارة المقرر محدود القدرة في التعليم التفاعلي ومحدود القدرة في حفظ السجلات ولا يتمتع بالمرونة الكافية في تصميم المقرر",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778781803558"
      },
      {
        "type": "mcq",
        "text": "هي قاعدة بيانات مركزية لتخزين كائنات التعلم وادارتها وتستخدم هذه الكائنات بشكل فردي او يُعاد استخدامها ",
        "score": 1,
        "options": [
          "مستودع كائنات التعلم ",
          "تطبيق التأليف الآلي ",
          "التطبيق الاداري "
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "حيث تتميز نظم ادارة المحتوى بأنها مستودع لكائنات التعلم وتُعد قاعدة بيانات مركزية للتخزين ",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778781895645"
      },
      {
        "type": "mcq",
        "text": "تندرج الألعاب ودفتر الدرجات ضمن....؟ ",
        "score": 1,
        "options": [
          "الادوات الادارية ",
          "ادوات التعليم والتعلم ",
          "ادوات التواصل",
          ""
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تُعد الألعاب ودفتر الدرجات ومجموعات النشاط وتقييم الدورة وغيرهم من ضمن ادوات التعليم والتعلم ",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778781984602"
      },
      {
        "type": "mcq",
        "text": "من مميزات تخطيط موارد المؤسسات التعليمية (الاخلال ببيانات الطالب) ",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لابد من إدارة بيانات الطالب والحفاظ عليها",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778782078209"
      },
      {
        "type": "mcq",
        "text": "يعتبر المسئول هو (المسئول عن صبط رسالة المختوى واسلوب التسليم) ",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "حيث ان المسئول هو المسئول عن اذونات  الوصول للمجلدات  والملفات، اما المحرر فهو المسئول عن ضبط رسالة المحتوى",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778782197954"
      },
      {
        "type": "mcq",
        "text": "تعتبر  Joomla  ضمن انظمة البوابات الإلكترونية ",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "نعم تعتبر Joomla  و Drupal  من انظمة البوابات ",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778782284283"
      },
      {
        "type": "mcq",
        "text": "مراعاة خصائص المتعلمين ليست من الاهداف الاساسية لصنع المحتوى وتصميمه",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تعتبر مراعاة خصائص المتعلمين من الاهداف الاساسية والمهمة  لصنع المحتوى ",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778782404969"
      },
      {
        "type": "mcq",
        "text": "يعبر  مصطلح LCMS   عن نظم ادارة محتوى التعلم والمصطلح المعبر عنه Learning Course Management system ",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الاجابة كلها صحيحة لكن الفكرة ف المصطلح نفسه هيبقى Learning Content  managment System ",
        "studentId": "students_1775855642761",
        "showExp": false,
        "id": "q_1778782583187"
      }
    ],
    "examMode": "evaluation",
    "emailPolicy": "none",
    "adminEmails": "mahmoud21abdalrhman@gmail.com,salmazahran167@gmail.com",
    "sheetName": "Sheet1",
    "startTime": "2026-05-16T21:30",
    "endTime": "2026-05-16T23:00",
    "latePolicy": "hard_stop",
    "allowBackNavigation": true,
    "webhookUrl": "",
    "sendDetailedReport": true,
    "entryGate": {
      "name": true,
      "department": true,
      "email": true
    },
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1778324229730",
    "timestamp": "2026-05-09T10:57:09.730Z",
    "titleAr": "اختبار مادة معلومات مصورة 🏆",
    "titleEn": "Illustrated Information Material Test 🏆",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1777896562125",
    "publisherId": "s_founder_hardcoded",
    "questions": [
      {
        "type": "mcq",
        "text": "في إنفوجرافيك يشرح \"أعطال محرك السيارة\"، يُعد استخدام صورة فوتوغرافية حقيقية مليئة بالتفاصيل أفضل من الرسم التخطيطي البسيط لضمان معيار الوضوح.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الوضوح يتطلب استبعاد التفاصيل غير الملائمة التي تشتت الانتباه؛ فالصور الحقيقية المزدحمة تشتت المتعلم، بينما الرسم التخطيطي يركز على الفكرة الجوهرية فقط.\n",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325521600"
      },
      {
        "type": "mcq",
        "text": "يُعتبر استخدام اللون \"الأزرق المخضر\" في خلفية التصميم مع كتابة نص باللون \"الأزرق\" تطبيقاً ناجحاً لمعيار التباين.",
        "score": 0,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "اللون \"الأزرق المخضر\" هو لون هجين مشتق من الأزرق، واللونان متقاربان جداً في دائرة الألوان، مما يؤدي لضعف التباين وصعوبة القراءة.",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325573471"
      },
      {
        "type": "mcq",
        "text": "معيار \"التنظيم أو الترتيب\" هو المسؤول الأول عن تحويل مجموعة من البيانات المبعثرة إلى \"قصة بصريّة\" تتبعها العين.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأنه يعتمد على ترتيب العناصر بطريقة منطقية تساعد على تتبع الفكرة باستخدام الأسهم والأشكال الهندسية، مما يخلق مساراً بصرياً واضحاً.",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325677613"
      },
      {
        "type": "mcq",
        "text": "إذا تساوت مساحة الرسم مع مساحة النص في اللوحة، نكون قد حققنا الحد الأدنى المطلوب لمعيار الوضوح.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "معيار الوضوح يشترط ألا يقل الرسم عن 1/4 مساحة اللوحة؛ فإذا تساوى مع النص (أي أخذ 1/2 المساحة)، فهو بالتأكيد حقق وتجاوز الحد الأدنى المطلوب.",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325744300"
      },
      {
        "type": "mcq",
        "text": "معيار \"التناسب\" في الألوان يهدف فقط إلى جعل اللوحة جميلة، وليس له علاقة بتأكيد الأفكار الأساسية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التناسب يهدف لانسجام الألوان لتأكيد الأفكار الأساسية المعروضة وإبرازها للمشاهد، وليس لمجرد التزيين الجمالي",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325901455"
      },
      {
        "type": "mcq",
        "text": "تصميم إنفوجرافيك عن \"تاريخ تطور الحواسيب\" يتطلب دمج نوعين من المعلومات المصورة، هما:",
        "score": 1,
        "options": [
          "التشريحية والإحصائية",
          "الزمنية والعملية",
          "الهرمية والتشريحية"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الزمنية لعرض التطور \nعبر السنين، والعملية (المخططات) لشرح كيفية عمل الجهاز وتطوره إجرائياً.",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325976328"
      },
      {
        "type": "mcq",
        "text": "2. عندما نضع \"العنوان\" في أعلى اليمين، و\"العناصر الهامة\" في المركز، ثم وضع \"المصادر\" في أسفل \nاليسار، نحن نحقق معيار:",
        "score": 1,
        "options": [
          "التوازن غير النمطي",
          "التركيب وفق الثقافة العربية",
          " التباين (الشكل والأرضية)"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن التركيب يهتم بترتيب العناصر لجذب الانتباه حسب أولويتها بما يتوافق مع حركة عين القارئ العربي (من اليمين لليسار)",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778326848180"
      },
      {
        "type": "mcq",
        "text": "مشكلة \"تداخل العناصر مع الخلفية\" وصعوبة تمييز حدود الرسم تدل على خلل مباشر في معيار:",
        "score": 1,
        "options": [
          "التنظيم",
          "التوازن",
          "التباين"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "التباين هو المسؤول عن الفصل الواضح بين \"الشكل\" و \"الأرضية\"؛ وغيابه يجعل العناصر تندمج مع الخلفية وتختفي معالمها",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778326903272"
      },
      {
        "type": "mcq",
        "text": "أي من الحالات التالية تكسر معيار \"البساطة\" الذي هو مفتاح تصميم الإنفوجرافيك؟",
        "score": 1,
        "options": [
          "استخدام 3 ألوان فقط من دائرة الألوان",
          "محاولة عرض 5 أفكار رئيسية مختلفة في لوحة واحدة",
          "ترك هوامش أمان 2.5 سم من الجوانب"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن الإنفوجرافيك الناجح يركز على فكرة واحدة؛ وتعدد الأفكار الرئيسية يشتت القارئ ويجعله يبذل جهداً كبيراً للفهم، وهذا يضاد مبدأ البساطة",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778326999934"
      },
      {
        "type": "mcq",
        "text": "اللون الناتج عن مزج (أصفر + برتقالي) يُصنف ضمن:",
        "score": 1,
        "options": [
          "الألوان الأساسية",
          "الألوان الثانوية",
          "الألوان الهجينة"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "لأن الأصفر لون أساسي والبرتقالي لون ثانوي، وناتج مزجهما يسمى دائماً \"لوناً هجيناً\"",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327051395"
      },
      {
        "type": "mcq",
        "text": "يُعتبر نظام \"Isotype\" الذي ابتكره \"أوتو نيوراث\" مجرد وسيلة تزيينية للبيانات، ولا يعد لغة بصرية قائمة بحد ذاتها",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "نظام \"Isotype\" صُمم ليكون لغة عالمية بصرية (International System of Typographic Picture Education) تهدف لتبسيط المعلومات المعقدة لعامة الناس وتجاوز عوائق اللغة المكتوبة",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327200876"
      },
      {
        "type": "mcq",
        "text": "في مرحلة \"التحليل والقراءة\"، يقتصر دور المصمم على التأكد من صحة الأرقام إملائياً فقط",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هذه المرحلة هي الأهم تقنياً؛ حيث يتم فيها استخراج \"الأنماط\" والعلاقات المنطقية بين البيانات (مثل المقارنة أو التباين) لتحويلها من أرقام صماء إلى فكرة مرئية مفهومة",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327235975"
      },
      {
        "type": "mcq",
        "text": "\"الاتزان غير المتماثل\" عندما تتساوى العناصر في أشكالها وأحجامها على جانبي المحور الرأسي للتصميم.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التساوي في الأشكال والأحجام هو \"اتزان متماثل\" (نمطي)، أما \"غير المتماثل\" فيعتمد على تعادل \"الأوزان البصرية\" لعناصر مختلفة تماماً في الشكل (مثل موازنة كتلة كبيرة فاتحة بكتلة صغيرة غامقة)",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327286664"
      },
      {
        "type": "mcq",
        "text": "معيار \"البساطة\" في الإنفوجرافيك التعليمي يهدف بشكل أساسي إلى تقليل المجهود الذهني الذي يبذله المتعلم لاستيعاب المعلومة",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "البساطة هي \"مفتاح التصميم\"؛ فكلما قل التعقيد واستبعدت التفاصيل غير الضرورية، ركز عقل المتعلم على الفكرة الجوهرية للدرس",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327441395"
      },
      {
        "type": "mcq",
        "text": "يُستخدم \"الملمس البصري\" (Visual Texture) لخلق إيحاء بالبعد الثالث والواقعية في التصميم بالرغم من كونه ثنائي الأبعاد",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الملمس يعطي إحساساً بخشونة أو نعومة السطح بصرياً، مما يعزز الرسالة الذهنية (مثل استخدام ملمس ورق قديم لإنفوجرافيك تاريخي) ويزيد من جاذبية التصميم",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327478113"
      },
      {
        "type": "mcq",
        "text": "أي من أنواع الإنفوجرافيك التالية يمنح \"الناشر\" القدرة على تحديث البيانات بشكل ديناميكي ومستمر؟",
        "score": 1,
        "options": [
          "الإحصائي الثابت",
          "المتحرك",
          "التفاعلي"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الإنفوجرافيك التفاعلي يتميز بالمرونة وإمكانية الإنشاء الديناميكي للمحتوى، مما يسمح بتحديثه وتعديله برمجياً ليعكس أحدث البيانات",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327543285"
      },
      {
        "type": "mcq",
        "text": "المرحلة التي يتم فيها رسم \"هيكل\" أو \"مخطط كروكي\" يحدد مسارات العين وتوزيع العناصر قبل البدء في التلوين هي:",
        "score": 1,
        "options": [
          "مرحلة البحث والبيانات",
          "مرحلة بناء المخطط",
          "مرحلة الإخراج الفني"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هذه المرحلة هي الجسر بين \"الفكرة\" و\"التنفيذ الفني\"، وبدونها يفتقر التصميم للتنظيم والترتيب المنطقي للمعلومات",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327663788"
      },
      {
        "type": "mcq",
        "text": "عندما نستخدم التدرج اللوني من الغامق إلى الفاتح لنبين تسلسل الأهمية في معلومة ما، نحن نطبق عنصر:",
        "score": 1,
        "options": [
          "الخط",
          "الاتجاه",
          "القيمة"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "القيمة تعبر عن درجات الإضاءة والعتمة في اللون، وهي أداة بصرية قوية لخلق التباين وتوضيح التدرج في الأهمية أو العمق",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327714852"
      },
      {
        "type": "mcq",
        "text": "أي مبدأ من مبادئ التصميم يضمن شعور المشاهد بأن جميع عناصر اللوحة (صور، نصوص، ألوان) تشكل \"نسيجاً واحداً\" متكاملاً؟",
        "score": 1,
        "options": [
          "التناسب",
          "الوحدة ",
          "السيادة"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الوحدة هي المبدأ الجامع الذي يربط العناصر ببعضها بعلاقات بصرية واضحة، مما يمنع التشتت ويجعل التصميم يبدو كعمل فني واحد لا أجزاء منفصلة",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327758627"
      },
      {
        "type": "mcq",
        "text": "5. الإنفوجرافيك الذي يستخدم \"الأسهم\" والمسارات المتسلسلة لشرح \"دورة حياة المنتج\" يتبع معيار:\n",
        "score": 1,
        "options": [
          "التباين",
          "التنظيم والترتيب",
          "الوضوح"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التنظيم يعتمد على ترتيب العناصر بطريقة منطقية تسهل تتبع الفكرة، والأسهم هي الأداة البصرية الأساسية لتحقيق هذا التتبع",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327807563"
      },
      {
        "type": "mcq",
        "text": "يُعد الإنفوجرافيك المتحرك (Motion Graphic) 1.مجرد مجموعة من الرسوم المتحركة البسيطة فقط",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هو أكثر من مجرد رسوم؛ فهو فن يدمج الرسوم، البيانات، الأصوات، والحركة لإيصال معلومات معقدة بطريقة مبسطة وجذابة",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328290204"
      },
      {
        "type": "mcq",
        "text": " من مميزات الإنفوجرافيك المتحرك أنه يساعد على زيادة قدرة المشاهد على تذكر المعلومات أكثر من النصوص",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأن العقل البشري يتذكر الصور والحركات بشكل أفضل وأسرع من النصوص المجردة، مما يزيد من كفاءة عملية التعلم",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328359949"
      },
      {
        "type": "mcq",
        "text": "\"التحريك بالكمبيوتر\" يوفر مرونة وسرعة أكبر في الإنتاج مقارنة بـ \"التحريك الكلاسيكي\"",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "التحريك الكلاسيكي يتطلب إنشاء كل إطار بشكل فردي وجهداً كبيراً، بينما برامج الكمبيوتر تختصر الوقت وتوفر أدوات تحريك مرنة",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328398415"
      },
      {
        "type": "mcq",
        "text": "يجب الإسراف في استخدام الألوان والخطوط بكثرة في الإنفوجرافيك المتحرك لضمان جذب انتباه المشاهد",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "من معايير التصميم (صفحة 12) \"عدم الإسراف في استخدام الألوان والخطوط\" للحفاظ على بساطة التصميم وعدم تشتت المشاهد",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328422894"
      },
      {
        "type": "mcq",
        "text": " يُعد برنامج \"Video Scribe\" 5. متخصصاً في إنتاج فيديوهات تعتمد على طريقة \"الكتابة باليد\" أو الرسم أمام المشاهد",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "البرنامج مشهور بخاصية الـ Hand-drawn التي تظهر الرسوم والنصوص وكأنها تُكتب يدوياً في اللحظة نفسها",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328471619"
      },
      {
        "type": "mcq",
        "text": " ينقسم الإنفوجرافيك المتحرك إلى أسلوبين أساسيين هما:",
        "score": 1,
        "options": [
          "الصور الثابتة والخرائط الذهنية",
          "الرسوم المتحركة ولقطات الفيديو",
          "الرسوم الكلاسيكية والرسوم اليدوية فقط ",
          "النصوص المكتوبة والصور الفوتوغرافية"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "حسب صفحة 9، هما الأسلوبان الرئيسيان المعتمدان في بناء محتوى الإنفوجرافيك المتحرك",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328581734"
      },
      {
        "type": "mcq",
        "text": " أي من البرامج التالية يعتمد على \"نظام الطبقات\" (Layers) 7.ويستخدم في صناعة المؤثرات البصرية ما بعد الإنتاج؟",
        "score": 1,
        "options": [
          "iMovie",
          "Animoto",
          "Adobe After Effects",
          "Video Scribe"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": " برنامج \"أفتر إفكتس\" هو الأقوى في التعامل مع الطبقات والبيئات ثنائية وثلاثية الأبعاد والمؤثرات السينمائية",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328963387"
      },
      {
        "type": "mcq",
        "text": " واحدة من أهم معايير تصميم الإنفوجرافيك المتحرك الناجح هي: ",
        "score": 1,
        "options": [
          "وضع أكبر قدر ممكن من البيانات في مشهد واحد",
          "التركيز على فكرة واحدة محددة عند التصميم",
          "استخدام أصوات صاخبة جداً لجذب الانتباه",
          "إطالة مدة الفيديو قدر الإمكان"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التركيز على فكرة واحدة يضمن وصول الرسالة بوضوح وبساطة دون تعقيد للمشاهد (صفحة 12)",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778329009330"
      },
      {
        "type": "mcq",
        "text": "تقنية التحريك التي يتم فيها إنشاء كل إطار بشكل فردي ثم عرضها بسرعة لخلق وهم الحركة تسمى:",
        "score": 1,
        "options": [
          "التحريك بالكمبيوتر",
          "التحريك الإطاري الرقمي",
          "التحريك الكلاسيكي",
          "التحريك التفاعلي"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا هو التعريف الدقيق للتحريك التقليدي الذي يتطلب وقتاً وجهداً كبيرين (صفحة 17)",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778329083290"
      },
      {
        "type": "mcq",
        "text": "يساعد استخدام الإنفوجرافيك المتحرك في العملية التعليمية على :",
        "score": 1,
        "options": [
          "تقليل دافعية الطلاب نحو التعلم",
          "ترسيخ المعلومات وتثبيتها في أذهان الطلاب",
          "جعل المناهج الدراسية أكثر صعوبة وتعقيداً ",
          "إلغاء دور المعلم في الفصل "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "من فوائده التعليمية (صفحة 11) أنه يوفر الوقت والجهد ويحفز الطلاب ويساعد في تنظيم الأفكار ومقارنتها",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778329156621"
      },
      {
        "type": "mcq",
        "text": "يركز الإنفوجرافيك بشكل أساسي على الجوانب الجمالية والإبداعية الواسعة، بينما يركز التصميم الجرافيكي على إيصال المعلومات",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "العكس هو الصحيح؛ التصميم الجرافيكي يشمل جوانب جمالية وإبداعية أوسع، بينما الإنفوجرافيك وظيفي أكثر ويركز على تبسيط وإيصال المعلومات والبيانات",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330092724"
      },
      {
        "type": "mcq",
        "text": "العلاقة بين الإنفوجرافيك وعلم البيانات تتمثل في أن كلاهما يهدف إلى تحويل البيانات إلى صور مرئية لتسهيل فهمها",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذا هو \"الهدف المشترك\" المذكور في الصفحة الثانية؛ حيث يعتمد الإنفوجرافيك على نتائج تحليل بيانات علم البيانات لتقديمها بشكل جذاب",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330198680"
      },
      {
        "type": "mcq",
        "text": "  يعتبر \" توني بوزان\" هو صاحب فكرة الإنفوجرافيك",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "توني بوزان هو صاحب فكرة \"الخرائط الذهنية\"، أما الإنفوجرافيك فينسب إلى \"كريستوف شاينر\" حسب جدول المقارنة في الصفحة الخامسة",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330237728"
      },
      {
        "type": "mcq",
        "text": "الخرائط الذهنية والخرائط المفاهيمية كلاهما وسائط غير خطية تساعد الطالب على تنظيم المعرفة وتسريع التعلم",
        "score": 1,
        "options": [
          "صج",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "كلا الوسيلتين تبتعدان عن السرد النصي التقليدي وتعتمدان على الرموز والأشكال والروابط البصرية التي يفضلها العقل لتنظيم الأفكار",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330271004"
      },
      {
        "type": "mcq",
        "text": "تتميز الخرائط المفاهيمية عن الخرائط الذهنية بوجود \"كلمات ربط\" على الأسهم توضح نوع العلاقة بين المفاهيم",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": " في الخرائط المفاهيمية، يُكتب على كل سهم كلمات (مثل: هو، يتكون من، يؤدي إلى) لتوضيح طبيعة الارتباط، بينما في الذهنية تكون الروابط تفرعية فقط",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330301612"
      },
      {
        "type": "mcq",
        "text": " يستخدم الإنفوجرافيك في التسويق الرقمي لغرض محدد وهو :",
        "score": 1,
        "options": [
          "إجراء التحليلات الإحصائية والرياضية. ",
          "جذب الانتباه وتبسيط المعلومات المعقدة للعملاء.",
          "الاستغناء عن العلامات التجارية. ",
          " كتابة الأكواد البرمجية للمواقع. "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الهدف التسويقي هو جذب الانتباه وزيادة الوعي بالعلامة التجارية عبر تبسيط المحتوى المعقد",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330372983"
      },
      {
        "type": "mcq",
        "text": "أي من الوسائط التالية يتبع تنظيماً \"هرمياً\" يبدأ من المفاهيم العامة في الأعلى إلى الفرعية في الأسفل؟",
        "score": 1,
        "options": [
          " الخرائط الذهنية  ",
          "الخرائط المفاهيمية",
          "الرسوم المتحركة",
          "علم البيانات. "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الخرائط المفاهيمية (جوزيف نوفاك) هي التي تلتزم بالبناء الهرمي الرأسي من الأعلى للأسفل",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330422083"
      },
      {
        "type": "mcq",
        "text": "عند البدء في إنشاء \"خريطة ذهنية\"، الخطوة الأولى والأساسية هي",
        "score": 1,
        "options": [
          "تحديد الفكرة المركزية في وسط الورقة.",
          "رسم الإطارات الهرمية.",
          "إضافة كلمات الربط على الأسهم. ",
          "جمع البيانات الإحصائية المعقدة"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الخريطة الذهنية \"مركزية\" بطبعها، تبدأ من فكرة في الوسط ثم تتفرع للخارج كالأغصان.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330526230"
      },
      {
        "type": "mcq",
        "text": " من أمثلة الأدوات والمنصات المتخصصة في إنشاء \"الإنفوجرافيك\" كما ورد في النص:",
        "score": 1,
        "options": [
          "MindMeister و XMind",
          "Canva و Piktochart",
          " Coggle و Miro",
          "Microsoft Excel"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هذه المنصات توفر قوالب بصرية جاهزة مخصصة لتصميم الإنفوجرافيك والبيانات. ",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330602822"
      },
      {
        "type": "mcq",
        "text": " ما هو الفرق في \"اتجاه التصميم\" بين الخريطة الذهنية والخرائط المفاهيمية؟ ",
        "score": 1,
        "options": [
          "الذهنية من الأعلى للأسفل، والمفاهيمية من الداخل للخارج",
          "الذهنية من الداخل للخارج مركزية والمفاهيمية من الأعلى للأسفل رأسية",
          "كلاهما يبدأ من اليمين إلى اليسار دائما",
          "لا يوجد فرق في اتجاه التصميم بينهما"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الخريطة الذهنية تنطلق من المركز (فكرة رئيسية)، بينما المفاهيمية تتبع تسلسلاً هرمياً (رأسي)",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330700812"
      },
      {
        "type": "mcq",
        "text": "كلمة \"إنفوجرافيك\" هي دمج لمصطلحي (Information) و (Graphic) وتعني:",
        "score": 1,
        "options": [
          "الرسوم المعلوماتية",
          "النصوص الرقمية",
          "البرمجة البصرية"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "المصطلح يجمع بين البيانات (Info) والتصوير البصري (Graphic).",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332135441"
      },
      {
        "type": "mcq",
        "text": "الهدف الرئيسي من استخدام \"البساطة\" في التصميم هو: ",
        "score": 1,
        "options": [
          "تقليل حجم الملف",
          "عدم إجهاد عين وعقل القارئ",
          " سرعة الإنتاج فقط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "كثرة التفاصيل غير الضرورية تشتت الانتباه عن المعلومة الأساسية",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332182921"
      },
      {
        "type": "mcq",
        "text": "الإنفوجرافيك الذي يعرض \"تطور العلامة التجارية\" عبر السنين يسمى:",
        "score": 1,
        "options": [
          "إنفوجرافيك مقارن",
          "إنفوجرافيك زمني",
          "إنفوجرافيك جغرافي"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأنه يعتمد على الترتيب التاريخي للأحداث",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332230919"
      },
      {
        "type": "mcq",
        "text": "نقطة البداية لتتبع العين في الإنفوجرافيك الموجه للثقافة العربية تكون من: ",
        "score": 1,
        "options": [
          "أعلى اليسار",
          "أعلى اليمين",
          "المنتصف دائما"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن اللغة العربية تُقرأ من اليمين إلى اليسار، فتبدأ العين تلقائياً من جهة اليمين.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332286438"
      },
      {
        "type": "mcq",
        "text": "في معايير الوضوح، يجب ألا تقل مساحة الرسوم في اللوحة عن:",
        "score": 1,
        "options": [
          "10% من المساحة.",
          "25% (الربع) من المساحة",
          "50% (النصف) من المساحة"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لضمان غلبة الطابع البصري على الطابع النصي في الإنفوجرافيك",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332356799"
      },
      {
        "type": "mcq",
        "text": "فكرة \"الموشن جرافيك\" تعتمد أساساً على: ",
        "score": 1,
        "options": [
          "الرسوم الثابتة",
          "تحريك البيانات مع دمج الصوت",
          "النصوص المكتوبة فقط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لموشن جرافيك هو رسوم توضيحية متحركة وليس مجرد تصوير فيد",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332415153"
      },
      {
        "type": "mcq",
        "text": "يعتبر الإنفوجرافيك المتحرك فن دمج:",
        "score": 1,
        "options": [
          "الصور والنصوص فقط",
          "الرسوم والبيانات والأصوات والحركة",
          "الفيديو الحقيقي فقط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التعددية الوسائطية تساهم في تبسيط المعلومات المعقدة",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332468294"
      },
      {
        "type": "mcq",
        "text": "في مواقع HTML5، تعتبر لقطات الفيديو (Video Based):",
        "score": 1,
        "options": [
          "الأكثر انتشار",
          "الأقل انتشاراً مقارنة بالرسوم البرمجية",
          "غير مدعومة نهائيا"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "نظراً لأن الرسوم المتجهة (SVG) والبرمجية أخف وأسرع في التحميل من الفيدي",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332831746"
      },
      {
        "type": "mcq",
        "text": "يساعد الإنفوجرافيك المتحرك في فهم \"المجردات\" من خلال:",
        "score": 1,
        "options": [
          "إلغاء الألوان",
          "ضغط الواقع أو تكبير/تصغير العناصر",
          "زيادة طول الفيديو"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يتيح رؤية أشياء لا تُرى بالعين المجردة (مثل حركة الذرات)",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332916026"
      },
      {
        "type": "mcq",
        "text": "العلاقة بين تذكر الصور وتذكر النصوص في العقل البشري",
        "score": 1,
        "options": [
          "الصور تُنسى أسرع",
          "العقل يتذكر الصور والحركات أفضل وأسرع",
          " لا يوجد فرق بينهما"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": " لأن الفص البصري في الدماغ يعالج الصور بشكل فوري بينما يحتاج النص لتحليل وترجمة",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778333408290"
      },
      {
        "type": "mcq",
        "text": "من معايير التصميم الجيد عدم الإسراف في:",
        "score": 1,
        "options": [
          "المعلومات الصحيحة",
          " الألوان وأشكال الخطوط",
          "المساحات البيضاء"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "كثرة الألوان والخطوط تسبب \"ضوضاء بصرية\" وتعيق الفهم.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778335833973"
      },
      {
        "type": "mcq",
        "text": "العنصر الذي يجعل الإنفوجرافيك \"تفاعلياً\" هو:",
        "score": 1,
        "options": [
          "استخدام ألوان زاهية.",
          " إضافة أزرار وروابط برمجية قابلة للنقر.",
          "زيادة عدد الصور."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "التفاعلية تعني قدرة المستخدم على التأثير في العرض.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778335896220"
      },
      {
        "type": "mcq",
        "text": "ما يميز الإنفوجرافيك \"التفاعلي\" عن \"شبه التفاعلي\" هو:\n",
        "score": 1,
        "options": [
          "جودة الصور.",
          "السماح للمستخدم بالتحكم الكامل في مسار العرض.",
          "وجود موسيقى تصويرية."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "في شبه التفاعلي يكون المسار محدداً مسبقاً (مثل التنقل بين صفحات).",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778335958772"
      },
      {
        "type": "mcq",
        "text": "المسؤول عن فك رموز الرسالة وتفسيرها في عملية الاتصال هو:\n",
        "score": 1,
        "options": [
          "المصمم.",
          "القناة.",
          "المتلقي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هو الذي يستقبل المثيرات البصرية ويحولها لمعانٍ في عقله",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336040620"
      },
      {
        "type": "mcq",
        "text": "تعتمد نظرية \"الترميز الثنائي\" لبايفيو على معالجة المعلومات عبر:",
        "score": 1,
        "options": [
          "نظام الاستماع فقط.",
          "نظام بصري فقط.",
          "نظامين (لفظي وتصوري) يعملان معاً."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "دمج الكلمة مع الصورة يقوي الذاكرة ويجعل التعلم أعمق.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336096292"
      },
      {
        "type": "mcq",
        "text": "المرحلة التي يتم فيها تحليل الأهداف وخصائص الطلاب هي:",
        "score": 1,
        "options": [
          "المرحلة الأولى (الدراسة والتحليل)",
          "المرحلة الثانية (التصميم)",
          "المرحلة الثالثة (الإنتاج)"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هي حجر الأساس الذي يُبنى عليه كامل العمل",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336163868"
      },
      {
        "type": "mcq",
        "text": "تخصيص نسبة 60% من الألوان في التصميم التعليمي يكون لـ:",
        "score": 1,
        "options": [
          "العناوين.",
          "خلفية التصميم.",
          "الرسوم التوضيحية."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لضمان الهدوء البصري وعدم تشتيت الطالب (قاعدة 60-30-10).",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336235203"
      },
      {
        "type": "mcq",
        "text": "لاستعراض \"الجدول الزمني\" للأحداث التاريخية، نستخدم الإنفوجرافيك الثابت:",
        "score": 1,
        "options": [
          "الرأسي.",
          "الأفقي.",
          "الدائري."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأنه يمثل خط الزمن الطبيعي (من الماضي للحاضر) بشكل مريح للعين.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336287604"
      },
      {
        "type": "mcq",
        "text": "الوظيفة الأساسية للإنفوجرافيك التعليمي هي:",
        "score": 1,
        "options": [
          "الترفيه فقط.",
          "تحويل المعلومات المعقدة لصور سهلة الفهم.",
          "تقليل وقت الحصة الدراسية."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هو وسيلة تعليمية بصرية تهدف لزيادة استيعاب الطالب.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336338371"
      },
      {
        "type": "mcq",
        "text": "استخدام \"المساحات الفارغة\" في التصميم يعتبر:",
        "score": 1,
        "options": [
          "دليل على قلة المعلومات.",
          "خطأ فني وضياع للمساحة.",
          "ضرورة لإراحة العين وتنظيم المعلومات."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الفراغ يساعد في فصل العناصر وتوجيه نظر القارئ للمهم",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336384587"
      },
      {
        "type": "mcq",
        "text": "الفرق بين الموشن جرافيك والفيديو العادي هو أن الموشن جرافيك:",
        "score": 1,
        "options": [
          "نصوص ثابتة لا تتحرك.",
          "صور حقيقية للبشر.",
          "رسوم وتصاميم جرافيكية متحركة."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الموشن جرافيك يعتمد على \"التصميم\" وليس \"التصوير الحي\".",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336451402"
      },
      {
        "type": "mcq",
        "text": "تعتبر الرسوم التوضيحية (Icons) ناجحة إذا كانت:",
        "score": 1,
        "options": [
          "معقدة ومليئة بالتفاصيل.",
          "رمزية وبسيطة وتوصل المعنى فوراً.",
          "ذات ألوان كثيرة جداً."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الرمز يجب أن يُفهم بمجرد النظر إليه دون الحاجة لشرح نصي طويل.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336500234"
      },
      {
        "type": "mcq",
        "text": "عند تصميم إنفوجرافيك \"مقارن\"، نستخدم عادةً:",
        "score": 1,
        "options": [
          "تقسيم اللوحة إلى جانبين متقابلين.",
          "خريطة واحدة.",
          "فيديو طويل."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لتسهيل عملية المقارنة البصرية بين عنصرين أو أكثر",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336633296"
      },
      {
        "type": "mcq",
        "text": "في عملية الاتصال، يُقاس نجاح المصمم بمدى:",
        "score": 1,
        "options": [
          "شهرته الشخصية.",
          "وصول الرسالة بوضوح للمتلقي وفهمها.",
          "استخدامه لأحدث البرامج."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الهدف من التصميم هو \"التواصل\" وليس مجرد \"الفن\".",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336835809"
      },
      {
        "type": "mcq",
        "text": "الإنفوجرافيك الذي يعتمد على \"الخرائط\" يسمى:",
        "score": 1,
        "options": [
          "إنفوجرافيك جغرافي.",
          "إنفوجرافيك إحصائي.",
          "إنفوجرافيك هرمي."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأنه يربط البيانات بمواقعها المكانية",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336946432"
      },
      {
        "type": "mcq",
        "text": "يُفضل ألا يزيد عدد الخطوط (Fonts) في التصميم الواحد عن:",
        "score": 1,
        "options": [
          "2 إلى 3 خطوط.",
          " 10 خطوط.",
          "نوع خط واحد فقط للكل."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "للحفاظ على التناسق والوحدة البصرية في العمل.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778336996180"
      },
      {
        "type": "mcq",
        "text": "تُستخدم \"الظلال\" في التصميم بـ:",
        "score": 1,
        "options": [
          "كثرة مفرطة لإبهار المشاهد.",
          "لا تُستخدم نهائياً في الإنفوجرافيك.",
          "بحذر لإعطاء بعد وعمق للعناصر."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الظلال البسيطة تبرز العناصر الهامة دون تشويه التصميم.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337052016"
      },
      {
        "type": "mcq",
        "text": "المرحلة التي يتم فيها \"تجربة\" الإنفوجرافيك على عينة من الطلاب هي:",
        "score": 1,
        "options": [
          " التحليل.",
          "التقويم والتطبيق الميداني.",
          " الإنتاج."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "للتأكد من فعالية التصميم وتحقيقه للأهداف قبل اعتماده نهائياً.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337096016"
      },
      {
        "type": "mcq",
        "text": "الإنفوجرافيك \"شبه التفاعلي\" هو الذي:",
        "score": 1,
        "options": [
          "لا يتفاعل معه المستخدم أبداً.",
          " يتغير محتواه برمجياً بالكامل.",
          "يتفاعل معه المستخدم بشكل محدود."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هو مرحلة وسطى بين الثبات والتفاعلية الكاملة",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337150192"
      },
      {
        "type": "mcq",
        "text": "تساعد \"الألوان الساخنة\" (مثل الأحمر والأصفر) في الإنفوجرافيك على:",
        "score": 1,
        "options": [
          "جذب الانتباه للعناصر الهامة والتحذيرات.",
          "تهدئة القارئ.",
          "تظليل الخلفية."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذه الألوان لها تردد بصري عالٍ يلفت النظر سريعاً.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337198415"
      },
      {
        "type": "mcq",
        "text": "من معايير الوضوح في تصميم الإنفوجرافيك، يجب أن يكون النص:\n",
        "score": 1,
        "options": [
          "مزخرفاً جداً.",
          "مكتوباً بخط صغير جداً لتوفير المساحة",
          " بسيطاً وبحجم مناسب وسهل القراءة"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الغرض هو القراءة السريعة والفهم المباشر.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337274311"
      },
      {
        "type": "mcq",
        "text": "يُعرف الإنفوجرافيك \"الهيراركي\" (Hierarchy) بأنه:",
        "score": 1,
        "options": [
          "عرض البيانات حسب أهميتها أو تدرجها ",
          "عرض عشوائي للصور.",
          "عرض زمني فقط."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "مثل الهيكل التنظيمي للشركات أو تصنيف الكائنات الحية.\n",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337320975"
      },
      {
        "type": "mcq",
        "text": "في نماذج التصميم التعليمي (مثل ADDIE)، تلي مرحلة التحليل مرحلة:",
        "score": 1,
        "options": [
          "التقويم",
          "التنفيذ",
          "التصميم"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "بعد فهم المشكلة (التحليل) نبدأ بوضع المخطط والحل (التصميم).",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337420400"
      },
      {
        "type": "mcq",
        "text": "\"الترميز غير اللفظي\" في نظرية بايفيو يقصد به:",
        "score": 1,
        "options": [
          "الكلمات المنطوقة.",
          "الصور الذهنية والرسوم البصرية.",
          "الكتابة النصية."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأنه يعالج المعلومات كـ \"أيقونات\" أو \"صور\" وليس ككلمات.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337466252"
      },
      {
        "type": "mcq",
        "text": "ما هو دور \"الصوت\" في الإنفوجرافيك المتحرك؟",
        "score": 1,
        "options": [
          " تعزيز الفهم وشرح النقاط المعقدة المتزامنة مع الحركة",
          "مجرد زينة لا قيمة لها",
          " تشتيت انتباه الطالب"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الصوت (التعليق الصوتي) يضيف القناة السمعية لعملية التعلم بجانب القناة البصرية.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337537133"
      },
      {
        "type": "mcq",
        "text": "تُستخدم \"الأسهم\" و\"الخطوط\" في الإنفوجرافيك لـ:",
        "score": 1,
        "options": [
          "ملء الفراغات.",
          "توجيه عين القارئ لمسار تدفق المعلومات",
          "تزيين الحواف."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تعمل كمؤشرات بصرية لترتيب قراءة البيانات.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337580854"
      },
      {
        "type": "mcq",
        "text": "تعتمد تقنية \"HTML5\" في الإنفوجرافيك التفاعلي على:",
        "score": 1,
        "options": [
          "ملفات فيديو ثقيلة جداً.",
          "لغات برمجة (Web) تسمح بالتفاعل والسرعة",
          " الورق المطبوع."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأنها تدعم الرسوم المتحركة والتفاعل داخل المتصفح مباشرة",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337643206"
      },
      {
        "type": "mcq",
        "text": "عند اختيار موضوع للإنفوجرافيك، يجب أن يكون:",
        "score": 1,
        "options": [
          "طويلاً جداً ويحتوي على كل شيء",
          "محدداً ويركز على فكرة رئيسية واحدة لتبسيطها",
          "مبهماً ليحفز الطالب على البحث"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التشتت في المواضيع يفقد الإنفوجرافيك قيمته في التبسيط.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337710838"
      },
      {
        "type": "mcq",
        "text": "في نظرية الترميز الثنائي، إذا تعارضت الصورة مع الكلمة:",
        "score": 1,
        "options": [
          "يحدث تشتت وفشل في عملية التعلم",
          "يزداد الفهم",
          "لا يتأثر الطالب"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "يجب أن يكون هناك \"اتساق\" بين ما يراه الطالب وما يقرأه/يسمعه",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337762677"
      },
      {
        "type": "mcq",
        "text": "يُعتبر الإنفوجرافيك وسيلة فعالة لذوي الاحتياجات الخاصة (صعوبات التعلم) لأنه:",
        "score": 1,
        "options": [
          "يعتمد على نصوص كثيرة",
          " يقلل العبء المعرفي عبر الرسوم التوضيحية",
          "سعره رخيص."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": " الصور تسهل إدراك المفاهيم التي يصعب فهمها من خلال القراءة التقليدية فقط",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778337809910"
      }
    ],
    "examMode": "evaluation",
    "emailPolicy": "full_report",
    "adminEmails": "mahmoud21abdalrhman@gmail.com",
    "startTime": "2026-05-15T14:15",
    "endTime": "2026-05-15T14:25",
    "latePolicy": "hard_stop",
    "allowBackNavigation": true,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791",
    "webhookUrl": "https://script.google.com/macros/s/AKfycbxyZ4OV8YnjI8saEqVIwm8-loJRTd7Ww4YTUv02PspS0413yZ4o_MQ9tZcwCef143xTAg/exec",
    "sendDetailedReport": true,
    "examCode": "LUM-MP609GWD37OX8",
    "sheetName": "Sheet1",
    "entryGate": {
      "name": true,
      "department": true,
      "email": true
    },
    "showResultsAfter": true
  },
  {
    "id": "quizzes_1775849685012",
    "timestamp": "2026-04-10T19:34:45.012Z",
    "titleAr": "امتحان الميد تيرم",
    "titleEn": "Mid-term exam",
    "isShuffled": false,
    "feedbackMode": "immediate",
    "subjectId": "subjects_1775849639042",
    "publisherId": "s_founder_hardcoded",
    "questions": [
      {
        "type": "mcq",
        "text": "تهدف المواطنة الرقمية إلى استخدام التكنولوجيا بدون قيود أو ضوابط.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تساعد على استخدام التكنولوجيا بشكل واعٍ ومسؤول ، والتنقل في بيئة الإنترنت بمسؤولية وأمان ، وليس بدون قيود.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775849896577"
      },
      {
        "type": "mcq",
        "text": "من أبعاد المواطنة الرقمية: الأمان الرقمي، والسلوك الأخلاقي، والمشاركة الرقمية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تشمل أبعاد المواطنة الرقمية \"الأمن الرقمي\" ، و\"اللياقة الرقمية\" التي تمثل السلوك اللائق والاحترام للآخرين (السلوك الأخلاقي) ، و\"النفاذ الرقمي\" والاتصال الذي يمثل المشاركة.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775849976623"
      },
      {
        "type": "mcq",
        "text": "المواطنة الرقمية لا تتعلق بالهوية الثقافية أو القيم المجتمعية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية ترتبط ارتباطاً وثيقاً بالقيم المجتمعية، فهي تهدف إلى تحقيق الفائدة للمجتمع ، وتقوم على مبادئ مثل احترام الآخرين واللياقة.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850013793"
      },
      {
        "type": "mcq",
        "text": "استخدام التكنولوجيا لأغراض إيجابية يعكس سلوك المواطن الرقمي.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تساعد الفرد على استخدام التكنولوجيا بما يحقق الفائدة للفرد والمجتمع.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850064055"
      },
      {
        "type": "mcq",
        "text": "المواطنة الرقمية تقتصر على البالغين فقط.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تشمل جميع الأعمار، والدليل على ذلك وجود دور للمعلم في تعزيز المواطنة عند الطلاب.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850107876"
      },
      {
        "type": "mcq",
        "text": "من حقوق المواطن الرقمي: حماية بياناته والتفاعل بحرية وأمان.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "من الحقوق والمسؤوليات الرقمية حماية الخصوصية الشخصية ، ومن الأمن الرقمي حماية البيانات ، مع ضرورة التنقل في الإنترنت بمسؤولية وأمان.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850150942"
      },
      {
        "type": "mcq",
        "text": "تكنولوجيا المعلومات لم تؤثر على مفهوم المواطنة.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لقد أثرت التكنولوجيا بشكل كبير، مما أدى إلى ظهور مصطلح جديد وهو \"المواطن الرقمي\" بجانب المواطنة التقليدية",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850195755"
      },
      {
        "type": "mcq",
        "text": "البعد القانوني من أبعاد المواطنة الرقمية يشمل المساواة أمام القانون والحقوق المدنية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تُعتبر العبارة صواباً لأن المواطنة الرقمية هي امتداد وتطبيق للمواطنة التقليدية في البيئة الافتراضية؛ فالبعد القانوني الذي يضمن المساواة والتمتع بالحقوق المدنية ينتقل مع الفرد إلى العالم الرقمي لضمان حماية حقوقه وتنظيم مسؤولياته القانونية تحت مظلة الدولة، مما يعزز قيم العدالة الاجتماعية رقمياً.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850247950"
      },
      {
        "type": "mcq",
        "text": "لا تتطلب المواطنة الرقمية أي وعي سياسي أو اجتماعي.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تتطلب وعياً اجتماعياً، حيث تشمل \"اللياقة الرقمية\" التواصل باحترام وأدب في المحادثات عبر الإنترنت ، وتتطلب التفاعل بطريقة حساسة وأخلاقية.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850291729"
      },
      {
        "type": "mcq",
        "text": "تهدف المواطنة الرقمية إلى إعداد جيل قادر على التفاعل الواعي في البيئة الرقمية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "مفهوم المواطنة الرقمية يتضمن قدرة الفرد على التفاعل مع المستخدمين والمحتوى الرقمي بطريقة نشطة ونقدية وأخلاقية وواعية.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850330203"
      }
    ],
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1777298325651",
    "timestamp": "2026-04-27T13:58:45.651Z",
    "titleAr": "امتحان سريع علي الفصل الاول",
    "titleEn": "quick quiz on chapter one",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "تعريف الاستوديو الإذاعي هو مكان مخصص ومجهز هندسياً وتقنياً لإنتاج المواد الإذاعية فقط ؟\n",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "",
        "studentId": "students_1775379443604",
        "showExp": false,
        "id": "q_1777298401018"
      },
      {
        "type": "mcq",
        "text": "يتم تجهيز الاستوديو من خلال ثلاثه طرق (العزل الصوتي, المعالجه الصوتيه, التحسين الصوتي)\n",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "عشان هما طريقتين بس العزل والمعالجه",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298452909"
      },
      {
        "type": "mcq",
        "text": "ما هو الافضل ؟ استخدام البناء المزدوج ام الثلاثي ام الفردي مع مواد عازله قويه للاستوديو\n",
        "score": 1,
        "options": [
          "بناء فردي",
          "بناء ثلاثي",
          "بناء مزدوج"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "لا يوجد حاجه تسمي بناء فردي او ثلاثي",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298549761"
      },
      {
        "type": "mcq",
        "text": "العزل الصوتي هو ان تتحكم في سلوك الصوت داخل الاستوديو ",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "العزل الصوتي هو منع تسرب أي ضوضاء من الخارج إلى داخل الاستوديو",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298620529"
      },
      {
        "type": "mcq",
        "text": "أي نوع من المواد يُفضل استخدامه في تبطين جدران استوديو الموسيقى والغناء؟",
        "score": 1,
        "options": [
          "مواد شديدة الامتصاص",
          "مواد عاكسة للصوت ",
          "مواد عازلة للاهتزازات",
          "مواد متوسطة الامتصاص."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "عشان المواد العاكسه بتزيد زمن الرنين فيزداد فخامه الصوت",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298699153"
      },
      {
        "type": "mcq",
        "text": "ي عمليه تنفيذ العزل الصوتي يتم استخدام:\nالأبواب :استخدام نظام \"الباب المزدوج\" بمواد ثقيلة وعازلة.\nالتكييف :الاستوديو يكون خالياً من النوافذ تماما،ً ويُستبدل بتكييف عادي\nسد الثغرات :يتم تغطية فتحة المفتاح في الباب بكتلة متحركة من \"الكاوتش \"لمنع أي تسرب للصوت من الفتحات الصغيرة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المفروض يتم تركييب تكييف مركزي صامت",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298773152"
      },
      {
        "type": "mcq",
        "text": "طاولة مراقبة الصوت (الميكسر) مسؤولة فقط عن تجميع مصادر الصوت المختلفة ولا يمكنها التحكم في مستوى قوة الصوت",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "إلى جانب التجميع، يُعد الميكسر الأداة الأساسية للتحكم في 'علو ووطي' الصوت وعمل الدمج (الميكس).",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298830817"
      },
      {
        "type": "mcq",
        "text": "سماعة التخاطب يستخدمها المذيع عشان يسمع تعليمات المخرج \"وهو على الهواء\"",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تعمل سماعة التخاطب فقط عندما المخرج بيكلم المذيع وهو جوه الاستوديو تكون الميكروفونات مغلقة للحديث قبل أو بعد الهواء.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298976995"
      },
      {
        "type": "mcq",
        "text": "أي تقنية من تقنيات الانتقالات الصوتية تعتمد على تلاشي صوت تدريجياً بالتزامن مع ظهور صوت آخر تدريجياً لعمل انتقال ناعم؟",
        "score": 1,
        "options": [
          "Cutting (القطع)",
          "Fade In/Out (الخفوت والظهور)",
          "Blendind (الدمج)",
          "Sigue (السيجواي)"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "تسمح هذه التقنية بنعومة الانتقال وتجنب الفجوات الصامتة عن طريق التداخل التدريجي للصوتين.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777299061255"
      },
      {
        "type": "mcq",
        "text": "ما هي الوظيفة الأساسية لرأس التسجيل في أجهزة شرائط التسجيل؟",
        "score": 1,
        "options": [
          "نسخ الأجزاء المطلوبة إلى شريط جديد.",
          "قراءة الشريط وتحويله لصوت مسموع.",
          "تحويل التيار الكهربائي إلى نبضات مغناطيسية على الشريط.",
          "مسح أي مادة مسجلة سابقاً لتجهيز الشريط."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "تقوم هذه الرأس بطباعة الذبذبات الصوتية القادمة كتيار كهربائي إلى نبضات تُحفظ على الشريط المغناطيسي.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777299140444"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "",
    "startTime": "",
    "endTime": "",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1777408169446",
    "timestamp": "2026-04-28T20:29:29.446Z",
    "titleAr": "اختبار سريع اخر علي الفصل الاول ",
    "titleEn": "Another quick quiz on the first semester",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "في استوديو الدراما، أي الأجزاء الآتية يُستخدم لإعطاء المستمع إيحاءً بأن المشهد التمثيلي يدور داخل غرفه أو مكتب؟",
        "score": 1,
        "options": [
          "الاستوديو المتوسط",
          "الاستوديو الميت",
          "الاستوديو الحي",
          "الاستوديو الاحاديث"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لانه يعطي صدي صوت يتناسب مع طبيعه الانعكسات داخل الغرفه او المكتب",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777408422637"
      },
      {
        "type": "mcq",
        "text": "ما هو نوع الانعكاس الصوتي والمواصفات التي يحتاجها 'استوديو الأحاديث' المخصص للمناقشات؟",
        "score": 1,
        "options": [
          "صدى صوت منعدم تماماً لمنع تداخل أصوات الضيوف.",
          "صدي صوت متوسط جداً لإعطاء حيوية للصوت",
          "يشبه مواصفات استوديو الربط حيث يحتاج لمواد ماصه اكثر.",
          "صدى صوت مرتفع ليغطي على ضوضاء الخلفية"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "استوديو الأحاديث يتطلب وضوحاً عالياً للحوارات، لذا فهو يشبه استوديو الربط في المواد الماصه الكثيره= زمن رنين اقل.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409517274"
      },
      {
        "type": "mcq",
        "text": "بما أن الميكروفون يحول ذبذبات الصوت إلى تيار كهربائي 'ضعيف'، فما هو الجهاز المستخدم في الاستوديو لتقوية هذه الإشارة ودفعها عبر الكابل إلى غرفة المراقبة؟",
        "score": 1,
        "options": [
          "طاولة مراقبة الصوت (الميكسر)",
          "رأس التسجيل",
          "جهاز المكبر",
          "جهاز Uher الألماني"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "وظيفة المكبر الأساسية هي أخذ الإشارة الكهربائية الضعيفة جداً من الميكروفون وتقويتها لضمان وصولها سليمة لغرفة المراقبة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409619473"
      },
      {
        "type": "mcq",
        "text": "ما هي اتجاهية 'الميكروفون الديناميكي' وما مدى مناسبته للعمل داخل الاستوديو المغلق؟\n",
        "score": 1,
        "options": [
          "قلبي الشكل، ويستخدم فقط في استوديو الموسيقى.",
          "غير اتجاهي (يلتقط من جميع الاتجاهات)، ولا يُفضل داخل الاستوديو إلا باقتراب المذيع منه جداً.",
          "ثنائي الاتجاه (من الأمام والخلف) ومثالي للدراما في الاستوديو.",
          "اتجاهي (يلتقط من اتجاه واحد) وهو الأفضل للاستوديو."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأنه يلتقط الصوت من كل مكان، فإنه قد يلتقط ضوضاء الاستوديو أو صدى الجدران، لذا يقتصر استخدامه بالداخل على حالات التحدث عن قُرب شديد (6-8 بوصة).",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409739718"
      },
      {
        "type": "mcq",
        "text": "أي الميكروفونات التالية يُعد ممتازاً داخل الاستوديو لدرجة أن المخرجين يفضلونه في الموسيقى والدراما لكونه يلغي أصوات الجوانب (ثنائي الاتجاه)؟\n",
        "score": 1,
        "options": [
          "الميكروفون اللاسلكي",
          "الميكروفون القلبي",
          "الميكروفون الديناميكي",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "يلتقط من الأمام والخلف فقط مما يمنع تشويش الجوانب، ويعطي جودة عالية تناسب الدراما والموسيقى في الاستوديو.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409821468"
      },
      {
        "type": "mcq",
        "text": "لتحقيق 'توازن الميكروفون' في حال وجود عدة أشخاص يتحدثون أمام (ميكروفون واحد)، ما هو الإجراء الصحيح الذي يجب اتخاذه؟\n",
        "score": 1,
        "options": [
          "رفع مستوى الصوت للجميع بشكل متساوٍ عبر طاولة المراقبة.",
          "تغيير وضع الميكروفون ليكون غير اتجاهي.",
          "أن يبتعد أو يقترب كل شخص حسب 'قوة صوته الأصلي'.",
          "استخدام سماعة تخاطب لكل متحدث."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا هو الحل العملي لضبط التوازن؛ صاحب الصوت القوي يبتعد قليلاً، وصاحب الصوت الضعيف يقترب ليتساوى خروج الأصوات.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409901285"
      },
      {
        "type": "mcq",
        "text": "بخصوص الأدوات الإذاعية، لماذا تُعتبر 'الساعة' من أهم الأشياء داخل الاستوديو؟",
        "score": 1,
        "options": [
          "لضبط المواعيد بالثانية ومعرفة مدة البرنامج بالضبط.",
          "لحساب زمن رنين الصوت بدقة هندسية.",
          "لتحويل الميكروفونات للعمل آلياً.",
          "لمعرفة وضبط سرعات شرائط التسجيل."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الإذاعة تعتمد على الخريطة الزمنية بالثانية لتنظيم الفواصل والبرامج بدقة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410015345"
      },
      {
        "type": "mcq",
        "text": "ما هي الأداة التي يعتمد عليها المذيع بالأساس لتلقي التوجيهات من المخرج 'وهو على الهواء مباشرة' دون أن يتأثر البث؟\n",
        "score": 1,
        "options": [
          "سماعة التخاطب",
          "سماعة الرأس",
          "السماعات الخارجية",
          "الايربودز"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "ارتداء المذيع لسماعة الرأس يضمن وصول صوت المخرج لأذن المذيع فقط أثناء عمل الميكروفونات.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410142304"
      },
      {
        "type": "mcq",
        "text": "ما هي الوظيفة الأساسية لـ 'الأسطوانات' في غرفة المراقبة، وبماذا تتميز أنواعها؟\n",
        "score": 1,
        "options": [
          "تُستخدم لتسجيل الشرائط، وتختلف سرعاتها بين 19 و 27 لفه",
          "تُستخدم لعمل مونتاج النسخ (Dubb Editing) بين جهازين",
          "تُستخدم لتشغيل المواد الموسيقية والمؤثرات الصوتية، وتختلف أنواعها حسب عدد اللفات في الدقيقة",
          "تُستخدم كأداة لحفظ أرشيف البرامج المكتوبة وتختلف أحجامها."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "تشغيل المواد الاذاعيه هي الوظيفة التقليدية للأسطوانات الإذاعية، وتتنوع أجهزتها لتدعم سرعات 16، 33.3، 45، و 78 لفة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410322832"
      },
      {
        "type": "mcq",
        "text": "يُعرف استوديو الربط باسم آخر، ويتميز بمواصفات هندسية معينة لضمان وضوح الكلمات، فما هي؟\n",
        "score": 1,
        "options": [
          "الاستوديو الميت، ومساحته صغيرة وزمن رنين مرتفع.",
          "الاستوديو الحي، ومساحته متوسطة وزمن رنين منعدم.",
          "الاستوديو التنفيذي، ومساحته صغيرة وزمن رنين منخفض",
          "استوديو المونتاج، ومساحته كبيرة وزمن رنين عالي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا هو الاسم الثاني لاستوديو الربط، ومساحته وزمن رنينه المنخفض يضمنان وضوح صوت المذيع التام.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410472319"
      },
      {
        "type": "mcq",
        "text": "أي جزء من أجزاء استوديو الدراما يُستخدم لإعطاء إيحاء صوتي بتمثيل مشهد داخل قبو؟\n",
        "score": 1,
        "options": [
          "الاستوديو المتوسط",
          "الاستوديو الميت",
          "الاستوديو الحي",
          "استوديو الأحاديث"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الاستوديو الحي يتميز بصدى صوت مرتفع، مما يجعله مثالياً لتمثيل الأماكن المغلقة التي يتردد فيها الصوت مثل الأقبية والجبال.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410649550"
      },
      {
        "type": "mcq",
        "text": "تعتبر 'غرفة المراقبة' المركز الرئيسي لإدارة العملية الإذاعية، فأي من التالي يُعد من مهامها الأساسية؟",
        "score": 1,
        "options": [
          "عمليات الحذف والإضافة ونسخ الشرائط حصراً.",
          "تسجيل الأصوات الخارجية في الشارع.",
          "عزل الضوضاء عن استوديو الربط فقط.",
          "تجميع مصادر الصوت وخلطها (مزج الكلام مع الموسيقى والمؤثرات)."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "تقوم غرفة المراقبة باستقبال الإشارات من الميكروفونات والأجهزة الأخرى ومزجها معاً وفقاً للسيناريو عبر طاولة الصوت.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410734318"
      },
      {
        "type": "mcq",
        "text": "أي الميكروفونات التالية يُعتبر 'غير اتجاهي' (يلقط من كل حتة)، ولذلك لا يُفضل استخدامه داخل الاستوديو إلا إذا اقترب منه المذيع جداً؟",
        "score": 1,
        "options": [
          "الميكروفون الديناميكي",
          "الميكروفون القلبي",
          "الميكروفون المهجن",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الميكروفون الديناميكي يلتقط الصوت من جميع الاتجاهات، مما يجعله عرضة لالتقاط صدى الاستوديو، لذا لا يُنصح به بالداخل إلا عند التحدث عن قرب شديد.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410828800"
      },
      {
        "type": "mcq",
        "text": "ما هو الميكروفون الأمثل للاستخدام عند تسجيل أغنية أو برنامج به جمهور، حيث يركز على صوت المؤدي ويمنع صوت الآلات أو الجمهور المحيط؟",
        "score": 1,
        "options": [
          "الميكروفون الديناميكي",
          "الميكروفون القلبي",
          "الميكروفون اللاسلكي",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يلتقط الميكروفون القلبي الصوت من اتجاه واحد فقط (الأمام)، مما يوفر عزلاً ممتازاً لصوت المغني عن الضوضاء المحيطة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410894029"
      },
      {
        "type": "mcq",
        "text": "الميكروفون الديناميكي هو الأفضل في الإذاعة الخارجية والمقابلات في الشارع لكونه قوياً ويتحمل ساعات العمل الطويلة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "بالفعل، الميكروفون الديناميكي يتحمل ظروف العمل الشاقة ورخيص الثمن، مما يجعله مثالياً للشارع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410978341"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "",
    "startTime": "",
    "endTime": "",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1777448343262",
    "timestamp": "2026-04-29T07:39:03.262Z",
    "titleAr": "اختبار علي الفصل التاني",
    "titleEn": "Quiz on the second semester",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "أي من المراحل التالية تُعرف بأنها مرحلة 'ما قبل الإنتاج' وتشمل الخطوات التأسيسية مثل البحث وكتابة النص واختيار فريق العمل؟",
        "score": 1,
        "options": [
          "مرحلة المونتاج",
          "مرحلة التنفيذ",
          "مرحلة المزج الصوتي",
          "مرحلة الإعداد"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "تتضمن هذه المرحلة كافة التجهيزات الورقية والبحثية التي تتم قبل بدء العمل الفني.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777448448836"
      },
      {
        "type": "mcq",
        "text": "لماذا يُعتبر 'تحديد الجمهور المستهدف' الخطوة الأولى والأساسية التي تسبق حتى اختيار فكرة البرنامج الإذاعي؟",
        "score": 1,
        "options": [
          "للتأكد من توفر الميزانية الكافية لإنتاج البرنامج.",
          "لاختيار أنواع الميكروفونات المناسبة للتسجيل.",
          "لأنه يسهل تحديد الفكرة واختيار القالب الإذاعي.",
          "لأنه يسهل حجز فريق العمل وتحديد الفكره."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "معرفة خصائص المستمعين توجه فريق العمل لاختيار مواضيع تهمهم وقوالب تتناسب مع طبيعتهم.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777448629955"
      },
      {
        "type": "mcq",
        "text": "عند تخطيط وقت البث لبرنامج موجه خصيصاً لـ 'المرأة العاملة'، أي من الأوقات التالية يُعد اختياراً خاطئاً سيؤدي لانصرافها عن الاستماع؟",
        "score": 1,
        "options": [
          "وقت ذروة عملها مثل الساعة الثانية ظهراً.",
          "فترات المساء بعد انتهاء المهام اليومية.",
          "أيام العطلات الأسبوعية.",
          "أوقات الصباح الباكر أثناء الذهاب للعمل."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "بث البرنامج في أوقات الانشغال القصوى يضمن عدم قدرة هذه الفئة على متابعة الراديو",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777451823259"
      },
      {
        "type": "mcq",
        "text": "إذا قرر المعد كتابة برنامج إذاعي يناقش 'قضايا الإدمان وأزمة الإسكان'، فمن أي مصادر استمداد الأفكار استوحى هذا الموضوع؟",
        "score": 1,
        "options": [
          "الظواهر الجديدة",
          "الصراع ضد الكوارث الطبيعية",
          "صراع الخير والشر",
          "الصراع من أجل حل المشكلات"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "القضايا الاجتماعية المعقدة مثل الإسكان والإدمان تندرج تحت مساعي المجتمع لإيجاد حلول جذرية لمشكلاته.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777452079057"
      },
      {
        "type": "mcq",
        "text": "تعتمد مرحلة الإعداد على جمع المعلومات من مصادر متنوعة، فأي من التالي يُصنف بوضوح ضمن 'المصادر المكتبية'؟\n",
        "score": 1,
        "options": [
          "اللقاءات المباشرة مع الخبراء المتخصصين.",
          "استطلاعات رأي الجمهور في الشارع.",
          "التقارير الحكومية وأرشيف البرامج السابقة.",
          "المداخلات الهاتفية أثناء البرامج المباشرة."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذه المواد موثقة ومحفوظة وتتطلب بحثاً واطلاعاً للحصول على المعلومات الداعمة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777452156938"
      },
      {
        "type": "mcq",
        "text": "في حال استخدام 'مؤثر صوتي مسجل مسبقاً' لصوت الرعد أو أمواج البحر أثناء تنفيذ البرنامج، فهذا يُعد من المؤثرات:\n",
        "score": 1,
        "options": [
          "الطبيعية",
          "المصادر الشخصية",
          "موسيقى التتر",
          "الصناعية"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "المؤثرات التي تكون جاهزة ومسجلة مسبقاً لتوضع في المونتاج تُصنف كمؤثرات صناعية.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777452223746"
      },
      {
        "type": "mcq",
        "text": "يُعد الحفاظ على 'وحدة البرنامج' من أهم شروط كتابة النص الإذاعي (الاسكريبت). ماذا يعني هذا المبدأ الفني؟\n",
        "score": 1,
        "options": [
          "استخدام لغة واحدة (فصحى أو عامية) دون دمج بينهما إطلاقاً.",
          "أن يتم تسجيل البرنامج في استوديو واحد فقط لضمان وحدة الصوت.",
          "ترابط كافة عناصر وفقرات البرنامج لتخدم الهدف النهائي والموضوع الأساسي.",
          "أن يتكون البرنامج بأكمله من فقرة واحدة متصلة دون أي فواصل."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الوحدة تعني أن تساهم كل فقرة ومقابلة ومؤثر صوتي في بناء الفكرة الرئيسية دون تشتيت المستمع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777452316026"
      },
      {
        "type": "mcq",
        "text": "ما هي الطريقة الفعالة التي يتبعها المخرج الإذاعي مع 'الضيوف' قبل بدء التسجيل الفعلي داخل الاستوديو لضمان جودة الأداء؟",
        "score": 1,
        "options": [
          "تجنب الحديث معهم وترك هذه المهمة بالكامل لفني الصوت.",
          "منحهم النص لقراءته دون توجيه.",
          "إجراء دردشة ودية معهم لكسر رهبة الميكروفون وإعطائهم التعليمات الأساسية.",
          "بدء التسجيل فور دخولهم لالتقاط عفويتهم الأولى."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا الإجراء يمنح الضيف شعوراً بالأمان ويوضح له كيفية التعامل مع الإشارات والتوقيتات براحة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453002686"
      },
      {
        "type": "mcq",
        "text": "أي العمليات التالية تُعتبر العملية النهائية التي يقوم فيها فني الصوت بـ 'دمج العناصر الصوتية' (كلام المذيع، المؤثرات، والموسيقى) في توقيتات محددة؟",
        "score": 1,
        "options": [
          "التجميع النهائي",
          "المونتاج",
          "المزج الصوتي ",
          "التقييم الشكلي"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "عملية الميكس هي الخلط الفني والدقيق لطبقات الصوت المختلفة لتخرج للمستمع في شكل احترافي متوازن.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453193815"
      },
      {
        "type": "mcq",
        "text": "إذا أراد فريق العمل قياس مدى اهتمام الجمهور وحرصهم على المتابعة 'أثناء الدورة الإذاعية للبرنامج'، فأي نوع من التقييم يجب أن يعتمدوا عليه؟",
        "score": 1,
        "options": [
          "التقييم المرحلي",
          "تقييم المضمون",
          "التقييم الشكلي",
          "التقييم النهائي"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "يعتمد هذا التقييم على رصد ردود الفعل الفورية عبر المكالمات والرسائل أثناء فترة البث المستمرة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453265907"
      },
      {
        "type": "mcq",
        "text": "إذا كان البرنامج الإذاعي موجهاً لـ 'الأطباء والمهندسين'، فكيف يُصنف هذا الجمهور؟\n",
        "score": 1,
        "options": [
          "جمهور عام مهني.",
          "جمهور خاص (فئات سنية).",
          "جمهور خاص (فئات مهنية).",
          "جمهور خاص (فئات جغرافية)."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "توجيه البرنامج لمهن محددة يجعله موجهاً لجمهور خاص مصنف حسب المهنة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453851910"
      },
      {
        "type": "mcq",
        "text": "برنامج يتابع تحركات المشاهير وأخبار حياتهم اليومية، ما هو مصدر استمداد فكرة هذا البرنامج؟\n",
        "score": 1,
        "options": [
          "الموضوعات الإعلامية.",
          "الحياة اليومية.",
          "الظواهر الجديدة.",
          "الاهتمامات الإنسانية."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "فضول الناس لمعرفة حياة المشاهير والأشخاص تحت الأضواء يندرج تحت الاهتمامات الإنسانية.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453925308"
      },
      {
        "type": "mcq",
        "text": "أثناء خطوة جمع المادة والتواصل مع الضيوف، لماذا يُنصح المعد دائماً بتوفير 'شخصيات بديلة'؟\n",
        "score": 1,
        "options": [
          "لزيادة مدة البرنامج في حال كان قصيراً.",
          "لعمل صراع أفكار بين الضيوف على الهواء.",
          "لضمان عدم تعطل العمل في حال اعتذار الضيف الأساسي.",
          "لتنويع مصادر المعلومات المكتبية."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الضيف البديل هو خطة طوارئ تنقذ حلقة البرنامج من الإلغاء إذا حدث ظرف طارئ للضيف الأساسي.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777454001288"
      },
      {
        "type": "mcq",
        "text": "ا هو نوع الموسيقى الذي يُستخدم حصراً 'للفصل بين الفقرات وتغيير الحالة المزاجية' للمستمع؟\n",
        "score": 1,
        "options": [
          "موسيقى التتر.",
          "المؤثرات الصناعية.",
          "موسيقى الربط.",
          "المزج الصوتي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "موسيقى الربط تُستخدم داخل البرنامج للتنقل السلس بين الفقرات وتغيير الإيقاع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777454560753"
      },
      {
        "type": "mcq",
        "text": "في خطوة 'التجميع النهائي' للإعداد، ماذا يُقصد بمصطلح (الخريطة الصوتية)؟\n",
        "score": 1,
        "options": [
          "تحديد أماكن الموسيقى والمؤثرات والتسجيلات الخارجية داخل النص.",
          "وضع التصور النهائي لتوزيع الفقرات.",
          "تحديد زمن دقيق لكل فقرة بالثانية.",
          "رسم مخطط هندسي لمواقع الميكروفونات في الاستوديو."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الخريطة الصوتية ترسم متى يدخل كل مؤثر صوتي أو موسيقى ضمن سياق الحلقة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777454660466"
      },
      {
        "type": "mcq",
        "text": "لضمان بداية قوية وجذابة للاسكريبت، يمكن للمعد استخدام عدة تقنيات. أي من التالي يُعتبر إحدى هذه التقنيات المذكورة في الفصل؟\n",
        "score": 1,
        "options": [
          "نقل المستمع لموقع الحدث مباشرة.",
          "استخدام كلمات غير مألوفة لإثارة الأنتباه.",
          "بدء البرنامج بشرح مفصل لأهداف الحلقة.",
          "توديع المستمع بلطف ووعده بلقاء جديد."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذه التقنيه المباشرة تخلق إثارة وتضع المستمع في قلب الحدث فوراً، وهي من أنجح طرق البداية القوية.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777454971408"
      },
      {
        "type": "mcq",
        "text": "ما هي الخطوة الإدارية الهامة التي يجب على المخرج القيام بها 'بعد انتهاء التسجيل' وقبل حفظ الشريط؟",
        "score": 1,
        "options": [
          "الاتصال بالجمهور لعمل تقييم مرحلي.",
          "ملء 'استمارة بيانات الإنتاج' التي تتضمن اسم البرنامج ومدته وتاريخه",
          "تغيير الديكور استعداداً للبرنامج التالي",
          "القيام بالمونتاج الفوري للبرنامج"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تُرفق هذه الاستمارة بالشريط لتوثيق كافة تفاصيله وضمان بثه في وقته المحدد دون أخطاء.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777455024702"
      },
      {
        "type": "mcq",
        "text": "بعد التقييم المرحلي، قرر فريق العمل 'تعديل' البرنامج. متى يتم اتخاذ قرار التعديل عادة؟\n",
        "score": 1,
        "options": [
          "إذا كانت الرسالة مفهومة ومقبولة تماماً لدى الجمهور.",
          "إذا تم تغيير وقت البث بسبب المنافسة.",
          "إذا كانت الرسالة غير فعالة أو غير مفهومة تماماً.",
          "إذا كان هناك نقص أو سوء فهم لبعض أجزاء الرسالة."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "التعديل هو الحل لتصحيح المسار وسد النواقص لإنقاذ البرنامج وتحسينه.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777455179322"
      },
      {
        "type": "mcq",
        "text": "إذا كان البرنامج يهدف إلى 'تحويل السلوكيات الخاطئة إلى سلوكيات مرغوبة اجتماعياً لدفع التنمية'، فهذا يندرج تحت أي من أهداف تقييم المضمون؟",
        "score": 1,
        "options": [
          "تنمية الوعي.",
          "تغيير الاتجاهات.",
          "تعديل التصرفات الظاهريه.",
          "التقييم الشكلي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "السلوك هو التصرف الظاهري، وتعديله هو أعلى درجات التأثير الإيجابي للبرامج لدفع التنمية.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777455618214"
      },
      {
        "type": "mcq",
        "text": "من طرق قياس رجع الصدى (Feedback)، أي وسيلة تُعتبر سريعة ومنخفضة التكلفة للتواصل المباشر مع الجمهور؟",
        "score": 1,
        "options": [
          "البريد المباشر.",
          "شبكات التواصل الاجتماعي.",
          "المجموعات البؤرية (استطلاع الرأي).",
          "الأحاديث التليفونية."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "المكالمات الهاتفية توفر تواصلاً لحظياً وسريعاً وتكلفتها منخفضة للتقييم السريع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777455758792"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "",
    "startTime": "",
    "endTime": "",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1778331381149",
    "timestamp": "2026-05-09T12:56:21.149Z",
    "titleAr": "اختبار شامل علي الماده",
    "titleEn": "A comprehensive test on the material",
    "isShuffled": true,
    "feedbackMode": "immediate",
    "subjectId": "subjects_1778154846161",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "يقتصر دور \"الويب الدلالي\" على استرجاع الكلمات المفتاحية بشكل أسرع من الويب التقليدي دون التدخل في تحليل المعنى",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الويب الدلالي لا يقتصر على الكلمات، بل أساسه فهم المعنى والسياق",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778331724058"
      },
      {
        "type": "mcq",
        "text": "رغم التطور الهائل في الاعتماد على الذكاء الاصطناعي وإنترنت الأشياء، لا تزال خدمات الإرشاد المرجعي الافتراضي تعتمد بشكل أساسي على العنصر البشري",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "العنصر البشري ركيزة أساسية ولا يلغيه التطور التقني",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778331768570"
      },
      {
        "type": "mcq",
        "text": "تُعد \"بوابة إنترنت الأشياء\" (IoT Gateway) مكوناً إلزامياً لا غنى عنه في أي نظام ذكي للمكتبات لضمان وصول البيانات إلى السحابة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "بوابة إنترنت الأشياء ليست ضرورية دائماً، بل تستخدم غالباً عند وجود عدد كبير من الحساسات للفلترة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778331889930"
      },
      {
        "type": "mcq",
        "text": "إذا أرادت مكتبة جامعية تطوير بيئة سحابية لبرمجة واختبار تطبيق جديد لها، فإنها ستحتاج للاشتراك في نموذج البنية التحتية كخدمة (IaaS) مثل أمازون AWS",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لبرمجة واختبار تطبيق تحتاج إلى منصة كخدمة PaaS وليس بنية تحتية IaaS",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778331951625"
      },
      {
        "type": "mcq",
        "text": "تقتصر وظيفة برمجيات إدارة الحقوق الرقمية (DRM) على منع النسخ والطباعة، ولا علاقة لها بالتحكم في مدة الإعارة الإلكترونية.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تقنية DRM تتحكم أيضاً في مدة الإعارة الإلكترونية وتلغي الوصول بعد انتهاء المدة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332013529"
      },
      {
        "type": "mcq",
        "text": "رقمنة مخطوطة تاريخية نادرة جداً ومتهالكة تتطلب استخدام ماسحات ضوئية مسطحة (Flatbed Scanners) لضمان أعلى دقة لملامح الورق",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الماسحات المسطحة تتلف المخطوطات الهشة، يجب استخدام كاميرات عالية الجودة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332076241"
      },
      {
        "type": "mcq",
        "text": "يُعد توفير الكتب الصوتية وقارئات الشاشة تطبيقاً مباشراً لخدمة \"إمكانية الوصول\" (Accessibility) لدعم مبدأ الشمول الرقمي بالمكتبات.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تطبيقات مباشرة لإتاحة المعرفة لذوي الإعاقة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332113225"
      },
      {
        "type": "mcq",
        "text": "في المكتبات الرقمية، إذا كان الكتاب متاحاً في \"المجال العام\" (Public Domain)، فهذا يعني إعفاء المكتبة من معيار \"القيمة والأهمية العلمية\" عند اختياره للرقمنة",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "كون الكتاب في المجال العام يحل مشكلة الحقوق فقط، لكن يجب أن يخضع لمعيار القيمة والأهمية لكي لا نهدر الموارد في رقمنة محتوى بلا قيمة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332161057"
      },
      {
        "type": "mcq",
        "text": "تعتمد خدمة \"البث الانتقائي للمعلومات\" على بناء ملف شخصي لاهتمامات المستفيد، عكس \"الإحاطة الجارية\" التي تقدم إعلاماً عاماً للجميع",
        "score": 1,
        "options": [
          "صح",
          "خطأ "
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذا هو الفرق الجوهري بينهما",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332196044"
      },
      {
        "type": "mcq",
        "text": "نظام (Greenstone) هو الخيار الأمثل والوحيد إذا أرادت مكتبة ما بناء مستودع رقمي مؤسسي مقتصر على لغة واحدة فقط.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "DSpace هو الأكثر استخداماً للمستودعات المؤسسية، بينما Greenstone يتميز بدعم اللغات المتعددة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332257689"
      },
      {
        "type": "mcq",
        "text": "من أبرز عيوب الحوسبة السحابية ظاهرة (Vendor Lock-in)، والتي تعني صعوبة وتكلفة نقل بيانات المكتبة من مزود سحابي إلى مزود آخر",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الارتباط بالمزود أو Vendor Lock-in من أبرز العيوب",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332321152"
      },
      {
        "type": "mcq",
        "text": "استخدام المكتبة الرقمية للأنتولوجيات (Ontologies) يساعد في رسم خرائط معرفية تتيح وصفاً أعمق للموارد مقارنة بالفهرسة التقليدية",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الأنتولوجيات هي خرائط معرفية دقيقة للوصف",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332418024"
      },
      {
        "type": "mcq",
        "text": "التقييم الاقتصادي للمكتبة الرقمية يركز فقط على اختيار أرخص قواعد البيانات لتقليل نفقات البنية التحتية.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التقييم الاقتصادي لا يعني الأرخص، بل مقارنة التكلفة بمستوى الفائدة والعائد على المستفيدين",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332461472"
      },
      {
        "type": "mcq",
        "text": "إحدى المزايا الجوهرية للحوسبة السحابية هي أن عملية استعادة البيانات المحذوفة أو النسخ الاحتياطية تكون دائماً أسرع بكثير من الخوادم المحلية",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "استعادة البيانات من السحابة تعتبر \"أبطأ\" مقارنة باستعادتها من الخوادم المحلية المباشرة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332531920"
      },
      {
        "type": "mcq",
        "text": "يمكن لإنترنت الأشياء (IoT) تحسين الإدارة البيئية للمكتبة (كالتكييف والإضاءة) تلقائياً ودون أي تدخل بشري مباشر",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذا من أهم أدوار إنترنت الأشياء في إدارة البيئة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332566307"
      },
      {
        "type": "mcq",
        "text": "يعتمد استرجاع النصوص الكاملة للرسائل الجامعية دائماً على نظام \"الوصول المفتوح\" (Open Access) في جميع المكتبات الرقمية",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "ليس دائماً؛ بعض الرسائل الجامعية تكون مقيدة الوصول وتتطلب حساباً جامعياً",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332639343"
      },
      {
        "type": "mcq",
        "text": "لكي تنجح خدمة \"تبادل الإعارة\" بين المكتبات، يجب أن تمتلك كل مكتبة نفس قواعد البيانات والاشتراكات لضمان توافق الملفات",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تبادل الإعارة يعتمد على الاتفاقيات لتوفير ما \"ينقص\" المكتبة الأخرى، وليس شرطاً تطابق القواعد",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332690095"
      },
      {
        "type": "mcq",
        "text": "تقنية RFID تستخدم بشكل أساسي كجزء من أنظمة الأمان السحابية لمنع اختراق بيانات المستخدمين",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "RFID تستخدم لتتبع الكتب المادية والمقتنيات وليس للأمان السحابي السيبراني",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332747631"
      },
      {
        "type": "mcq",
        "text": "\"المستخلصات الإلكترونية\" هي خدمة مدفوعة دائماً، تقدم فيها المكتبة النص الكامل للوثيقة عبر البريد الإلكتروني للمستفيد",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المستخلصات خدمة تقدم ملخصاً وليس النص الكامل، وتوصيل الوثائق هو الذي قد يكون مدفوعاً",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332826759"
      },
      {
        "type": "mcq",
        "text": "يهدف الويب الدلالي إلى تحويل الإنترنت من مجرد نصوص مخصصة للعرض على البشر، إلى شبكة بيانات مترابطة قابلة للفهم والمعالجة من قِبل الآلات",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "",
        "studentId": "students_1775379443604",
        "showExp": false,
        "id": "q_1778332889375"
      },
      {
        "type": "mcq",
        "text": "يُشترط لإنشاء مكتبة رقمية ناجحة أن تتواجد خوادم التخزين (Servers) فعلياً داخل المبنى الرئيسي للمؤسسة أو الجامعة",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "بفضل الحوسبة السحابية، لم يعد من الضروري وجود خوادم فعلية داخل المبنى",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778332930446"
      },
      {
        "type": "mcq",
        "text": "خضوع المقالات الرقمية لعملية \"المراجعة العلمية\" (Peer Review) يرفع من تقييمها ضمن معيار \"الدقة والموثوقية\"",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "",
        "studentId": "students_1775379443604",
        "showExp": false,
        "id": "q_1778332976903"
      },
      {
        "type": "mcq",
        "text": "خدمة \"معارض الكتب عن بعد\" تقتصر على عرض أغلفة الكتب، ولا تتيح للمستفيدين التفاعل أو اقتراح شراء كتب جديدة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تتيح تفاعل المستفيدين واقتراح شراء كتب جديدة",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778333102623"
      },
      {
        "type": "mcq",
        "text": "الاعتماد الكلي على الإنترنت هو العيب الرئيسي الذي قد يعطل عمل المكتبات التي تعتمد بنسبة 100% على الحوسبة السحابية",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "",
        "studentId": "students_1775379443604",
        "showExp": false,
        "id": "q_1778333354814"
      },
      {
        "type": "mcq",
        "text": "مكتبة طبية متخصصة ترغب في تحليل آلاف السجلات الطبية القديمة واكتشاف أنماط الأمراض باستخدام الذكاء الاصطناعي، أي الخدمات السحابية التالية هي الأنسب لها؟",
        "score": 1,
        "options": [
          "خدمات تخزين ومشاركة الملفات (مثل Dropbox)",
          "منصات البث الحي والتدفق (مثل Twitch)",
          "خدمات الذكاء الاصطناعي السحابية (مثل IBM Watson)",
          "أدوات التعاون الجماعي (مثل Microsoft Teams)"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "السؤال يذكر بوضوح \"تحليل سجلات\" و\"اكتشاف أنماط باستخدام الذكاء الاصطناعي\"، وهذا ينطبق حصرياً على خدمات الذكاء الاصطناعي السحابية التي تعالج البيانات الضخمة، وليس خدمات التخزين العادية كـ Dropbox أو أدوات التواصل كـ Teams.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778333785300"
      },
      {
        "type": "mcq",
        "text": "أي من المواقف التالية يُعد انتهاكاً لحقوق الملكية الفكرية في بيئة المكتبات الرقمية؟",
        "score": 1,
        "options": [
          "قيام المكتبة برقمنة كتاب مؤلفه توفي منذ 100 عام (مجال عام)",
          "قيام المكتبة بتطبيق تقنية DRM لتقييد تحميل كتاب إلكتروني مشتراة",
          "قيام المكتبة بشراء نسخة رقمية واحدة وإتاحة تحميلها المفتوح لآلاف الطلاب بقرار داخلي",
          "توفير المكتبة لرابط خارجي يحيل الطالب إلى منصة الناشر الأصلية"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "المكتبة لا تملك حق \"الإتاحة المفتوحة\" لنسخة واحدة مشتراة لآلاف الطلاب لأن هذا يضر بحقوق الناشر المادية. الاستخدام الصحيح يتطلب إما اشتراكاً يغطي هذا العدد، أو تطبيق تقنية (DRM) لتقييد النسخ وتحديد عدد المستعيرين في نفس الوقت.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778333983931"
      },
      {
        "type": "mcq",
        "text": "باحث يبحث عن \"تاريخ العملات في العصر العباسي\"، فقام محرك بحث المكتبة تلقائياً بجلب خرائط للدولة العباسية ومعلومات عن الخلفاء من (ويكيبيديا) وربطها بنتائج البحث، هذا التطبيق يُعرف بـ:",
        "score": 1,
        "options": [
          "الحوسبة السحابية (Cloud Computing)",
          "البيانات المترابطة (Linked Data) في الويب الدلالي",
          "البث الانتقائي للمعلومات",
          "الحفظ الرقمي للمخطوطات"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": " استرجاع معلومات من قواعد بيانات خارجية مفتوحة (مثل ويكيبيديا) وربطها آلياً بنتائج البحث المحلية في المكتبة هو التطبيق العملي لميزة \"البيانات المترابطة\" التي تعد من أهم أدوار الويب الدلالي (Semantic Web).\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778334100394"
      },
      {
        "type": "mcq",
        "text": "اكتشفت إدارة مكتبة رقمية أن بعض الوثائق الرقمية المحفوظة بصيغة (Word 97) القديمة لم تعد تفتح على الأجهزة الحديثة، الخدمة المسؤولة عن معالجة هذه المشكلة هي:",
        "score": 1,
        "options": [
          "خدمة الإحاطة الجارية",
          "خدمة الحفظ الرقمي",
          "خدمة المستخلصات الإلكترونية",
          "خدمة الإعارة الإلكترونية"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "\"الحفظ الرقمي\" لا يعني فقط تخزين الملف، بل يشمل \"صيانة الملفات من تقادم الصيغ\" (Format Obsolescence) لضمان بقائها قابلة للقراءة على الأجهزة الحديثة بمرور الزمن، وهو ما يحل مشكلة ملفات (Word 97) القديمة.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778334175779"
      },
      {
        "type": "mcq",
        "text": "عند تصميم واجهة مستخدم (UI) لمكتبة رقمية، تقرر وضع شريط بحث كبير في المنتصف، واستخدام أيقونة (عدسة مكبرة) واضحة، وتوحيد لون زر \"التحميل\" باللون الأخضر في كل الصفحات، هذه الإجراءات تطبيق لمبادئ",
        "score": 1,
        "options": [
          "البساطة، التلميحات البصرية، واتساق التصميم",
          "التغذية الراجعة، والتوافق مع الأجهزة",
          "التقييم الاقتصادي، والجدوى التقنية",
          "التحديث التلقائي للحوسبة السحابية"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "شريط البحث في المنتصف يمثل (البساطة وتجنب التعقيد)، أيقونة العدسة تمثل (التلميح البصري)، وتوحيد لون زر التحميل في كل الصفحات يمثل (اتساق التصميم).\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778334254178"
      },
      {
        "type": "mcq",
        "text": "المكتبة الرقمية لا تلغي وظيفة أخصائي المكتبات، بل تحوله من مجرد حارس للكتب إلى مدير للمحتوى الرقمي ومرشد افتراضي.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "",
        "studentId": "students_1775379443604",
        "showExp": false,
        "id": "q_1778334430946"
      },
      {
        "type": "mcq",
        "text": "في نظام \"إنترنت الأشياء\" (IoT) داخل المكتبة الذكية، ما هو المكون الذي يُعتبر \"العقل المفكر\" الذي يأخذ البيانات (مثل درجة حرارة الغرفة) ويصدر قراراً تلقائياً (مثل تشغيل التكييف)؟",
        "score": 1,
        "options": [
          "الحساسات (Sensors)",
          "بوابة إنترنت الأشياء (IoT Gateway)",
          "تحليل البيانات والذكاء الاصطناعي (AI)",
          "واجهة المستخدم "
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الحساسات تجمع البيانات فقط، والبوابة تفلترها، لكن \"العقل المفكر\" الذي يأخذ هذه البيانات ويكتشف النمط ويصدر قراراً تلقائياً (كالتشغيل) هو نظام \"تحليل البيانات والذكاء الاصطناعي\".\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778334504097"
      },
      {
        "type": "mcq",
        "text": "توفير منصة (دار المعلم) التي تضم محتوى مبسطاً ومقسماً حسب الصفوف الدراسية يعتبر مثالاً على تصنيف المكتبات الرقمية حسب:",
        "score": 1,
        "options": [
          "الإتاحة (مفتوحة / مقيدة)",
          "نوع المحتوى (تراثية / وسائط متعددة)",
          "الجهة المالكة والتبعية (مدرسية / تعليمية عامة)",
          "مستوى الأمان السحابي"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "منصة \"دار المعلم\" تتبع وزارة التعليم وتخدم المدارس والصفوف الدراسية، وهذا يقع تحت تصنيف \"الجهة المالكة والتبعية\"، وتحديداً (مكتبات مدرسية/تعليمية)",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778334704872"
      },
      {
        "type": "mcq",
        "text": "إذا كان هدف المكتبة هو تجنب تكاليف شراء معدات \"خوادم مادية\" (Servers) وصيانتها بشكل دوري، فإن التقنية الأساسية التي تحقق هذا الهدف الاقتصادي هي:",
        "score": 1,
        "options": [
          "الويب الدلالي (Semantic Web)",
          "الحوسبة السحابية (Cloud Computing)",
          "تقنية التتبع الذكية (RFID)",
          "التعرف الضوئي على الحروف (OCR)"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الفائدة الاقتصادية الكبرى للحوسبة السحابية هي تحويل تكاليف شراء وصيانة البنية التحتية الصلبة (الخوادم/السيرفرات) إلى خدمة تُستأجر عبر الإنترنت عبر الدفع مقابل الاستخدام.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778334764176"
      },
      {
        "type": "mcq",
        "text": "أي من المعايير التالية يختص بالتأكد من أن حالة الورق في كتاب قديم تسمح بوضعه على جهاز المسح الضوئي (Scanner) والحصول على دقة وضوح (300-600 DPI)؟",
        "score": 1,
        "options": [
          "معايير الحقوق القانونية",
          "معايير الموارد والتكاليف",
          "معايير الاستخدام والوصول",
          "معايير الجدوى التقنية"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "الجدوى التقنية تدرس مدى \"قابلية\" الوثيقة للرقمنة، مثل تحمل الورق القديم لجهاز المسح، وإمكانية إنتاج صورة واضحة بدقة (300 إلى 600 DPI).\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778334826640"
      },
      {
        "type": "mcq",
        "text": "أرادت جامعة تقديم ورشة عمل للطلاب الجدد لشرح كيفية استخدام قاعدة بيانات (PubMed)، هذه الخدمة تندرج تحت:",
        "score": 1,
        "options": [
          "خدمة توصيل الوثائق",
          "خدمات الإرشاد والتدريب عن بُعد",
          "خدمة الإعارة المتبادلة",
          "خدمة معارض الكتب عن بُعد"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الورش التدريبية التي تهدف لتعريف المستفيدين (الطلاب الجدد) بكيفية استخدام قواعد البيانات تندرج تحت خدمات الإرشاد وتنمية الوعي المعلوماتي.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778334895736"
      },
      {
        "type": "mcq",
        "text": "يُعزى الفضل الأكبر في تحول المكتبات الرقمية من مجرد مستودعات لحفظ الملفات إلى مؤسسات معلوماتية متكاملة، إلى توفر سعات التخزين السحابية الهائلة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "السؤال خادع. سعات التخزين الهائلة تخدم \"المستودعات\" أيضاً. السر الحقيقي والعنصر الحاسم الذي يحولها لمكتبة هو \"التنظيم المنهجي\" وآليات البحث والاسترجاع الدقيقة، وليس مجرد سعة التخزين.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778335260726"
      },
      {
        "type": "mcq",
        "text": "يُعد ظهور معايير مقننة مثل (MARC) لتنظيم المعلومات دافعاً \"تنظيمياً مؤسسياً\"، بينما يُصنف ظهور التعليم عن بعد كدافع \"اجتماعي وتعليمي\" لظهور المكتبات الرقمية.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذا السؤال يختبر قدرة الطالب على التفرقة بين \"عوامل ظهور المكتبات\". معيار (MARC) هو عامل تنظيمي بحت لتوحيد الفهرسة، بينما التعليم عن بعد يندرج تحت العوامل الاجتماعية والتعليمية.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778335306775"
      },
      {
        "type": "mcq",
        "text": "المكتبة الرقمية التي تركز على جمع رسائل الماجستير والدكتوراه وأبحاث هيئة التدريس لجامعة معينة وإتاحتها للباحثين، تُصنف دائماً على أنها \"مكتبة متخصصة / موضوعية\".",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": " المكتبة التي تجمع إنتاج الجامعة (كالرسائل والأبحاث) تُصنف كـ \"مكتبة جامعية / مؤسسية\" (Institutional). أما المكتبة \"المتخصصة\" فهي التي تركز على مجال علمي واحد بعمق (مثل الطب في PubMed أو القانون) بغض النظر عن الجامعة.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778335369686"
      },
      {
        "type": "mcq",
        "text": "تُعتبر خاصية \"الوصول المتزامن\" في البيئة الرقمية هي الحل الجذري الذي ألغى مشكلة الإعارة التقليدية، حيث أتاحت لآلاف الباحثين قراءة نفس النسخة في نفس اللحظة دون تعارض.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "في المكتبة التقليدية، الكتاب الورقي يقرأه شخص واحد فقط، بينما \"الوصول المتزامن\" (Simultaneous Access) هو الخاصية التقنية التي مكنت آلاف الأشخاص من فتح نفس الملف (PDF) في نفس الثانية.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778335411871"
      },
      {
        "type": "mcq",
        "text": "عند اختيار مصادر المعلومات لرقمنتها، يشترط معيار \"الجدوى التقنية\" أن تكون المادة ذات قيمة تاريخية عالية جداً لتعويض التكلفة الباهظة لعملية المسح الضوئي",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "السؤال يخلط بين معيارين! \"الجدوى التقنية\" تعني قدرة الأجهزة على مسح الورق دون إتلافه وبدقة وضوح عالية (DPI). أما \"القيمة التاريخية\" فهي تندرج تحت معيار مختلف تماماً وهو \"قيمة المحتوى\".\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1778335473438"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "mahmoud21abdalrhman@gmail.com,andrewmegala@gmail.com",
    "startTime": "2026-05-09T21:30",
    "endTime": "2026-05-09T22:30",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "semesterId": "semesters_1775125622791",
    "yearId": "year_1",
    "webhookUrl": ""
  },
  {
    "id": "quizzes_1778508984479",
    "timestamp": "2026-05-11T14:16:24.479Z",
    "titleAr": "الاختبار الشامل للتعلم الرقمي 🏆",
    "titleEn": "Digital Learning Comprehensive Test 🏆",
    "isShuffled": true,
    "feedbackMode": "immediate",
    "subjectId": "subjects_1775504450774",
    "publisherId": "students_1775125739063",
    "questions": [
      {
        "type": "mcq",
        "text": "الفرق بين التعليم الإلكتروني والتعليم الرقمي هو فرق في \"الوسيلة\" فقط وليس في \"المكان أو الفلسفة\"",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الفرق يمتد للمكان؛ فالتعليم الإلكتروني غالباً ما يكون \"عن بُعد\" خارج الفصل، بينما الرقمي يدمج بين الواقع الفعلي والرقمي داخل الفصل.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778509773504"
      },
      {
        "type": "mcq",
        "text": "إذا قام المعلم بتصميم جدول زمني لتدفق العمليات التعليمية، فإنه بذلك يمارس مهام تندرج تحت \"المكون التعليمي\".",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الجداول الزمنية وتنظيم تدفق العمليات وضمان سير المنظمة وفق جدول محدد يتبع \"المكون الإداري\".  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778509835559"
      },
      {
        "type": "mcq",
        "text": "خاصية \"الفردية\" تضمن وصول جميع المتعلمين إلى نفس مستوى الاتقان، رغم اختلاف الوقت المخصص لكل منهم.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تعتمد الفردية على \"الخطو الذاتي\"، مما يسمح باختلاف زمن التعلم طولاً وقصراً للوصول لنفس مستوى الإتقان حسب قدرات كل متعلم.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778510129916"
      },
      {
        "type": "mcq",
        "text": " تعتبر \"الرقمنة\" هي المبدأ الأساسي الذي تقوم عليه مستحدثات مثل المكتبات الإلكترونية والمتاحف الإلكترونية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الرقمنة مرتبطة بالمستحدثات التقنية في طريقة عملها، وهي الأساس لمستحدثات الصورة الرقمية والمكتبات والمتاحف الإلكترونية.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778510225940"
      },
      {
        "type": "mcq",
        "text": "\"التفكير النقدي\" في التربية الرقمية يقتصر فقط على معرفة كيفية البحث عن البيانات في محركات البحث.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التفكير النقدي يتجاوز البحث ليشمل تقييم المحتوى، وتمييز الحقائق عن الآراء، والمصادر الموثوقة عن الدعائية أو المضللة.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778510311603"
      },
      {
        "type": "mcq",
        "text": "خاصية \"الإتاحة\" ترتبط بتوفير مثيرات متنوعة وبدائل يتحكم المتعلم في أسلوب ومعدل عرضها يدوياً.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الإتاحة تمنح المتعلم التحكم الكامل في عرض المحتوى وتوفر له البدائل والخيارات في الوقت الذي يناسبه.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778513868129"
      },
      {
        "type": "mcq",
        "text": "يركز البعد \"الأخلاقي والقانوني\" في التربية الرقمية على كفاءة استخدام أدوات التشفير وحماية كلمات المرور.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": " كفاءة التشفير وكلمات المرور تتبع البعد \"التقني والوقائي\"، بينما البعد الأخلاقي يركز على الملكية الفكرية والخصوصية وتجنب التنمر.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778513981695"
      },
      {
        "type": "mcq",
        "text": "الكونية\" في تكنولوجيا التعليم تعني نقل المعرفة من مكان لآخر عبر إلغاء القيود الزمانية والمكانية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الكونية تفتح آفاقاً لتوصيل الأشخاص بمصادر المعلومات ونشر المعرفة في أي مكان حول العالم دون قيود.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514063630"
      },
      {
        "type": "mcq",
        "text": "المكون \"التكنولوجي\" هو المسؤول عن تحويل المحتوى التعليمي التقليدي إلى صورة رقمية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": " يشمل المكون التكنولوجي الشبكات والمواقع وعملية \"رقمنة\" المحتوى التقليدي.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514147852"
      },
      {
        "type": "mcq",
        "text": "يساعد \"التفاعل الرقمي\" في الصف الافتراضي المعلم على تقديم \"تغذية راجعة\" فورية للطلاب.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "يسمح التعليم الرقمي بالاتصال الفوري، وفي التقويم الرقمي يقدم المعلم التغذية الراجعة بعد تصحيح الاختبارات إلكترونياً.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514202692"
      },
      {
        "type": "mcq",
        "text": "عندما يواجه الطالب مشكلة \"الضياع بين كمية معلومات هائلة غير موثقة\"، فإنه يفتقر لمهارة أساسية في:",
        "score": 1,
        "options": [
          "البعد التقني للتربية الرقمية.",
          "البعد المعرفي للتربية الرقمية.",
          "المكون الإداري للتعليم الرقمي."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "البعد المعرفي يتضمن الثقافة المعلوماتية والقدرة على البحث الفعال والتمييز بين المحتوى الموثوق والمضلل.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514417298"
      },
      {
        "type": "mcq",
        "text": "توفير خيارات متنوعة تتناسب مع مستويات الذكاء وأنماط التعلم المختلفة\" يمثل خاصية:",
        "score": 1,
        "options": [
          "التنوع.",
          "الكونية.",
          "الإلكترونية."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "التنوع يعني توفير بيئة يجد فيها كل متعلم ما يناسبه من بدائل (أنشطة، مواد، اختبارات) تتوافق مع قدراته.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514507681"
      },
      {
        "type": "mcq",
        "text": "أي من الأبعاد التالية يركز على \"الحفاظ على الصحة الجسدية من الآثار السلبية لإدمان الشاشات\"؟",
        "score": 1,
        "options": [
          "البعد المعرفي.",
          "البعد الأخلاقي والقانوني.",
          "البعد التقني والوقائي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "يشمل البعد الوقائي الحفاظ على الصحة النفسية والجسدية من الآثار السلبية للتكنولوجيا.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514723951"
      },
      {
        "type": "mcq",
        "text": "مفهوم \"التعليم الرقمي\" يتجاوز \"التعليم الإلكتروني\" في كونه:",
        "score": 1,
        "options": [
          "يعتمد فقط على الإنترنت في المنزل.",
          "ممارسة تعليمية تستخدم التكنولوجيا لتعزيز التجربة داخل وخارج الفصل. ",
          "يقتصر على استخدام منصات مثل Coursera."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التعليم الرقمي أشمل ويدمج بين الواقع الفعلي والرقمي، بينما الإلكتروني يعتمد حصرياً على الإنترنت.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514822591"
      },
      {
        "type": "mcq",
        "text": "المزيج المتجانس الذي يجذب انتباه المتعلم من خلال عرض الصور والرسومات\" هو نتاج لخاصية:\nأ) الرقمنة.\n",
        "score": 1,
        "options": [
          "الرقمنة.",
          "التكاملية. ",
          "الإتاحة."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التكاملية تعني التنسيق المتناغم بين الوسائط المختلفة (نصوص، أصوات، صور) لتحقيق هدف تعليمي منشود",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514881174"
      },
      {
        "type": "mcq",
        "text": "يشتمل \"المكون الإداري\" للتعليم الرقمي على كل مما يلي عدا:",
        "score": 1,
        "options": [
          "التخطيط الاستراتيجي والموازنات.",
          "الفلسفة التعليمية والأهداف.",
          "المكتبات والمراكز ونظم الامتحانات. ",
          ""
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "المكتبات ونظم الامتحانات تتبع \"المكون التعليمي\"، بينما التخطيط والموازنات تتبع المكون الإداري.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778514968989"
      },
      {
        "type": "mcq",
        "text": "تعرّف \"التربية الرقمية\" بأنها مجموعة معايير وقيم تهدف إلى:",
        "score": 1,
        "options": [
          "زيادة سرعة تصفح الإنترنت.",
          "التعامل مع التكنولوجيا بوعي وفاعلية بطريقة أخلاقية وقانونية. ",
          "تحويل الكتب الورقية إلى كتب إلكترونية فقط."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التربية الرقمية تشمل الوصول للمعلومات وتقييمها نقدياً وإنتاجها ومشاركتها بوعي ومسؤولية.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778515033389"
      },
      {
        "type": "mcq",
        "text": "أي الخصائص التالية تعبر عن \"قدرة المتعلم على الاستجابة نحو مصدر التعلم مما يؤدي لاستمرار التعليم\"؟",
        "score": 1,
        "options": [
          "التفاعلية. ",
          "الجودة الشاملة.",
          "الكونية."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "التفاعلية هي قيام المتعلم بمشاركة نشطة في صورة استجابات نحو مصدر التعلم، مما يكسر الجمود.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778515119427"
      },
      {
        "type": "mcq",
        "text": "من أهمية التربية الرقمية \"تعزيز التعلم الذاتي\"، ويتحقق ذلك من خلال:",
        "score": 1,
        "options": [
          "انتظار الطالب للمحاضرات التقليدية.",
          "استخدام الموارد الرقمية للتعلم وفق الوتيرة الخاصة",
          "الالتزام بكلمات المرور القوية."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التربية الرقمية تمنح الطالب القدرة على التحكم في مسار تعلمه واستخدام الموارد بشكل مستقل.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778515213691"
      },
      {
        "type": "mcq",
        "text": "إعداد الطلاب لبيئات العمل الرقمية وإنتاج المحتوى والتواصل عبر المنصات يندرج تحت:",
        "score": 1,
        "options": [
          "خاصية الرقمنة.",
          "أهمية التربية الرقمية لمستقبل العمل. ",
          "المكون التكنولوجي للبنية التحتية."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التربية الرقمية تجهز الطلاب لسوق العمل من خلال إكسابهم مهارات التواصل وإنتاج المحتوى الرقمي.  ",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778515301138"
      },
      {
        "type": "mcq",
        "text": "أي من الخصائص التالية تميز \"الاتجاهات النفسية\" عن \"الدوافع الفطرية\" وفقاً لما ورد في المصدر؟",
        "score": 1,
        "options": [
          "أنها قوى داخلية لا نلاحظها مباشرة.",
          "أنها استعدادات مكتسبة من البيئة وليست موروثة.",
          "أنها تهدف دائماً لاستعادة الاتزان البيولوجي.",
          "أنها ثابتة ثباتاً مطلقاً ولا تتغير أبداً."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يوضح المصدر أن الاتجاهات هي \"استعدادات مكتسبة وليست فطرية\"، فهي تعتمد على الاستعداد الفطري لكن مضمونها يُكتسب من البيئة، بينما الدوافع الأولية (الفطرية) ترتبط بالتكوين البيولوجي.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778515883821"
      },
      {
        "type": "mcq",
        "text": "عندما يتحول المتعلم الرقمي إلى \"منتج للمعرفة\" بدلاً من \"مستهلك لها\"، فإن هذا يؤدي مباشرة إلى:",
        "score": 1,
        "options": [
          "تقليل الحاجة إلى مهارات التفكير الناقد.",
          "زيادة دافعيته للتعلم وتفاعله مع المحتوى.",
          "العودة إلى أسلوب التلقين التقليدي.",
          "التوقف عن استخدام المصادر الإلكترونية."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التحليل:\nذكر المصدر أن جعل المتعلم \"منتجاً للمعرفة\" هو أحد ثمار التعلم الرقمي الذي يزيد من دافعيته للتعلم وتفاعله الإيجابي مع المادة العلمية.\n",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778515942356"
      },
      {
        "type": "mcq",
        "text": "\"المعنى\" كعامل في تكوين الاتجاهات يُقصد به:",
        "score": 1,
        "options": [
          "التعريف اللغوي لموضوع الاتجاه في القواميس.",
          "المعلومات التي تلقاها الفرد عن الموضوع وجعلته يدركه بشكل معين.",
          "المشاعر السارة التي تلي القيام بسلوك معين.",
          "محاكاة سلوك أفراد الأسرة دون وعي بالأسباب."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "وفقاً للمصدر، \"المعنى\" هو حصيلة المعلومات التي يستقبلها الفرد عن موضوع ما، وعلى أساس هذا الإدراك المعرفي يبدأ في تكوين اتجاهه بالقبول أو النفور.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778516025235"
      },
      {
        "type": "mcq",
        "text": "في أي حالة يكون تعديل الاتجاه \"أسهل\" وأكثر عرضة للتغيير؟",
        "score": 1,
        "options": [
          "إذا كان الاتجاه مركزياً ومندمجاً في بناء الشخصية.",
          "إذا تكون الاتجاه منذ مرحلة الطفولة المبكرة.",
          "إذا كان الاتجاه هامشياً وغير محدد المعالم.",
          "إذا كان الفرد مقتنعاً تماماً بمضمون الاتجاه."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "يشير المصدر إلى أن الاتجاه الضعيف أو \"الهامشي غير محدد المعالم\" يكون عرضة للتعديل بسهولة إذا تعرض الفرد لمؤثرات معارضة له، عكس الاتجاهات المركزية القوية.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778516091667"
      },
      {
        "type": "mcq",
        "text": "الوظيفة الثانية للدوافع (إمداد السلوك بالطاقة) تؤكد أن التعلم يحدث أساساً عن طريق:",
        "score": 1,
        "options": [
          "الحفظ والتلقين المستمر.",
          "النشاط الذي يقوم به الفرد لإشباع حاجة لديه.",
          "ضغط المعلم الخارجي فقط.",
          "الوراثة الجينية للمتعلم."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المصدر يذكر أن التعلم يحدث عبر النشاط، وهذا النشاط يرتبط ظهوره بوجود دافع أو حاجة تتطلب الإشباع، فالدوافع هي \"الطاقات الكامنة\" التي تحرك هذا النشاط.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778516205210"
      },
      {
        "type": "mcq",
        "text": "يتميز الشخص \"المنبسط\" في تكوين اتجاهاته بـ:",
        "score": 1,
        "options": [
          "مقاومة التغيير والتمسك بالقوالب القديمة.",
          "الانغلاق العقلي وتجنب التجارب الجديدة.",
          "منفتح العقلية ويتميز بالمرونة في التفكير.",
          "تبني اتجاهات والديه فقط بسبب الخوف."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "يربط المصدر بين سمات الشخصية والاتجاهات؛ فالشخص المنبسط يكون منفتحاً ومرناً في تبني الاتجاهات، بينما الشخص الانطوائي غالباً ما يقاوم التغيير.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778516295546"
      },
      {
        "type": "mcq",
        "text": "أي من مهارات القرن الحادي والعشرين تتطلب من الطلاب \"العمل بكفاءة في حالات الغموض وتغير الأولويات\"؟",
        "score": 1,
        "options": [
          "الثقافة المعلوماتية.",
          "المرونة والتكيف.",
          "الإنتاجية والمساءلة.",
          "التفكير الناقد."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "مهارة \"المرونة والتكيف\" تفرض على المتعلم أن يكون قادراً على التعامل مع الأدوار المختلفة والعمل بفاعلية في أزمنة التغيير والغموض.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778516367968"
      },
      {
        "type": "mcq",
        "text": "مهارات \"ثقافة تقنيات المعلومات والاتصال (ICT)\" تركز على قدرة الطالب على:",
        "score": 1,
        "options": [
          "استخدام التقنية كأداة للبحث والتنظيم والتقويم.",
          "فهم القضايا الأخلاقية المرتبطة بالوصول للمعلومات.",
          "تطبيق الفهم الجوهري للقوانين الرقمية.",
          "كل ما سبق صحيح."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "يشمل هذا النوع من الثقافة الرقمية استخدام التقنية كأداة بحثية وتنظيمية، مع ضرورة الالتزام بالقضايا الأخلاقية والقانونية المرتبطة بها.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778516487031"
      },
      {
        "type": "mcq",
        "text": "ما الذي يميز مهارات القرن الـ21 عن المهارات الأكاديمية التقليدية؟",
        "score": 1,
        "options": [
          "أنها تعتمد كلياً على حفظ المحتوى المعرفي.",
          "أنها لا تستند بشكل أساسي إلى المحتوى المعرفي بل إلى القدرات والسلوكيات.",
          "أنها تقتصر على المعلمين فقط دون الطلاب.",
          "أنها تهدف إلى تقليل التفاعل الاجتماعي."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يوضح المصدر أن هذه المهارات تختلف عن الأكاديمية التقليدية لأنها تركز على \"القدرات والسلوكيات الحياتية\" والتعلم المتعمق والمنطق التحليلي.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778516726965"
      },
      {
        "type": "mcq",
        "text": "تكمن أهمية \"برامج الإعداد التربوي\" (كليات التربية) في توظيف مهارات القرن الـ21 من خلال:",
        "score": 1,
        "options": [
          "توفير الأجهزة اللوحية للطلاب مجاناً.",
          "تشكيل معتقدات إيجابية لدى المعلمين نحو هذه المهارات وطرق تقويمها.",
          "التركيز على الجوانب الإدارية للمدرسة فقط.",
          "إلغاء دور المعلم واستبداله بالذكاء الاصطناعي."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تعد كليات التربية مؤسسات هامة في بناء شخصية المعلم، ويجب أن تعمل برامجها على تشكيل \"معتقدات إيجابية\" لضمان توظيف المهارات في الفصول بكفاءة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778516790077"
      },
      {
        "type": "mcq",
        "text": "التقويم التقليدي يقدم معلومات ذات قيمة عالية عن نتاجات التعلم التي أتقنها الطالب من خلال الأرقام التي يوفرها.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المصدر ذكر أن التقويم التقليدي يقيس مفاهيم بسيطة ويعبر عنها بأرقام لا تقدم معلومات ذات قيمة عن تعلم الطالب ولا تحدد بدقة النتاجات التي أتقنها.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517071930"
      },
      {
        "type": "mcq",
        "text": "يهدف التقويم التكويني (البنائي) إلى مراقبة تقدم التلميذ خطوة بخطوة وتصحيح مسار العملية التعليمية أثناء التدريس.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذا هو الجوهر الوظيفي للتقويم التكويني، حيث يزود المعلم والطالب بتغذية راجعة فورية تهدف لتحسين التعلم أثناء حدوثه.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517286529"
      },
      {
        "type": "mcq",
        "text": "تعد الاختبارات مرجعية المعيار هي الأنسب للكشف عن الفروق الفردية بين المفحوصين والمقارنة بينهم.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هدف الاختبارات مرجعية المعيار هو الكشف عن الفروق بين الأفراد ومقارنة أداء الفرد بمتوسط أداء مجموعته التي ينتمي إليها.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517337536"
      },
      {
        "type": "mcq",
        "text": "تعتبر الاختبارات الموضوعية سهلة الإعداد والتصميم ولكنها صعبة في التصحيح وتتأثر بذاتية المصحح.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "العكس هو الصحيح؛ الاختبارات الموضوعية تتميز بموضوعية التصحيح وسهولته، ولكن صعوبتها تكمن في تطلبها جهداً كبيراً في إعدادها.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517394128"
      },
      {
        "type": "mcq",
        "text": "صفة \"الرقمية\" في التقويم هي صفة أكثر شمولية من وصفه بـ \"المحوسب\" لأن الحاسب وعاء واحد فقط من أوعية التقدم الرقمي.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "التقويم الرقمي يشمل استخدام الحاسوب والإنترنت والشبكات الإلكترونية، فهو مفهوم أوسع يعكس إنجاز الطالب في مواقف متنوعة وغير تقليدية.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517434535"
      },
      {
        "type": "mcq",
        "text": "من أهداف بنوك الأسئلة الإلكترونية مساعدة المتعلم على التعلم الذاتي والتركيز على سرعته وإمكاناته الخاصة.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تهدف بنوك الأسئلة للاهتمام بنتائج التعلم لكل طالب على حدة وفق سرعته وليس مجرد الدرجة الكلية، مما يدعم التعلم الذاتي.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517520142"
      },
      {
        "type": "mcq",
        "text": "في بنوك الأسئلة الإلكترونية، تتميز خاصية \"السرية والأمان\" بتخزين الأسئلة في ملفات ورقية مؤمنة داخل خزائن حديدية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "السرية في البنوك المحوسبة تعتمد على قواعد بيانات مشفرة ورموز سرية وصلاحيات وصول إلكترونية محددة للأشخاص المخولين فقط.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517555895"
      },
      {
        "type": "mcq",
        "text": "يمكن للاختبارات المحوسبة أن تساهم في تقليل فرص الغش من خلال تغيير ترتيب الأسئلة والإجابات لكل طالب.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "من مميزات الاختبارات الإلكترونية إمكانية تعدد النماذج واختلاف ترتيب الأسئلة والبدائل، مما يقلل فرص الغش ويضمن العدالة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517622277"
      },
      {
        "type": "mcq",
        "text": "إتقان مهارات استخدام الحاسوب ليس له أي تأثير على الدرجة التي يحصل عليها المتعلم في الاختبارات المحوسبة.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "أشار المصدر إلى أن حاجة المتعلمين لمهارات الحاسوب والشبكات قد يكون لها تأثير على الدرجة التي سيحصل عليها المتعلم، وهذا يعد من جوانب القصور.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517707493"
      },
      {
        "type": "mcq",
        "text": "التقويم الذاتي يعني قيام المعلم بتقييم أداء الطالب بناءً على ملاحظاته الشخصية في الفصل.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التقويم الذاتي يعني تقويم الطالب لنفسه، أما ملاحظة المعلم للطالب فهي أداة أخرى تسمى تقويم الأداء القائم على الملاحظة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517738852"
      },
      {
        "type": "mcq",
        "text": "أي من الخيارات التالية يعبر عن المفهوم الاصطلاحي الدقيق لعملية التقويم التربوي؟",
        "score": 1,
        "options": [
          "إصلاح الشيء وتعديل اعوجاجه وإزالة العيوب منه.",
          "تقدير وزن الشيء والحكم على قيمته المادية فقط.",
          "عملية منظمة لجمع البيانات وتحليلها لتحديد درجة تحقيق الأهداف واتخاذ قرارات التحسين.",
          "مجرد رصد درجات الطلاب في سجلات خاصة في نهاية العام الدراسي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "يشير المصدر إلى أن التقويم اصطلاحاً يتجاوز المعنى اللغوي (الإصلاح) والتقدير البسيط، ليصبح عملية منهجية تهدف لربط البيانات بالأهداف التربوية لاتخاذ قرارات تطويرية.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517804460"
      },
      {
        "type": "mcq",
        "text": "ما هو الهدف الأساسي من إجراء التقويم \"التشخيصي\" في العملية التعليمية؟",
        "score": 1,
        "options": [
          "رصد درجات النجاح والرسوب وتصنيف الطلاب في تخصصات مختلفة.",
          "تقديم تغذية راجعة مستمرة للمعلم والطالب أثناء عملية التدريس.",
          "الكشف عن المكتسبات القبلية للمتعلم ومدى استعداده لتعلم معارف جديدة.",
          "الحكم النهائي على مدى فاعلية المناهج وطرق التدريس المستخدمة."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "التقويم التشخيصي يركز على بداية التعلم (قبل البدء) لتحديد نقطة الانطلاق واستثارة الدافعية، بينما الأهداف الأخرى تتعلق بالتقويم التكويني أو الختامي.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517861059"
      },
      {
        "type": "mcq",
        "text": "عندما يقوم المعلم بمقارنة أداء الطالب بمستوى خارجي محدد مسبقاً يسمى \"محك الكفاءة\" بغض النظر عن أداء زملائه، فإنه يستخدم:",
        "score": 1,
        "options": [
          "الاختبارات مرجعية المعيار.",
          "الاختبارات مرجعية المحك.",
          "الاختبارات المقننة العامة.",
          "اختبارات الاستعداد والذكاء."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المصادر تفرق بين مرجعية المعيار (مقارنة الطالب بالمجموعة) ومرجعية المحك (مقارنة الطالب بمستوى إتقان ثابت ومحدد مسبقاً).",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517927147"
      },
      {
        "type": "mcq",
        "text": "في \"الاختبار الموائم المحوسب (CAT)\"، ماذا يحدث إذا أجاب الطالب على سؤال ما بشكل غير صحيح؟",
        "score": 1,
        "options": [
          "ينتهي الاختبار فوراً ويتم رصد الدرجة بناءً على ما سبق.",
          "يقدم له الحاسوب سؤالاً آخر بنفس مستوى الصعوبة تماماً.",
          "يعيد الحاسوب تقييم قدرته ويقدم له سؤالاً يتناسب مع تقدير قدرة أقل.",
          "يتم خصم درجات مضاعفة من الطالب لعدم الإجابة الصحيحة."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "فكرة الاختبار الموائم تعتمد على خوارزميات تضبط صعوبة الأسئلة ديناميكياً؛ فالفشل في سؤال يؤدي لتقديم سؤال أسهل لتقدير مستوى القدرة الحقيقي بدقة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778517994130"
      },
      {
        "type": "mcq",
        "text": "متى يجب على المعلم (وفقاً لدوره في التقويم الرقمي) تقديم أسلوب تقويم التعلم وتحديد المحكات للطلاب؟",
        "score": 1,
        "options": [
          "في نهاية الفصل الدراسي قبل الامتحانات النهائية مباشرة.",
          "في مستهل المدة الدراسية (بداية العام أو الفصل).",
          "بعد ظهور نتائج الاختبارات الشهرية الأولى.",
          "فقط عندما يطلب الطلاب معرفة كيفية توزيع الدرجات."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يحدد المصدر أن من أدوار المعلم المبدع إعلان أساليب التقويم والمحكات وشروطها في البداية لضمان الوضوح والاتفاق مع الطلاب.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518083025"
      },
      {
        "type": "mcq",
        "text": "تتميز بنوك الأسئلة الإلكترونية بخاصية \"الاتساق\"، ويقصد بها:",
        "score": 1,
        "options": [
          "قدرة النظام على تشفير البيانات وحمايتها من التسرب.",
          "إمكانية المراجعة المستمرة وتطوير بنود الأسئلة وفق نظرية الاستجابة للمفردة.",
          "قدرة النظام على بناء اختبارات متكافئة بسهولة عبر تغيير معالم الفقرات.",
          "تنفيذ الاختبار لعدد كبير من المتعلمين في وقت واحد وبسرعة."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الاتساق يعني تماسك النظام وقدرته على إنتاج صور اختبارية متساوية في الصعوبة والمحتوى بطريقة آلية.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518219944"
      },
      {
        "type": "mcq",
        "text": "أي من المكونات التالية لا يعد جزءاً من المحتوى التقني لملف الإنجاز الإلكتروني (E-Portfolio) كما ورد في المصدر؟",
        "score": 1,
        "options": [
          "النصوص المكتوبة (Text).",
          "الصور الثابتة والمتحركة والرسوم.",
          "المواد السمعية (الصوت والمؤثرات).",
          "النسخ الورقية المجلدة للأبحاث والمقالات."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "المصدر يعرف ملف الإنجاز الإلكتروني بأنه \"نسخة إلكترونية\" تُنشأ في بيئة حاسوبية وتشمل الوسائط المتعددة، بينما النسخ الورقية تخص الملف التقليدي.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518288768"
      },
      {
        "type": "mcq",
        "text": "من أبرز عيوب أو تحديات الاختبارات المحوسبة التي ذكرها المصدر:",
        "score": 1,
        "options": [
          "انخفاض دقة رصد النتائج وتأخر التغذية الراجعة.",
          "صعوبة قياس مهارات مستويات التفكير العليا.",
          "زيادة فرص الغش بسبب توحيد نماذج الاختبارات.",
          "التكلفة المادية العالية جداً في طباعة الأوراق وتخزينها."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "أشار المصدر إلى أن تصميم هذه الاختبارات يتطلب مهارة عالية، وأحد جوانب القصور هو صعوبة قياس المستويات العليا من التفكير مقارنة بالمهارات البسيطة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518352039"
      },
      {
        "type": "mcq",
        "text": "ما هي الفائدة الرئيسية التي تعود على \"المعلم\" من عملية التقويم المبدئي (التشخيصي)؟",
        "score": 1,
        "options": [
          "تحديد نقطة البدء في عملية التعلم وتصميم الأنشطة الملائمة.",
          "رصد درجات الطلاب النهائية لإرسالها للإدارة.",
          "الحكم على كفاءة الوسائل التعليمية بعد استخدامها.",
          "تقليل الوقت المستغرق في تصحيح الاختبارات المقالية."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "التقويم المبدئي يساعد المعلم في الكشف عن الفروق الفردية والميول، مما يوجهه لاختيار الأنشطة التي تناسب مستوى استعداد الطلاب الفعلي.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518407607"
      },
      {
        "type": "mcq",
        "text": "يشير مصطلح \"التقويم القائم على الأداء\" إلى:",
        "score": 1,
        "options": [
          "قيام الطالب بحفظ المعلومات واسترجاعها في اختبار تحريري.",
          "تقييم الطالب لزملائه بناءً على معايير يضعها المعلم.",
          "توظيف الطالب لمهاراته في مواقف حياتية حقيقية أو محاكية لها.",
          "قدرة الطالب على التعامل مع برمجيات الحاسوب والإنترنت بكفاءة."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "يتميز هذا النوع من التقويم بأنه يركز على \"التطبيق\" وإظهار الإتقان من خلال عروض عملية أو مهام واقعية تظهر نتاجات التعلم.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518495406"
      },
      {
        "type": "mcq",
        "text": "التحول الرقمي في التعليم يعني مجرد استخدام التكنولوجيا مع الاحتفاظ بأساليب التلقين التقليدية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التحول الرقمي هو \"عملية التخلص من الأساليب التقليدية القديمة والقيود\"، والابتعاد عن أسلوب التلقين والاعتماد على الفهم والبحث والابتكار.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518668836"
      },
      {
        "type": "mcq",
        "text": "مهارات \"التفكير الناقد\" تتطلب من الطالب القدرة على اتخاذ الأحكام والقرارات واستنباط النتائج بفاعلية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تعتبر مهارات التفكير الناقد وحل المشكلات من أسس تعلم القرن الـ21، وتتطلب من الطلاب استخدام التفكير الكلي لحل المشكلات المعقدة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518707348"
      },
      {
        "type": "mcq",
        "text": "\"التوحد\" هو محاكاة الطفل لسلوك أفراد أسرته (مثل العطف على الحيوان) دون وجود رغبة في نيل الرضا أو الإعجاب.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المحاكاة البسيطة تسمى \"تقليداً\"، أما \"التوحد\" فهو تبني الاتجاه بسبب \"الإعجاب بالوالد، أو الخوف منه، أو الرغبة في الحصول على عطفه ورضاه\".",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518834443"
      },
      {
        "type": "mcq",
        "text": "المعلومات التي تقدمها مصادر \"ذات ثقة\" (مثل العلماء ورجال الدين) لها أثر فعال في تعديل اتجاهات الأفراد.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "يؤكد المصدر أن تزويد الأفراد بالمعلومات لتغيير اتجاهاتهم يتطلب الاعتماد على مصدر \"ذو ثقة\" لضمان تقبل المعلومات وتعديل القناعات.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518873898"
      },
      {
        "type": "mcq",
        "text": "الدوافع الشعورية هي التي لا تخضع لسيطرة وإرادة الفرد، وتكون من فعل العقل الباطن.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الدوافع الشعورية هي التي \"تخضع لسيطرة وتحكم وإرادة الفرد\"، بينما الدوافع اللاشعورية هي التي تكون من فعل العقل الباطن ولا يدركها الفرد.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778518921202"
      },
      {
        "type": "mcq",
        "text": "قوة الدفع نحو الهدف تزداد طردياً بزيادة قوة الدافع لدى المتعلم.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الوظيفة الثانية للدوافع توضح أن \"النشاط نحو الهدف يزداد بزيادة الدافع\"، مما يجعل الدوافع هي الأساس الأول في عملية التعلم.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778519027161"
      },
      {
        "type": "mcq",
        "text": "مهارة \"الثقافة الإعلامية\" تركز حصراً على تحليل البيانات الإحصائية وفهم الأرقام بدقة.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تحليل الإحصائيات والبيانات هو \"الثقافة المعلوماتية\"، أما الثقافة الإعلامية فتعني \"فهم الوسائل التي تنشر المعلومات\" وابتكار منتجات كالفيديو والمواقع.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778519064921"
      },
      {
        "type": "mcq",
        "text": "التعلم المنتج هو التعلم الغرضي الموجه نحو أهداف محددة، بينما مجرد التدريب بدون هدف يعد وسيلة غير منتجة.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "يؤكد المصدر أن الدراسة المنتجة تتطلب تحديد العمل بوضوح وربطه بأهداف محددة، لأن القراءة العشوائية لا تحقق تعديلاً حقيقياً في السلوك.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778519155304"
      },
      {
        "type": "mcq",
        "text": "عامل \"السن\" لا يؤثر في قدرة التلميذ على التعلم لأهداف بعيدة المدى.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يذكر المصدر أن القدرة على التعلم لأهداف بعيدة تتوقف على \"عامل السن\"؛ فالأطفال يتعلمون لأهداف قريبة، بينما الكبار يتعلمون لأهداف تتصل بمستقبلهم.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778519207007"
      },
      {
        "type": "mcq",
        "text": "\"المحفزات الرقمية\" تساهم في زيادة تحصيل الطلاب من خلال إضافة عنصري التشويق والمتعة إلى العملية التعليمية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تعمل المحفزات الرقمية على خلق شعور بالانغماس وزيادة الدافعية للإنجاز عبر نظام النقاط والشارات، مما ينعكس إيجاباً على التحصيل الدراسي.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778519242863"
      },
      {
        "type": "mcq",
        "text": "عندما يقوم المعلم بالبحث عن برمجيات جديدة ويقارن بينها ويستخدم قواعد البيانات لجلب صور وفيديو مناسبة للدرس، فهو يمارس دور",
        "score": 1,
        "options": [
          "التكنولوجي المتمكن",
          "المعلم كباحث ",
          "مصمم الخبرات التعليمية",
          "منسق التفاعل  "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "نص المحاضرة ذكر أن دور المعلم كباحث يشمل البحث الدائم عن البرمجيات والمقارنة بينها واستخدام المكتبات الإلكترونية لجلب الوسائط المناسبة.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521135654"
      },
      {
        "type": "mcq",
        "text": "المعلم الذي يحدد مواعيد تواجده على الشبكة وينظم التواصل بين الطلاب والمحتوى وبين الطلاب وبعضهم، يقوم بدور",
        "score": 1,
        "options": [
          "المرشد والميسر",
          "مقدم المحتوى",
          "منسق التفاعل",
          "المقوم الرقمي  "
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "دور منسق التفاعل هو تنظيم التواصل بين الطالب والمحتوى وبين الطلاب وأنفسهم، وتحديد مواعيد التواجد على الشبكة.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521209525"
      },
      {
        "type": "mcq",
        "text": "إعداد ملفات الإنجاز الإلكترونية `e-Portfolio` للطلاب وتقديم التغذية الراجعة يقع ضمن مهام المعلم كـ",
        "score": 1,
        "options": [
          "مصمم الخبرات التعليمية",
          " التكنولوجي المتمكن",
          "المقوم الرقمي",
          "مقدم المحتوى  "
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "من أدوار المقوم الرقمي يعد ملفات الإنجاز الإلكترونية للطلاب ويقدم التغذية الراجعة ويقيم أداء البرمجيات.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521301069"
      },
      {
        "type": "mcq",
        "text": "أي من الكفايات التالية تندرج تحت \"كفايات عامة\" للمعلم الرقمي",
        "score": 1,
        "options": [
          "استخدام محركات البحث ونقل الملفات",
          "تصميم واجهة المستخدم واختيار الألوان",
          "الثقافة الكمبيوترية وإدارة الملفات",
          "تتبع أداء الطلاب وإدارة النقاشات  "
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الكفايات العامة تشمل الثقافة الكمبيوترية، مهارات الاستخدام مثل إدارة الملفات، والثقافة المعلوماتية. أما باقي الاختيارات فهي كفايات شبكات أو إعداد مقررات أو إدارة.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521381972"
      },
      {
        "type": "mcq",
        "text": "مرحلة \"تحديد طرق تقديم المحتوى وتصميم واجهة المستخدم وإعداد السيناريو التعليمي\" تقع ضمن كفايات",
        "score": 1,
        "options": [
          "التخطيط للمقرر إلكترونياً",
          "التصميم والتطوير للمقرر إلكترونياً",
          "التقويم للمقرر إلكترونياً",
          "إدارة المقرر على الشبكة  "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "مرحلة التصميم والتطوير تشمل تحديد طرق تقديم المحتوى، وتصميم واجهة المستخدم، واختيار الألوان والروابط، وإعداد السيناريو التعليمي حسب المحاضرة.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521451547"
      },
      {
        "type": "mcq",
        "text": "من أدوار المعلم الرقمي أن يكون مصدر المعلومات الوحيد للطلاب",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تغير دور المعلم من كونه المصدر الوحيد للمعلومة إلى عدة أدوار تقنية وتوجيهية، ولم يعد المصدر الوحيد.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521498387"
      },
      {
        "type": "mcq",
        "text": "التكنولوجي المتمكن\" هو المعلم الذي يترجم المعلومات إلى وسائط متعددة ويحدد استراتيجيات التدريس",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هذا هو دور \"مقدم ومترجم للمحتوى\". أما التكنولوجي المتمكن فهو الذي يتقن لغات البرمجة والتعامل مع الكاميرات والماسحات وإدارة الخادمات",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521571970"
      },
      {
        "type": "mcq",
        "text": "القدرة على استخدام الإنترنت للبحث وتقييم مصادر المعلومات تندرج تحت \"الثقافة المعلوماتية",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "نص المحاضرة ذكر أن الثقافة المعلوماتية تشمل القدرة على استخدام الإنترنت للبحث، وتقييم مصادر المعلومات، وتصميم ونشر صفحات تعليمية",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521632842"
      },
      {
        "type": "mcq",
        "text": "من كفايات إدارة المقرر على الشبكة أن يقوم المعلم بتحليل المحتوى الرقمي وتحديد المتطلبات المادية",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تحليل المحتوى وتحديد المتطلبات المادية من \"كفايات التخطيط\" لإعداد المقررات. أما إدارة المقرر فتشمل تنظيم الوقت وتتبع أداء الطلاب وإدارة النقاشات.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521668465"
      },
      {
        "type": "mcq",
        "text": "دور \"المرشد والميسر\" يقتصر على الرد على استفسارات الطلاب فقط",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "دور المرشد والميسر أشمل، فهو يوجه الطلاب أثناء تعاملهم مع المحتوى، ويرد على استفساراتهم، ويتابع أداء كل طالب فردياً لتطوير نقاط قوته وعلاج ضعفه",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521748737"
      },
      {
        "type": "mcq",
        "text": "عندما يستخدم المعلم منصة `Padlet` لعمل تصويت فوري داخل الفصل لكسر حاجز الصمت، فهو يستخدم أدوات",
        "score": 1,
        "options": [
          "إنشاء المحتوى",
          "التفاعل والمشاركة ",
          "التعاون والتعلم الجماعي",
          "التقويم الإلكتروني  "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المحاضرة ذكرت أن أدوات التفاعل والمشاركة هدفها كسر حاجز الصمت وزيادة الحماس، وذكرت `Padlet` للتصويت الفوري كمثال عليها.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778521847944"
      },
      {
        "type": "mcq",
        "text": "موقع `PhET` الذي يقدم محاكاة لتجارب الفيزياء والكيمياء يساهم بشكل أساسي في تحقيق أهمية",
        "score": 1,
        "options": [
          "دعم التعلم الذاتي",
          "تسهيل التقويم",
          "تنوع المحتوى والتمثيل البصري",
          "الشمولية لذوي الاحتياجات الخاصة  "
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "المحاضرة نصت على أن تنوع المحتوى والتمثيل البصري يتم من خلال تبسيط المفاهيم المجردة باستخدام الفيديو والمحاكاة مثل موقع `PhET`.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778522137286"
      },
      {
        "type": "mcq",
        "text": "إذا أراد المعلم أن يعمل الطلاب معاً على مشروع واحد في مستند مشترك عبر الإنترنت، فهو يحتاج أدوات",
        "score": 1,
        "options": [
          "إنشاء المحتوى",
          "التفاعل والمشاركة",
          "التعاون والتعلم الجماعي",
          "محاضرات الفيديو الرقمية  "
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "أدوات التعاون والتعلم الجماعي تتيح للطلاب العمل معاً في مجموعات رقمية لتنفيذ المشاريع، مثل المستندات المشتركة.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778522998829"
      },
      {
        "type": "mcq",
        "text": "أي من أنواع محاضرات الفيديو الرقمية يظهر فيها المعلم في زاوية الشاشة أثناء شرح العرض التقديمي",
        "score": 1,
        "options": [
          "تصوير التدريس المباشر",
          "الاستوديو الافتراضي",
          "الفيديو التفاعلي",
          "صورة داخل صورة  "
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "نوع \"صورة داخل صورة\" هو الذي يظهر فيه المعلم في زاوية الشاشة أثناء العرض، حسب تصنيف أنواع محاضرات الفيديو.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778523151564"
      },
      {
        "type": "mcq",
        "text": "عند اختيار أداة رقمية للدرس، المعيار الذي يعني أن الأداة يجب أن تعمل على الهواتف والحواسيب هو",
        "score": 1,
        "options": [
          "الارتباط بالأهداف",
          "سهولة الاستخدام",
          "الملاءمة لطبيعة المحتوى",
          "إمكانية الوصول  "
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "معيار \"إمكانية الوصول\" يعني أن تعمل الأداة على مختلف الأجهزة كالهواتف والحواسيب، لضمان وصول كل الطلاب لها.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778523257899"
      },
      {
        "type": "mcq",
        "text": "من أهداف أدوات التعلم الرقمي تحويل المحتوى من مادة تقليدية صماء إلى محتوى تفاعلي",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "المحاضرة ذكرت نصاً أن من أهداف هذه الأدوات \"تحويل المحتوى من مادة تقليدية صماء إلى محتوى تفاعلي يعتمد على النصوص والصور والصوت والفيديو",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778523301307"
      },
      {
        "type": "mcq",
        "text": "منصة `Edpuzzle` هي مثال على \"الاستوديو الافتراضي\" لأنها تستخدم خلفيات الكروما",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "منصة `Edpuzzle` هي مثال على \"الفيديو التفاعلي\" لأنه فيديو مقسم لمقاطع يحتوي على أسئلة. أما الاستوديو الافتراضي فهو الذي يستخدم خلفيات رقمية `الكروما`.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778523344906"
      },
      {
        "type": "mcq",
        "text": "من مميزات محاضرات الفيديو الرقمية أنها تُلزم المتعلم بوقت محدد للمشاهدة",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "العكس صحيح. من مميزاتها \"التحكم في وقت المتعلم\" و \"سهولة الوصول في أي وقت وأي مكان\"، أي أنها تمنح المتعلم حرية اختيار الوقت.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778523383338"
      },
      {
        "type": "mcq",
        "text": "أدوات \"إنشاء المحتوى\" تستخدم لإعداد الاختبارات الرقمية والاستبيانات لقياس مستوى الطلاب",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "إعداد الاختبارات والاستبيانات من وظيفة \"أدوات التقويم الإلكتروني\". أما أدوات إنشاء المحتوى فهي لإعداد مواد جذابة مثل العروض التقديمية والإنفوجرافيك.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778523431321"
      },
      {
        "type": "mcq",
        "text": "تقنية \"تحويل النص إلى صوت\" `Immersive Reader` تساهم في تحقيق مبدأ الشمولية لدعم ذوي الاحتياجات الخاصة. ",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "المحاضرة ذكرت أن الشمولية تتحقق عبر دعم ذوي الاحتياجات الخاصة بتقنيات مثل \"تحويل النص إلى صوت\" وذكرت `Immersive Reader` كمثال.",
        "studentId": "students_1775855642761",
        "showExp": true,
        "id": "q_1778523475409"
      },
      {
        "type": "mcq",
        "text": "أي من المتطلبات التالية يركز على توفر (أجهزة حديثة، شبكات إنترنت، منصات إدارة تعلم، سبورات ذكية)؟",
        "score": 1,
        "options": [
          "الموارد البشرية.",
          "البنية التحتية التكنولوجية",
          "الثقافة الرقمية.",
          "القيادة الرقمية."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن البنية التحتية هي \"الأساس المادي\" والتقني الذي يقوم عليه أي تحول رقمي؛ فبدون الأجهزة (Hardware) والشبكات والمنصات (Software) لا يمكن تفعيل أي وسيلة تعليمية رقمية.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778523750503"
      },
      {
        "type": "mcq",
        "text": "نظام \"Coursera\" يُعد مثالاً بارزاً على \"التطبيقات الذكية\" لأنه يقوم بـ",
        "score": 1,
        "options": [
          "تحويل الورق إلى PDF فقط.",
          "تحليل بيانات المتعلمين وتقديم توصيات مخصصة ومراجعة أجزاء معينة",
          "توفير إنترنت سريع للطلاب.",
          "شراء أجهزة كمبيوتر للمؤسسة"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن ميزة \"الذكاء\" هنا تكمن في القدرة على (تحليل سلوك الطالب)، ومعرفة أين أخطأ، ومن ثم تقديم \"توصيات شخصية\" لكل طالب بشكل مستقل، وهذا هو جوهر التطبيق الذكي الذي يتجاوز مجرد عرض المحتوى.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778523859560"
      },
      {
        "type": "mcq",
        "text": "يمثل عنصر \"العمليات (Operating)\" في التحول الرقمي الذكي",
        "score": 1,
        "options": [
          "المادة الخام للنظام.",
          "حماية الأنظمة من الاختراق.",
          "نقص الميزانيات المرصودة.",
          "القلب النابض الذي يربط خطوات العملية التعليمية بشكل تخصصي وفعال"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "لأن \"العمليات\" هي المسؤولة عن دمج (المُدخلات) مثل المحتوى والمعلمين، مع (المُخرجات) مثل المهارات المكتسبة، وضمان تفاعلهم معاً بشكل مستمر ومنظم لتحقيق جودة الأداء.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778523958349"
      },
      {
        "type": "mcq",
        "text": "عدم اقتناع بعض القيادات بجدوى التحول الرقمي\" يندرج تحت بند",
        "score": 1,
        "options": [
          "متطلبات التحول.",
          "دواعي التطبيق.",
          "تحديات التحول الرقمي الذكي",
          "عناصر البيانات الكبيرة."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "لأن التحديات هي \"العقبات\" التي تعيق التنفيذ؛ وقناعة الإدارة هي عامل بشري أساسي، فإذا غابت القناعة أو الدعم المادي، توقف المشروع، لذا تُصنف كعائق أو \"تحدي\" بشري وإداري.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778524028884"
      },
      {
        "type": "mcq",
        "text": "المفهوم الذي يغطي كافة جوانب العملية التعليمية لإنشاء \"تطبيقات واستخدامات جديدة بالكامل\" هو",
        "score": 1,
        "options": [
          "الرقمنة.",
          "التحول الرقمي.",
          "التعليم التقليدي.",
          "التخزين السحابي."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "",
        "studentId": "students_1775379571542",
        "showExp": false,
        "id": "q_1778524105692"
      },
      {
        "type": "mcq",
        "text": "تقتصر عملية الرقمنة Digitizing على تحويل المعلومات من صيغتها التناظرية الورقية إلى صيغة رقمية فقط، دون تغيير في فلسفة التعليم.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأن الرقمنة هي مجرد \"إجراء تقني\" لتحويل شكل البيانات من ورق لملفات كمبيوتر، فهي لا تهدف لتطوير طرق التدريس أو تغيير نظام التعليم، بل تكتفي بحفظه رقمياً.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778524166756"
      },
      {
        "type": "mcq",
        "text": "التحول الرقمي الذكي هو مجرد توفير أجهزة كمبيوتر وإنترنت سريع داخل الفصول الدراسية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن الأجهزة والإنترنت يمثلان \"البنية التحتية\" فقط، بينما التحول الذكي يشترط \"دمج\" تقنيات متقدمة مثل الذكاء الاصطناعي وإنترنت الأشياء لتحقيق استجابة مرنة وتطوير شامل في الأداء.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778524232930"
      },
      {
        "type": "mcq",
        "text": "من دواعي التحول الرقمي في التعليم مواكبة الخبرات الرقمية للطلاب الذين يتعاملون يومياً مع تقنيات الويب والذكاء الاصطناعي.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأن الطالب الحالي \"مواطن رقمي\" يستخدم التكنولوجيا في حياته اليومية، فلو ظل التعليم تقليدياً ستحدث \"فجوة\" كبيرة؛ لذا وجب نقل التعليم لنفس المستوى التقني الذي يمارسه الطالب لضمان تفاعله.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778524292370"
      },
      {
        "type": "mcq",
        "text": "تعتبر البيانات الكبيرة Big Data هي المادة الخام التي تُستخدم لتدريب النماذج والأنظمة الذكية لاتخاذ قرارات دقيقة.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأن الأنظمة الذكية لا تفكر من تلقاء نفسها، بل تحتاج إلى \"تغذية\" بضخ كميات ضخمة ومتنوعة من البيانات لكي تستطيع تحليلها واستخراج أنماط تساعد في التنبؤ بمستوى الطلاب أو اتخاذ قرارات دقيقة.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778524335890"
      },
      {
        "type": "mcq",
        "text": "تحتاج المؤسسات التعليمية إلى سياسات وتشريعات لتنظيم استخدام التكنولوجيا وحماية الملكية الفكرية وقواعد التقويم الإلكتروني.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأن أي نظام رقمي بدون \"إطار قانوني\" سيكون معرضاً للمخاطر (مثل الغش الإلكتروني أو انتهاك الخصوصية)؛ فالتشريعات هي التي تضمن الحقوق والواجبات لكل أطراف العملية التعليمية.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778524372617"
      },
      {
        "type": "mcq",
        "text": "أي من الخصائص التالية لبنوك الأسئلة الإلكترونية تضمن القدرة على بناء اختبارات تهدف لقياس نطاق محدد أو موسع من قدرة الأفراد وفقاً لنظرية استجابة المفردة؟",
        "score": 1,
        "options": [
          "الاتساق.",
          "المرونة والديناميكية.",
          "السرية والأمان.",
          "السهولة والسرعة."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يشير المصدر إلى أن المرونة في بنوك الأسئلة تسمح بالمراجعة المستمرة وتطوير البنود بناءً على نظرية استجابة المفردة، مما يمكن من تكوين اختبارات تقيس نطاقات محددة من القدرة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778524560208"
      },
      {
        "type": "mcq",
        "text": "ما هي الوظيفة الأساسية التي يؤديها \"الحاسوب\" في إدارة الاختبارات المحوسبة كما ورد في المصدر؟",
        "score": 1,
        "options": [
          "قصر دوره على عرض الأسئلة للطلاب فقط.",
          "استبدال دور المعلم في وضع الأهداف التربوية.",
          "بناء الاختبار وتخزينه وتطبيقه وتصحيحه وتحليله وإصدار تقارير النتائج.",
          "منع الطلاب من استخدام أي مصادر خارجية أثناء الاختبار عبر قفل المتصفح فقط."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "يلخص المصدر دور الحاسوب في كونه نظاماً متكاملاً يدير كافة مراحل العملية الاختبارية من البداية حتى الحصول على تقرير شامل للنتائج.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778524618663"
      },
      {
        "type": "mcq",
        "text": "يُعرف \"تقويم الأقران\" في بيئة التعلم الرقمي بأنه:",
        "score": 1,
        "options": [
          "قيام المعلم بمقارنة أداء الطالب بأداء زملائه في الفصل.",
          "قيام الطالب بتقييم أعمال زملائه (أقرانه).",
          "قيام الطالب بتقييم أدائه الشخصي بناءً على محكات محددة.",
          "عملية مراقبة المعلم للمتعلم في موقف تعليمي نشط."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المصادر تصنف تقويم الأقران كأحد أساليب التقويم حيث يشارك الطلاب في عملية التقييم لبعضهم البعض، مما يعزز التعلم التشاركي.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778524700574"
      },
      {
        "type": "mcq",
        "text": "أي مما يلي يمثل أحد الأهداف \"الخاصة\" لإنشاء بنوك الأسئلة الإلكترونية؟",
        "score": 1,
        "options": [
          "تطوير أدوات التقويم كعملية عامة لتطوير المنظومة التعليمية.",
          "إلغاء الحاجة تماماً لوجود المعلم في عملية وضع الأسئلة.",
          "مقارنة نتائج أداء المتعلمين في سنة ما بنتائج الذين سبقوهم لتحديد أسباب تغير مستويات النجاح والرسوب.",
          "زيادة صعوبة الاختبارات لضمان تميز الطلاب المتفوقين فقط."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "تهدف بنوك الأسئلة إلى توفير بيانات دقيقة تسمح بمقارنة النتائج عبر السنوات لتحديد ما إذا كان التغير في النتائج يعود لمستوى الطلاب أم لصعوبة الأسئلة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778524797278"
      },
      {
        "type": "mcq",
        "text": "يتميز التقويم الرقمي عن التقويم المحوسب بكونه:",
        "score": 1,
        "options": [
          "يستخدم الحاسب الآلي فقط كأداة وحيدة للتقييم.",
          "يقتصر على الامتحانات النهائية التي تجرى في نهاية العام.",
          "أكثر شمولية، حيث يعكس إنجاز الطالب في مواقف متنوعة وغير تقليدية باستخدام الشبكات والإنترنت.",
          "أقل دقة بسبب اعتماده على التواصل عن بعد."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "يوضح المصدر أن صفة \"الرقمية\" أشمل من \"المحوسب\" لأنها تستخدم كافة أدوات التقنية والشبكات لقياس إنجازات الطالب في مواقف ذات قيمة ومعنى.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778524851501"
      },
      {
        "type": "mcq",
        "text": "يساعد التقويم التكويني المعلم في وضع خطة للتعليم العلاجي لتخليص التلميذ من نقاط الضعف فور اكتشافها.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "من أهداف التقويم التكويني تزويد المعلم ببيانات لتشخيص عدم فاعلية التدريس ووضع خطط علاجية لتصحيح مسار التعلم.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778524937412"
      },
      {
        "type": "mcq",
        "text": "تعتبر الاختبارات المقالية هي النوع الأكثر موضوعية في التصحيح، حيث لا تتأثر الدرجة بذاتية المصحح.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المصدر يذكر أن الاختبارات المقالية تعاني من تشبع الدرجة بـ \"ذاتية المصحح\" وصعوبة التصحيح، بينما الاختبارات الموضوعية هي التي تتميز بموضوعية التصحيح.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778524975948"
      },
      {
        "type": "mcq",
        "text": "يتوقف الاختبار الموائم المحوسب (CAT) عن تقديم أسئلة جديدة عندما تصل دقة تقدير قدرة الطالب إلى مستوى مقبول إحصائياً.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "نظام CAT يعيد تقييم القدرة باستمرار ويتوقف عند تحقيق مستوى مقبول من الدقة الإحصائية أو الوصول للحد الأقصى للأسئلة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778525007915"
      },
      {
        "type": "mcq",
        "text": "يقتصر محتوى ملف الإنجاز الإلكتروني (E-Portfolio) على النصوص المكتوبة والرسوم فقط.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يشمل ملف الإنجاز الإلكتروني محتويات متنوعة مثل النصوص، الصوت بما فيه الكلام والمؤثرات، الصور الثابتة والمتحركة، والرسوم المتحركة.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778525043428"
      },
      {
        "type": "mcq",
        "text": "من الخصائص الفنية لبنوك الأسئلة الإلكترونية \"الاتساق\"، والذي يعني بناء اختبارات متكافئة عن طريق تغيير معالم الفقرات.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الاتساق يضمن تماسك النظام وقدرته على إنتاج اختبارات متساوية في القوة والخصائص بطريقة سهلة وآلية.",
        "studentId": "students_1775821794374",
        "showExp": true,
        "id": "q_1778525085523"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "full_report",
    "adminEmails": "mahmoud21abdalrhman@gmail.com,salmazahran167@gmail.com",
    "startTime": "2026-05-12T21:30",
    "endTime": "2026-05-12T23:00",
    "latePolicy": "hard_stop",
    "allowBackNavigation": true,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791",
    "webhookUrl": "https://script.google.com/macros/s/AKfycbz5kVEvhRdLB0_6qtwxhqMOvmZqn03EvEbhvg96eWaNUFlqoAFwBfTVyG5iljGi9tokNg/exec",
    "sendDetailedReport": false,
    "examCode": "LUM-MP1SKZ8V4W21W",
    "sheetName": "Sheet1",
    "entryGate": {
      "name": true,
      "department": true,
      "email": true
    }
  }
];