window.LUMINOVA_EXAMS = [
  {
    "id": "quizzes_1777072470808",
    "timestamp": "2026-04-24T23:14:30.808Z",
    "titleAr": "اختبار على الفصل الاول ",
    "titleEn": "Quiz on the first semester",
    "isShuffled": false,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "s_founder_hardcoded",
    "questions": [],
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1775849685012",
    "timestamp": "2026-04-10T19:34:45.012Z",
    "titleAr": "امتحان الميد تيرم",
    "titleEn": "Mid-term exam",
    "isShuffled": false,
    "feedbackMode": "immediate",
    "subjectId": "subjects_1775849639042",
    "publisherId": "s_founder_hardcoded",
    "questions": [
      {
        "type": "mcq",
        "text": "تهدف المواطنة الرقمية إلى استخدام التكنولوجيا بدون قيود أو ضوابط.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تساعد على استخدام التكنولوجيا بشكل واعٍ ومسؤول ، والتنقل في بيئة الإنترنت بمسؤولية وأمان ، وليس بدون قيود.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775849896577"
      },
      {
        "type": "mcq",
        "text": "من أبعاد المواطنة الرقمية: الأمان الرقمي، والسلوك الأخلاقي، والمشاركة الرقمية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تشمل أبعاد المواطنة الرقمية \"الأمن الرقمي\" ، و\"اللياقة الرقمية\" التي تمثل السلوك اللائق والاحترام للآخرين (السلوك الأخلاقي) ، و\"النفاذ الرقمي\" والاتصال الذي يمثل المشاركة.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775849976623"
      },
      {
        "type": "mcq",
        "text": "المواطنة الرقمية لا تتعلق بالهوية الثقافية أو القيم المجتمعية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية ترتبط ارتباطاً وثيقاً بالقيم المجتمعية، فهي تهدف إلى تحقيق الفائدة للمجتمع ، وتقوم على مبادئ مثل احترام الآخرين واللياقة.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850013793"
      },
      {
        "type": "mcq",
        "text": "استخدام التكنولوجيا لأغراض إيجابية يعكس سلوك المواطن الرقمي.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تساعد الفرد على استخدام التكنولوجيا بما يحقق الفائدة للفرد والمجتمع.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850064055"
      },
      {
        "type": "mcq",
        "text": "المواطنة الرقمية تقتصر على البالغين فقط.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تشمل جميع الأعمار، والدليل على ذلك وجود دور للمعلم في تعزيز المواطنة عند الطلاب.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850107876"
      },
      {
        "type": "mcq",
        "text": "من حقوق المواطن الرقمي: حماية بياناته والتفاعل بحرية وأمان.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "من الحقوق والمسؤوليات الرقمية حماية الخصوصية الشخصية ، ومن الأمن الرقمي حماية البيانات ، مع ضرورة التنقل في الإنترنت بمسؤولية وأمان.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850150942"
      },
      {
        "type": "mcq",
        "text": "تكنولوجيا المعلومات لم تؤثر على مفهوم المواطنة.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لقد أثرت التكنولوجيا بشكل كبير، مما أدى إلى ظهور مصطلح جديد وهو \"المواطن الرقمي\" بجانب المواطنة التقليدية",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850195755"
      },
      {
        "type": "mcq",
        "text": "البعد القانوني من أبعاد المواطنة الرقمية يشمل المساواة أمام القانون والحقوق المدنية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تُعتبر العبارة صواباً لأن المواطنة الرقمية هي امتداد وتطبيق للمواطنة التقليدية في البيئة الافتراضية؛ فالبعد القانوني الذي يضمن المساواة والتمتع بالحقوق المدنية ينتقل مع الفرد إلى العالم الرقمي لضمان حماية حقوقه وتنظيم مسؤولياته القانونية تحت مظلة الدولة، مما يعزز قيم العدالة الاجتماعية رقمياً.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850247950"
      },
      {
        "type": "mcq",
        "text": "لا تتطلب المواطنة الرقمية أي وعي سياسي أو اجتماعي.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تتطلب وعياً اجتماعياً، حيث تشمل \"اللياقة الرقمية\" التواصل باحترام وأدب في المحادثات عبر الإنترنت ، وتتطلب التفاعل بطريقة حساسة وأخلاقية.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850291729"
      },
      {
        "type": "mcq",
        "text": "تهدف المواطنة الرقمية إلى إعداد جيل قادر على التفاعل الواعي في البيئة الرقمية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "مفهوم المواطنة الرقمية يتضمن قدرة الفرد على التفاعل مع المستخدمين والمحتوى الرقمي بطريقة نشطة ونقدية وأخلاقية وواعية.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850330203"
      }
    ],
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1777298325651",
    "timestamp": "2026-04-27T13:58:45.651Z",
    "titleAr": "امتحان سريع علي الفصل الاول",
    "titleEn": "quick quiz on chapter one",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "تعريف الاستوديو الإذاعي هو مكان مخصص ومجهز هندسياً وتقنياً لإنتاج المواد الإذاعية فقط ؟\n",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "",
        "studentId": "students_1775379443604",
        "showExp": false,
        "id": "q_1777298401018"
      },
      {
        "type": "mcq",
        "text": "يتم تجهيز الاستوديو من خلال ثلاثه طرق (العزل الصوتي, المعالجه الصوتيه, التحسين الصوتي)\n",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "عشان هما طريقتين بس العزل والمعالجه",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298452909"
      },
      {
        "type": "mcq",
        "text": "ما هو الافضل ؟ استخدام البناء المزدوج ام الثلاثي ام الفردي مع مواد عازله قويه للاستوديو\n",
        "score": 1,
        "options": [
          "بناء فردي",
          "بناء ثلاثي",
          "بناء مزدوج"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "لا يوجد حاجه تسمي بناء فردي او ثلاثي",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298549761"
      },
      {
        "type": "mcq",
        "text": "العزل الصوتي هو ان تتحكم في سلوك الصوت داخل الاستوديو ",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "العزل الصوتي هو منع تسرب أي ضوضاء من الخارج إلى داخل الاستوديو",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298620529"
      },
      {
        "type": "mcq",
        "text": "أي نوع من المواد يُفضل استخدامه في تبطين جدران استوديو الموسيقى والغناء؟",
        "score": 1,
        "options": [
          "مواد شديدة الامتصاص",
          "مواد عاكسة للصوت ",
          "مواد عازلة للاهتزازات",
          "مواد متوسطة الامتصاص."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "عشان المواد العاكسه بتزيد زمن الرنين فيزداد فخامه الصوت",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298699153"
      },
      {
        "type": "mcq",
        "text": "ي عمليه تنفيذ العزل الصوتي يتم استخدام:\nالأبواب :استخدام نظام \"الباب المزدوج\" بمواد ثقيلة وعازلة.\nالتكييف :الاستوديو يكون خالياً من النوافذ تماما،ً ويُستبدل بتكييف عادي\nسد الثغرات :يتم تغطية فتحة المفتاح في الباب بكتلة متحركة من \"الكاوتش \"لمنع أي تسرب للصوت من الفتحات الصغيرة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المفروض يتم تركييب تكييف مركزي صامت",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298773152"
      },
      {
        "type": "mcq",
        "text": "طاولة مراقبة الصوت (الميكسر) مسؤولة فقط عن تجميع مصادر الصوت المختلفة ولا يمكنها التحكم في مستوى قوة الصوت",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "إلى جانب التجميع، يُعد الميكسر الأداة الأساسية للتحكم في 'علو ووطي' الصوت وعمل الدمج (الميكس).",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298830817"
      },
      {
        "type": "mcq",
        "text": "سماعة التخاطب يستخدمها المذيع عشان يسمع تعليمات المخرج \"وهو على الهواء\"",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تعمل سماعة التخاطب فقط عندما المخرج بيكلم المذيع وهو جوه الاستوديو تكون الميكروفونات مغلقة للحديث قبل أو بعد الهواء.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298976995"
      },
      {
        "type": "mcq",
        "text": "أي تقنية من تقنيات الانتقالات الصوتية تعتمد على تلاشي صوت تدريجياً بالتزامن مع ظهور صوت آخر تدريجياً لعمل انتقال ناعم؟",
        "score": 1,
        "options": [
          "Cutting (القطع)",
          "Fade In/Out (الخفوت والظهور)",
          "Blendind (الدمج)",
          "Sigue (السيجواي)"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "تسمح هذه التقنية بنعومة الانتقال وتجنب الفجوات الصامتة عن طريق التداخل التدريجي للصوتين.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777299061255"
      },
      {
        "type": "mcq",
        "text": "ما هي الوظيفة الأساسية لرأس التسجيل في أجهزة شرائط التسجيل؟",
        "score": 1,
        "options": [
          "نسخ الأجزاء المطلوبة إلى شريط جديد.",
          "قراءة الشريط وتحويله لصوت مسموع.",
          "تحويل التيار الكهربائي إلى نبضات مغناطيسية على الشريط.",
          "مسح أي مادة مسجلة سابقاً لتجهيز الشريط."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "تقوم هذه الرأس بطباعة الذبذبات الصوتية القادمة كتيار كهربائي إلى نبضات تُحفظ على الشريط المغناطيسي.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777299140444"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "",
    "startTime": "",
    "endTime": "",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1777408169446",
    "timestamp": "2026-04-28T20:29:29.446Z",
    "titleAr": "اختبار سريع اخر علي الفصل الاول ",
    "titleEn": "Another quick quiz on the first semester",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "في استوديو الدراما، أي الأجزاء الآتية يُستخدم لإعطاء المستمع إيحاءً بأن المشهد التمثيلي يدور داخل غرفه أو مكتب؟",
        "score": 1,
        "options": [
          "الاستوديو المتوسط",
          "الاستوديو الميت",
          "الاستوديو الحي",
          "الاستوديو الاحاديث"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لانه يعطي صدي صوت يتناسب مع طبيعه الانعكسات داخل الغرفه او المكتب",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777408422637"
      },
      {
        "type": "mcq",
        "text": "ما هو نوع الانعكاس الصوتي والمواصفات التي يحتاجها 'استوديو الأحاديث' المخصص للمناقشات؟\n\n\nA.\nصدى صوت مرتفع ليغطي على ضوضاء الخلفية.\n\n\nB.\nصدى صوت منعدم تماماً لمنع تداخل أصوات الضيوف.\n\n\nC.\nانعكاسات عالية جداً لإعطاء حيوية للصوت.\n\n\nD.\nيشبه مواصفات استوديو الربط حيث يحتاج لزمن رنين منخفض لوضوح الكلام.\n\nThat's right!\nاستوديو الأحاديث يتطلب وضوحاً عالياً للحوارات، لذا فهو يشبه استوديو الربط في مواصفاته الفنية.",
        "score": 1,
        "options": [
          "صدى صوت منعدم تماماً لمنع تداخل أصوات الضيوف.",
          "صدي صوت متوسط جداً لإعطاء حيوية للصوت",
          "يشبه مواصفات استوديو الربط حيث يحتاج لمواد ماصه اكثر.",
          "صدى صوت مرتفع ليغطي على ضوضاء الخلفية"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "استوديو الأحاديث يتطلب وضوحاً عالياً للحوارات، لذا فهو يشبه استوديو الربط في المواد الماصه الكثيره= زمن رنين اقل.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409517274"
      },
      {
        "type": "mcq",
        "text": "بما أن الميكروفون يحول ذبذبات الصوت إلى تيار كهربائي 'ضعيف'، فما هو الجهاز المستخدم في الاستوديو لتقوية هذه الإشارة ودفعها عبر الكابل إلى غرفة المراقبة؟",
        "score": 1,
        "options": [
          "طاولة مراقبة الصوت (الميكسر)",
          "رأس التسجيل",
          "جهاز المكبر",
          "جهاز Uher الألماني"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "وظيفة المكبر الأساسية هي أخذ الإشارة الكهربائية الضعيفة جداً من الميكروفون وتقويتها لضمان وصولها سليمة لغرفة المراقبة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409619473"
      },
      {
        "type": "mcq",
        "text": "ما هي اتجاهية 'الميكروفون الديناميكي' وما مدى مناسبته للعمل داخل الاستوديو المغلق؟\n",
        "score": 1,
        "options": [
          "قلبي الشكل، ويستخدم فقط في استوديو الموسيقى.",
          "غير اتجاهي (يلتقط من جميع الاتجاهات)، ولا يُفضل داخل الاستوديو إلا باقتراب المذيع منه جداً.",
          "ثنائي الاتجاه (من الأمام والخلف) ومثالي للدراما في الاستوديو.",
          "اتجاهي (يلتقط من اتجاه واحد) وهو الأفضل للاستوديو."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأنه يلتقط الصوت من كل مكان، فإنه قد يلتقط ضوضاء الاستوديو أو صدى الجدران، لذا يقتصر استخدامه بالداخل على حالات التحدث عن قُرب شديد (6-8 بوصة).",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409739718"
      },
      {
        "type": "mcq",
        "text": "أي الميكروفونات التالية يُعد ممتازاً داخل الاستوديو لدرجة أن المخرجين يفضلونه في الموسيقى والدراما لكونه يلغي أصوات الجوانب (ثنائي الاتجاه)؟\n",
        "score": 1,
        "options": [
          "الميكروفون اللاسلكي",
          "الميكروفون القلبي",
          "الميكروفون الديناميكي",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "يلتقط من الأمام والخلف فقط مما يمنع تشويش الجوانب، ويعطي جودة عالية تناسب الدراما والموسيقى في الاستوديو.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409821468"
      },
      {
        "type": "mcq",
        "text": "لتحقيق 'توازن الميكروفون' في حال وجود عدة أشخاص يتحدثون أمام (ميكروفون واحد)، ما هو الإجراء الصحيح الذي يجب اتخاذه؟\n",
        "score": 1,
        "options": [
          "رفع مستوى الصوت للجميع بشكل متساوٍ عبر طاولة المراقبة.",
          "تغيير وضع الميكروفون ليكون غير اتجاهي.",
          "أن يبتعد أو يقترب كل شخص حسب 'قوة صوته الأصلي'.",
          "استخدام سماعة تخاطب لكل متحدث."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا هو الحل العملي لضبط التوازن؛ صاحب الصوت القوي يبتعد قليلاً، وصاحب الصوت الضعيف يقترب ليتساوى خروج الأصوات.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409901285"
      },
      {
        "type": "mcq",
        "text": "بخصوص الأدوات الإذاعية، لماذا تُعتبر 'الساعة' من أهم الأشياء داخل الاستوديو؟",
        "score": 1,
        "options": [
          "لضبط المواعيد بالثانية ومعرفة مدة البرنامج بالضبط.",
          "لحساب زمن رنين الصوت بدقة هندسية.",
          "لتحويل الميكروفونات للعمل آلياً.",
          "لمعرفة وضبط سرعات شرائط التسجيل."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الإذاعة تعتمد على الخريطة الزمنية بالثانية لتنظيم الفواصل والبرامج بدقة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410015345"
      },
      {
        "type": "mcq",
        "text": "ما هي الأداة التي يعتمد عليها المذيع بالأساس لتلقي التوجيهات من المخرج 'وهو على الهواء مباشرة' دون أن يتأثر البث؟\n",
        "score": 1,
        "options": [
          "سماعة التخاطب",
          "سماعة الرأس",
          "السماعات الخارجية",
          "الايربودز"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "ارتداء المذيع لسماعة الرأس يضمن وصول صوت المخرج لأذن المذيع فقط أثناء عمل الميكروفونات.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410142304"
      },
      {
        "type": "mcq",
        "text": "ما هي الوظيفة الأساسية لـ 'الأسطوانات' في غرفة المراقبة، وبماذا تتميز أنواعها؟\n\n\nA.\nتُستخدم كأداة لحفظ أرشيف البرامج المكتوبة وتختلف أحجامها.\n\nNot quite\nالأسطوانات وسائط صوتية وليست للملفات المكتوبة.\n\n\nB.\nتُستخدم لعمل مونتاج النسخ (Dubb Editing) بين جهازين.\n\n\nC.\nتُستخدم لتشغيل المواد الموسيقية والمؤثرات الصوتية، وتختلف أنواعها حسب عدد اللفات في الدقيقة (RPM).\n\nRight answer\nهذه هي الوظيفة التقليدية للأسطوانات الإذاعية، وتتنوع أجهزتها لتدعم سرعات 16، 33.3، 45، و 78 لفة.\n\n\nD.\nتُستخدم لتسجيل صوت المذيع مباشرة، وتختلف سرعاتها بين 19 و 27.",
        "score": 1,
        "options": [
          "تُستخدم لتسجيل الشرائط، وتختلف سرعاتها بين 19 و 27 لفه",
          "تُستخدم لعمل مونتاج النسخ (Dubb Editing) بين جهازين",
          "تُستخدم لتشغيل المواد الموسيقية والمؤثرات الصوتية، وتختلف أنواعها حسب عدد اللفات في الدقيقة",
          "تُستخدم كأداة لحفظ أرشيف البرامج المكتوبة وتختلف أحجامها."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "تشغيل المواد الاذاعيه هي الوظيفة التقليدية للأسطوانات الإذاعية، وتتنوع أجهزتها لتدعم سرعات 16، 33.3، 45، و 78 لفة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410322832"
      },
      {
        "type": "mcq",
        "text": "يُعرف استوديو الربط باسم آخر، ويتميز بمواصفات هندسية معينة لضمان وضوح الكلمات، فما هي؟\n",
        "score": 1,
        "options": [
          "الاستوديو الميت، ومساحته صغيرة وزمن رنين مرتفع.",
          "الاستوديو الحي، ومساحته متوسطة وزمن رنين منعدم.",
          "الاستوديو التنفيذي، ومساحته صغيرة وزمن رنين منخفض",
          "استوديو المونتاج، ومساحته كبيرة وزمن رنين عالي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا هو الاسم الثاني لاستوديو الربط، ومساحته وزمن رنينه المنخفض يضمنان وضوح صوت المذيع التام.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410472319"
      },
      {
        "type": "mcq",
        "text": "أي جزء من أجزاء استوديو الدراما يُستخدم لإعطاء إيحاء صوتي بتمثيل مشهد داخل قبو؟\n",
        "score": 1,
        "options": [
          "الاستوديو المتوسط",
          "الاستوديو الميت",
          "الاستوديو الحي",
          "استوديو الأحاديث"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الاستوديو الحي يتميز بصدى صوت مرتفع، مما يجعله مثالياً لتمثيل الأماكن المغلقة التي يتردد فيها الصوت مثل الأقبية والجبال.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410649550"
      },
      {
        "type": "mcq",
        "text": "تعتبر 'غرفة المراقبة' المركز الرئيسي لإدارة العملية الإذاعية، فأي من التالي يُعد من مهامها الأساسية؟",
        "score": 1,
        "options": [
          "عمليات الحذف والإضافة ونسخ الشرائط حصراً.",
          "تسجيل الأصوات الخارجية في الشارع.",
          "عزل الضوضاء عن استوديو الربط فقط.",
          "تجميع مصادر الصوت وخلطها (مزج الكلام مع الموسيقى والمؤثرات)."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "تقوم غرفة المراقبة باستقبال الإشارات من الميكروفونات والأجهزة الأخرى ومزجها معاً وفقاً للسيناريو عبر طاولة الصوت.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410734318"
      },
      {
        "type": "mcq",
        "text": "أي الميكروفونات التالية يُعتبر 'غير اتجاهي' (يلقط من كل حتة)، ولذلك لا يُفضل استخدامه داخل الاستوديو إلا إذا اقترب منه المذيع جداً؟",
        "score": 1,
        "options": [
          "الميكروفون الديناميكي",
          "الميكروفون القلبي",
          "الميكروفون المهجن",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الميكروفون الديناميكي يلتقط الصوت من جميع الاتجاهات، مما يجعله عرضة لالتقاط صدى الاستوديو، لذا لا يُنصح به بالداخل إلا عند التحدث عن قرب شديد.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410828800"
      },
      {
        "type": "mcq",
        "text": "ما هو الميكروفون الأمثل للاستخدام عند تسجيل أغنية أو برنامج به جمهور، حيث يركز على صوت المؤدي ويمنع صوت الآلات أو الجمهور المحيط؟",
        "score": 1,
        "options": [
          "الميكروفون الديناميكي",
          "الميكروفون القلبي",
          "الميكروفون اللاسلكي",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يلتقط الميكروفون القلبي الصوت من اتجاه واحد فقط (الأمام)، مما يوفر عزلاً ممتازاً لصوت المغني عن الضوضاء المحيطة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410894029"
      },
      {
        "type": "mcq",
        "text": "الميكروفون الديناميكي هو الأفضل في الإذاعة الخارجية والمقابلات في الشارع لكونه قوياً ويتحمل ساعات العمل الطويلة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "بالفعل، الميكروفون الديناميكي يتحمل ظروف العمل الشاقة ورخيص الثمن، مما يجعله مثالياً للشارع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410978341"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "",
    "startTime": "",
    "endTime": "",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  }
];