window.LUMINOVA_EXAMS = [
  {
    "id": "quizzes_1778324229730",
    "timestamp": "2026-05-09T10:57:09.730Z",
    "titleAr": "اختبار مادة معلومات مصورة 🏆",
    "titleEn": "Illustrated Information Material Test 🏆",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1777896562125",
    "publisherId": "s_founder_hardcoded",
    "questions": [
      {
        "type": "mcq",
        "text": "في إنفوجرافيك يشرح \"أعطال محرك السيارة\"، يُعد استخدام صورة فوتوغرافية حقيقية مليئة بالتفاصيل أفضل من الرسم التخطيطي البسيط لضمان معيار الوضوح.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الوضوح يتطلب استبعاد التفاصيل غير الملائمة التي تشتت الانتباه؛ فالصور الحقيقية المزدحمة تشتت المتعلم، بينما الرسم التخطيطي يركز على الفكرة الجوهرية فقط.\n",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325521600"
      },
      {
        "type": "mcq",
        "text": "يُعتبر استخدام اللون \"الأزرق المخضر\" في خلفية التصميم مع كتابة نص باللون \"الأزرق\" تطبيقاً ناجحاً لمعيار التباين.",
        "score": 0,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "اللون \"الأزرق المخضر\" هو لون هجين مشتق من الأزرق، واللونان متقاربان جداً في دائرة الألوان، مما يؤدي لضعف التباين وصعوبة القراءة.",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325573471"
      },
      {
        "type": "mcq",
        "text": "معيار \"التنظيم أو الترتيب\" هو المسؤول الأول عن تحويل مجموعة من البيانات المبعثرة إلى \"قصة بصريّة\" تتبعها العين.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأنه يعتمد على ترتيب العناصر بطريقة منطقية تساعد على تتبع الفكرة باستخدام الأسهم والأشكال الهندسية، مما يخلق مساراً بصرياً واضحاً.",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325677613"
      },
      {
        "type": "mcq",
        "text": "إذا تساوت مساحة الرسم مع مساحة النص في اللوحة، نكون قد حققنا الحد الأدنى المطلوب لمعيار الوضوح.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "معيار الوضوح يشترط ألا يقل الرسم عن 1/4 مساحة اللوحة؛ فإذا تساوى مع النص (أي أخذ 1/2 المساحة)، فهو بالتأكيد حقق وتجاوز الحد الأدنى المطلوب.",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325744300"
      },
      {
        "type": "mcq",
        "text": "معيار \"التناسب\" في الألوان يهدف فقط إلى جعل اللوحة جميلة، وليس له علاقة بتأكيد الأفكار الأساسية.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التناسب يهدف لانسجام الألوان لتأكيد الأفكار الأساسية المعروضة وإبرازها للمشاهد، وليس لمجرد التزيين الجمالي",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325901455"
      },
      {
        "type": "mcq",
        "text": "تصميم إنفوجرافيك عن \"تاريخ تطور الحواسيب\" يتطلب دمج نوعين من المعلومات المصورة، هما:",
        "score": 1,
        "options": [
          "التشريحية والإحصائية",
          "الزمنية والعملية",
          "الهرمية والتشريحية"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الزمنية لعرض التطور \nعبر السنين، والعملية (المخططات) لشرح كيفية عمل الجهاز وتطوره إجرائياً.",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778325976328"
      },
      {
        "type": "mcq",
        "text": "2. عندما نضع \"العنوان\" في أعلى اليمين، و\"العناصر الهامة\" في المركز، ثم وضع \"المصادر\" في أسفل \nاليسار، نحن نحقق معيار:",
        "score": 1,
        "options": [
          "التوازن غير النمطي",
          "التركيب وفق الثقافة العربية",
          " التباين (الشكل والأرضية)"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن التركيب يهتم بترتيب العناصر لجذب الانتباه حسب أولويتها بما يتوافق مع حركة عين القارئ العربي (من اليمين لليسار)",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778326848180"
      },
      {
        "type": "mcq",
        "text": "مشكلة \"تداخل العناصر مع الخلفية\" وصعوبة تمييز حدود الرسم تدل على خلل مباشر في معيار:",
        "score": 1,
        "options": [
          "التنظيم",
          "التوازن",
          "التباين"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "التباين هو المسؤول عن الفصل الواضح بين \"الشكل\" و \"الأرضية\"؛ وغيابه يجعل العناصر تندمج مع الخلفية وتختفي معالمها",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778326903272"
      },
      {
        "type": "mcq",
        "text": "أي من الحالات التالية تكسر معيار \"البساطة\" الذي هو مفتاح تصميم الإنفوجرافيك؟",
        "score": 1,
        "options": [
          "استخدام 3 ألوان فقط من دائرة الألوان",
          "محاولة عرض 5 أفكار رئيسية مختلفة في لوحة واحدة",
          "ترك هوامش أمان 2.5 سم من الجوانب"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن الإنفوجرافيك الناجح يركز على فكرة واحدة؛ وتعدد الأفكار الرئيسية يشتت القارئ ويجعله يبذل جهداً كبيراً للفهم، وهذا يضاد مبدأ البساطة",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778326999934"
      },
      {
        "type": "mcq",
        "text": "اللون الناتج عن مزج (أصفر + برتقالي) يُصنف ضمن:",
        "score": 1,
        "options": [
          "الألوان الأساسية",
          "الألوان الثانوية",
          "الألوان الهجينة"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "لأن الأصفر لون أساسي والبرتقالي لون ثانوي، وناتج مزجهما يسمى دائماً \"لوناً هجيناً\"",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327051395"
      },
      {
        "type": "mcq",
        "text": "يُعتبر نظام \"Isotype\" الذي ابتكره \"أوتو نيوراث\" مجرد وسيلة تزيينية للبيانات، ولا يعد لغة بصرية قائمة بحد ذاتها",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "نظام \"Isotype\" صُمم ليكون لغة عالمية بصرية (International System of Typographic Picture Education) تهدف لتبسيط المعلومات المعقدة لعامة الناس وتجاوز عوائق اللغة المكتوبة",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327200876"
      },
      {
        "type": "mcq",
        "text": "في مرحلة \"التحليل والقراءة\"، يقتصر دور المصمم على التأكد من صحة الأرقام إملائياً فقط",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هذه المرحلة هي الأهم تقنياً؛ حيث يتم فيها استخراج \"الأنماط\" والعلاقات المنطقية بين البيانات (مثل المقارنة أو التباين) لتحويلها من أرقام صماء إلى فكرة مرئية مفهومة",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327235975"
      },
      {
        "type": "mcq",
        "text": "\"الاتزان غير المتماثل\" عندما تتساوى العناصر في أشكالها وأحجامها على جانبي المحور الرأسي للتصميم.",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التساوي في الأشكال والأحجام هو \"اتزان متماثل\" (نمطي)، أما \"غير المتماثل\" فيعتمد على تعادل \"الأوزان البصرية\" لعناصر مختلفة تماماً في الشكل (مثل موازنة كتلة كبيرة فاتحة بكتلة صغيرة غامقة)",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327286664"
      },
      {
        "type": "mcq",
        "text": "معيار \"البساطة\" في الإنفوجرافيك التعليمي يهدف بشكل أساسي إلى تقليل المجهود الذهني الذي يبذله المتعلم لاستيعاب المعلومة",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "البساطة هي \"مفتاح التصميم\"؛ فكلما قل التعقيد واستبعدت التفاصيل غير الضرورية، ركز عقل المتعلم على الفكرة الجوهرية للدرس",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327441395"
      },
      {
        "type": "mcq",
        "text": "يُستخدم \"الملمس البصري\" (Visual Texture) لخلق إيحاء بالبعد الثالث والواقعية في التصميم بالرغم من كونه ثنائي الأبعاد",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الملمس يعطي إحساساً بخشونة أو نعومة السطح بصرياً، مما يعزز الرسالة الذهنية (مثل استخدام ملمس ورق قديم لإنفوجرافيك تاريخي) ويزيد من جاذبية التصميم",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327478113"
      },
      {
        "type": "mcq",
        "text": "أي من أنواع الإنفوجرافيك التالية يمنح \"الناشر\" القدرة على تحديث البيانات بشكل ديناميكي ومستمر؟",
        "score": 1,
        "options": [
          "الإحصائي الثابت",
          "المتحرك",
          "التفاعلي"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الإنفوجرافيك التفاعلي يتميز بالمرونة وإمكانية الإنشاء الديناميكي للمحتوى، مما يسمح بتحديثه وتعديله برمجياً ليعكس أحدث البيانات",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327543285"
      },
      {
        "type": "mcq",
        "text": "المرحلة التي يتم فيها رسم \"هيكل\" أو \"مخطط كروكي\" يحدد مسارات العين وتوزيع العناصر قبل البدء في التلوين هي:",
        "score": 1,
        "options": [
          "مرحلة البحث والبيانات",
          "مرحلة بناء المخطط",
          "مرحلة الإخراج الفني"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هذه المرحلة هي الجسر بين \"الفكرة\" و\"التنفيذ الفني\"، وبدونها يفتقر التصميم للتنظيم والترتيب المنطقي للمعلومات",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327663788"
      },
      {
        "type": "mcq",
        "text": "عندما نستخدم التدرج اللوني من الغامق إلى الفاتح لنبين تسلسل الأهمية في معلومة ما، نحن نطبق عنصر:",
        "score": 1,
        "options": [
          "الخط",
          "الاتجاه",
          "القيمة"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "القيمة تعبر عن درجات الإضاءة والعتمة في اللون، وهي أداة بصرية قوية لخلق التباين وتوضيح التدرج في الأهمية أو العمق",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327714852"
      },
      {
        "type": "mcq",
        "text": "أي مبدأ من مبادئ التصميم يضمن شعور المشاهد بأن جميع عناصر اللوحة (صور، نصوص، ألوان) تشكل \"نسيجاً واحداً\" متكاملاً؟",
        "score": 1,
        "options": [
          "التناسب",
          "الوحدة ",
          "السيادة"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الوحدة هي المبدأ الجامع الذي يربط العناصر ببعضها بعلاقات بصرية واضحة، مما يمنع التشتت ويجعل التصميم يبدو كعمل فني واحد لا أجزاء منفصلة",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327758627"
      },
      {
        "type": "mcq",
        "text": "5. الإنفوجرافيك الذي يستخدم \"الأسهم\" والمسارات المتسلسلة لشرح \"دورة حياة المنتج\" يتبع معيار:\n",
        "score": 1,
        "options": [
          "التباين",
          "التنظيم والترتيب",
          "الوضوح"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التنظيم يعتمد على ترتيب العناصر بطريقة منطقية تسهل تتبع الفكرة، والأسهم هي الأداة البصرية الأساسية لتحقيق هذا التتبع",
        "studentId": "students_1775848220866",
        "showExp": true,
        "id": "q_1778327807563"
      },
      {
        "type": "mcq",
        "text": "يُعد الإنفوجرافيك المتحرك (Motion Graphic) 1.مجرد مجموعة من الرسوم المتحركة البسيطة فقط",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هو أكثر من مجرد رسوم؛ فهو فن يدمج الرسوم، البيانات، الأصوات، والحركة لإيصال معلومات معقدة بطريقة مبسطة وجذابة",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328290204"
      },
      {
        "type": "mcq",
        "text": " من مميزات الإنفوجرافيك المتحرك أنه يساعد على زيادة قدرة المشاهد على تذكر المعلومات أكثر من النصوص",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لأن العقل البشري يتذكر الصور والحركات بشكل أفضل وأسرع من النصوص المجردة، مما يزيد من كفاءة عملية التعلم",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328359949"
      },
      {
        "type": "mcq",
        "text": "\"التحريك بالكمبيوتر\" يوفر مرونة وسرعة أكبر في الإنتاج مقارنة بـ \"التحريك الكلاسيكي\"",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "التحريك الكلاسيكي يتطلب إنشاء كل إطار بشكل فردي وجهداً كبيراً، بينما برامج الكمبيوتر تختصر الوقت وتوفر أدوات تحريك مرنة",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328398415"
      },
      {
        "type": "mcq",
        "text": "يجب الإسراف في استخدام الألوان والخطوط بكثرة في الإنفوجرافيك المتحرك لضمان جذب انتباه المشاهد",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "من معايير التصميم (صفحة 12) \"عدم الإسراف في استخدام الألوان والخطوط\" للحفاظ على بساطة التصميم وعدم تشتت المشاهد",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328422894"
      },
      {
        "type": "mcq",
        "text": " يُعد برنامج \"Video Scribe\" 5. متخصصاً في إنتاج فيديوهات تعتمد على طريقة \"الكتابة باليد\" أو الرسم أمام المشاهد",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "البرنامج مشهور بخاصية الـ Hand-drawn التي تظهر الرسوم والنصوص وكأنها تُكتب يدوياً في اللحظة نفسها",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328471619"
      },
      {
        "type": "mcq",
        "text": " ينقسم الإنفوجرافيك المتحرك إلى أسلوبين أساسيين هما:",
        "score": 1,
        "options": [
          "الصور الثابتة والخرائط الذهنية",
          "الرسوم المتحركة ولقطات الفيديو",
          "الرسوم الكلاسيكية والرسوم اليدوية فقط ",
          "النصوص المكتوبة والصور الفوتوغرافية"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "حسب صفحة 9، هما الأسلوبان الرئيسيان المعتمدان في بناء محتوى الإنفوجرافيك المتحرك",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328581734"
      },
      {
        "type": "mcq",
        "text": " أي من البرامج التالية يعتمد على \"نظام الطبقات\" (Layers) 7.ويستخدم في صناعة المؤثرات البصرية ما بعد الإنتاج؟",
        "score": 1,
        "options": [
          "iMovie",
          "Animoto",
          "Adobe After Effects",
          "Video Scribe"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": " برنامج \"أفتر إفكتس\" هو الأقوى في التعامل مع الطبقات والبيئات ثنائية وثلاثية الأبعاد والمؤثرات السينمائية",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778328963387"
      },
      {
        "type": "mcq",
        "text": " واحدة من أهم معايير تصميم الإنفوجرافيك المتحرك الناجح هي: ",
        "score": 1,
        "options": [
          "وضع أكبر قدر ممكن من البيانات في مشهد واحد",
          "التركيز على فكرة واحدة محددة عند التصميم",
          "استخدام أصوات صاخبة جداً لجذب الانتباه",
          "إطالة مدة الفيديو قدر الإمكان"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التركيز على فكرة واحدة يضمن وصول الرسالة بوضوح وبساطة دون تعقيد للمشاهد (صفحة 12)",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778329009330"
      },
      {
        "type": "mcq",
        "text": "تقنية التحريك التي يتم فيها إنشاء كل إطار بشكل فردي ثم عرضها بسرعة لخلق وهم الحركة تسمى:",
        "score": 1,
        "options": [
          "التحريك بالكمبيوتر",
          "التحريك الإطاري الرقمي",
          "التحريك الكلاسيكي",
          "التحريك التفاعلي"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا هو التعريف الدقيق للتحريك التقليدي الذي يتطلب وقتاً وجهداً كبيرين (صفحة 17)",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778329083290"
      },
      {
        "type": "mcq",
        "text": "يساعد استخدام الإنفوجرافيك المتحرك في العملية التعليمية على :",
        "score": 1,
        "options": [
          "تقليل دافعية الطلاب نحو التعلم",
          "ترسيخ المعلومات وتثبيتها في أذهان الطلاب",
          "جعل المناهج الدراسية أكثر صعوبة وتعقيداً ",
          "إلغاء دور المعلم في الفصل "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "من فوائده التعليمية (صفحة 11) أنه يوفر الوقت والجهد ويحفز الطلاب ويساعد في تنظيم الأفكار ومقارنتها",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778329156621"
      },
      {
        "type": "mcq",
        "text": "يركز الإنفوجرافيك بشكل أساسي على الجوانب الجمالية والإبداعية الواسعة، بينما يركز التصميم الجرافيكي على إيصال المعلومات",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "العكس هو الصحيح؛ التصميم الجرافيكي يشمل جوانب جمالية وإبداعية أوسع، بينما الإنفوجرافيك وظيفي أكثر ويركز على تبسيط وإيصال المعلومات والبيانات",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330092724"
      },
      {
        "type": "mcq",
        "text": "العلاقة بين الإنفوجرافيك وعلم البيانات تتمثل في أن كلاهما يهدف إلى تحويل البيانات إلى صور مرئية لتسهيل فهمها",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذا هو \"الهدف المشترك\" المذكور في الصفحة الثانية؛ حيث يعتمد الإنفوجرافيك على نتائج تحليل بيانات علم البيانات لتقديمها بشكل جذاب",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330198680"
      },
      {
        "type": "mcq",
        "text": "  يعتبر \" توني بوزان\" هو صاحب فكرة الإنفوجرافيك",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "توني بوزان هو صاحب فكرة \"الخرائط الذهنية\"، أما الإنفوجرافيك فينسب إلى \"كريستوف شاينر\" حسب جدول المقارنة في الصفحة الخامسة",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330237728"
      },
      {
        "type": "mcq",
        "text": "الخرائط الذهنية والخرائط المفاهيمية كلاهما وسائط غير خطية تساعد الطالب على تنظيم المعرفة وتسريع التعلم",
        "score": 1,
        "options": [
          "صج",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "كلا الوسيلتين تبتعدان عن السرد النصي التقليدي وتعتمدان على الرموز والأشكال والروابط البصرية التي يفضلها العقل لتنظيم الأفكار",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330271004"
      },
      {
        "type": "mcq",
        "text": "تتميز الخرائط المفاهيمية عن الخرائط الذهنية بوجود \"كلمات ربط\" على الأسهم توضح نوع العلاقة بين المفاهيم",
        "score": 1,
        "options": [
          "صح",
          "غلط"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": " في الخرائط المفاهيمية، يُكتب على كل سهم كلمات (مثل: هو، يتكون من، يؤدي إلى) لتوضيح طبيعة الارتباط، بينما في الذهنية تكون الروابط تفرعية فقط",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330301612"
      },
      {
        "type": "mcq",
        "text": " يستخدم الإنفوجرافيك في التسويق الرقمي لغرض محدد وهو :",
        "score": 1,
        "options": [
          "إجراء التحليلات الإحصائية والرياضية. ",
          "جذب الانتباه وتبسيط المعلومات المعقدة للعملاء.",
          "الاستغناء عن العلامات التجارية. ",
          " كتابة الأكواد البرمجية للمواقع. "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الهدف التسويقي هو جذب الانتباه وزيادة الوعي بالعلامة التجارية عبر تبسيط المحتوى المعقد",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330372983"
      },
      {
        "type": "mcq",
        "text": "أي من الوسائط التالية يتبع تنظيماً \"هرمياً\" يبدأ من المفاهيم العامة في الأعلى إلى الفرعية في الأسفل؟",
        "score": 1,
        "options": [
          " الخرائط الذهنية  ",
          "الخرائط المفاهيمية",
          "الرسوم المتحركة",
          "علم البيانات. "
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الخرائط المفاهيمية (جوزيف نوفاك) هي التي تلتزم بالبناء الهرمي الرأسي من الأعلى للأسفل",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330422083"
      },
      {
        "type": "mcq",
        "text": "عند البدء في إنشاء \"خريطة ذهنية\"، الخطوة الأولى والأساسية هي",
        "score": 1,
        "options": [
          "تحديد الفكرة المركزية في وسط الورقة.",
          "رسم الإطارات الهرمية.",
          "إضافة كلمات الربط على الأسهم. ",
          "جمع البيانات الإحصائية المعقدة"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الخريطة الذهنية \"مركزية\" بطبعها، تبدأ من فكرة في الوسط ثم تتفرع للخارج كالأغصان.",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330526230"
      },
      {
        "type": "mcq",
        "text": " من أمثلة الأدوات والمنصات المتخصصة في إنشاء \"الإنفوجرافيك\" كما ورد في النص:",
        "score": 1,
        "options": [
          "MindMeister و XMind",
          "Canva و Piktochart",
          " Coggle و Miro",
          "Microsoft Excel"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "هذه المنصات توفر قوالب بصرية جاهزة مخصصة لتصميم الإنفوجرافيك والبيانات. ",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330602822"
      },
      {
        "type": "mcq",
        "text": " ما هو الفرق في \"اتجاه التصميم\" بين الخريطة الذهنية والخرائط المفاهيمية؟ ",
        "score": 1,
        "options": [
          "الذهنية من الأعلى للأسفل، والمفاهيمية من الداخل للخارج",
          "الذهنية من الداخل للخارج مركزية والمفاهيمية من الأعلى للأسفل رأسية",
          "كلاهما يبدأ من اليمين إلى اليسار دائما",
          "لا يوجد فرق في اتجاه التصميم بينهما"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "الخريطة الذهنية تنطلق من المركز (فكرة رئيسية)، بينما المفاهيمية تتبع تسلسلاً هرمياً (رأسي)",
        "studentId": "students_1775379571542",
        "showExp": true,
        "id": "q_1778330700812"
      },
      {
        "type": "mcq",
        "text": "كلمة \"إنفوجرافيك\" هي دمج لمصطلحي (Information) و (Graphic) وتعني:",
        "score": 1,
        "options": [
          "الرسوم المعلوماتية",
          "النصوص الرقمية",
          "البرمجة البصرية"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "المصطلح يجمع بين البيانات (Info) والتصوير البصري (Graphic).",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332135441"
      },
      {
        "type": "mcq",
        "text": "الهدف الرئيسي من استخدام \"البساطة\" في التصميم هو: ",
        "score": 1,
        "options": [
          "تقليل حجم الملف",
          "عدم إجهاد عين وعقل القارئ",
          " سرعة الإنتاج فقط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "كثرة التفاصيل غير الضرورية تشتت الانتباه عن المعلومة الأساسية",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332182921"
      },
      {
        "type": "mcq",
        "text": "الإنفوجرافيك الذي يعرض \"تطور العلامة التجارية\" عبر السنين يسمى:",
        "score": 1,
        "options": [
          "إنفوجرافيك مقارن",
          "إنفوجرافيك زمني",
          "إنفوجرافيك جغرافي"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأنه يعتمد على الترتيب التاريخي للأحداث",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332230919"
      },
      {
        "type": "mcq",
        "text": "نقطة البداية لتتبع العين في الإنفوجرافيك الموجه للثقافة العربية تكون من: ",
        "score": 1,
        "options": [
          "أعلى اليسار",
          "أعلى اليمين",
          "المنتصف دائما"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأن اللغة العربية تُقرأ من اليمين إلى اليسار، فتبدأ العين تلقائياً من جهة اليمين.",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332286438"
      },
      {
        "type": "mcq",
        "text": "في معايير الوضوح، يجب ألا تقل مساحة الرسوم في اللوحة عن:",
        "score": 1,
        "options": [
          "10% من المساحة.",
          "25% (الربع) من المساحة",
          "50% (النصف) من المساحة"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لضمان غلبة الطابع البصري على الطابع النصي في الإنفوجرافيك",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332356799"
      },
      {
        "type": "mcq",
        "text": "فكرة \"الموشن جرافيك\" تعتمد أساساً على: ",
        "score": 1,
        "options": [
          "الرسوم الثابتة",
          "تحريك البيانات مع دمج الصوت",
          "النصوص المكتوبة فقط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لموشن جرافيك هو رسوم توضيحية متحركة وليس مجرد تصوير فيد",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332415153"
      },
      {
        "type": "mcq",
        "text": "يعتبر الإنفوجرافيك المتحرك فن دمج:",
        "score": 1,
        "options": [
          "الصور والنصوص فقط",
          "الرسوم والبيانات والأصوات والحركة",
          "الفيديو الحقيقي فقط"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "التعددية الوسائطية تساهم في تبسيط المعلومات المعقدة",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332468294"
      },
      {
        "type": "mcq",
        "text": "في مواقع HTML5، تعتبر لقطات الفيديو (Video Based):",
        "score": 1,
        "options": [
          "الأكثر انتشار",
          "الأقل انتشاراً مقارنة بالرسوم البرمجية",
          "غير مدعومة نهائيا"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "نظراً لأن الرسوم المتجهة (SVG) والبرمجية أخف وأسرع في التحميل من الفيدي",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332831746"
      },
      {
        "type": "mcq",
        "text": "يساعد الإنفوجرافيك المتحرك في فهم \"المجردات\" من خلال:",
        "score": 1,
        "options": [
          "إلغاء الألوان",
          "ضغط الواقع أو تكبير/تصغير العناصر",
          "زيادة طول الفيديو"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يتيح رؤية أشياء لا تُرى بالعين المجردة (مثل حركة الذرات)",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778332916026"
      },
      {
        "type": "mcq",
        "text": "العلاقة بين تذكر الصور وتذكر النصوص في العقل البشري",
        "score": 1,
        "options": [
          "الصور تُنسى أسرع",
          "العقل يتذكر الصور والحركات أفضل وأسرع",
          " لا يوجد فرق بينهما"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": " لأن الفص البصري في الدماغ يعالج الصور بشكل فوري بينما يحتاج النص لتحليل وترجمة",
        "studentId": "students_1775125739063",
        "showExp": true,
        "id": "q_1778333408290"
      }
    ],
    "examMode": "evaluation",
    "emailPolicy": "full_report",
    "adminEmails": "mahmoud21abdalrhman@gmail.com,salmazahran167@gmail.com",
    "startTime": "2026-05-09T21:00",
    "endTime": "2026-05-09T22:30",
    "latePolicy": "hard_stop",
    "allowBackNavigation": true,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791",
    "webhookUrl": "https://script.google.com/macros/s/AKfycbxMj-1we6-44uVUNfBqdcH0yoyNZG4wxC_Yd8txuzrPtudDwJjPO3bTK5cVUfGc9whI/exec"
  },
  {
    "id": "quizzes_1775849685012",
    "timestamp": "2026-04-10T19:34:45.012Z",
    "titleAr": "امتحان الميد تيرم",
    "titleEn": "Mid-term exam",
    "isShuffled": false,
    "feedbackMode": "immediate",
    "subjectId": "subjects_1775849639042",
    "publisherId": "s_founder_hardcoded",
    "questions": [
      {
        "type": "mcq",
        "text": "تهدف المواطنة الرقمية إلى استخدام التكنولوجيا بدون قيود أو ضوابط.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تساعد على استخدام التكنولوجيا بشكل واعٍ ومسؤول ، والتنقل في بيئة الإنترنت بمسؤولية وأمان ، وليس بدون قيود.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775849896577"
      },
      {
        "type": "mcq",
        "text": "من أبعاد المواطنة الرقمية: الأمان الرقمي، والسلوك الأخلاقي، والمشاركة الرقمية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تشمل أبعاد المواطنة الرقمية \"الأمن الرقمي\" ، و\"اللياقة الرقمية\" التي تمثل السلوك اللائق والاحترام للآخرين (السلوك الأخلاقي) ، و\"النفاذ الرقمي\" والاتصال الذي يمثل المشاركة.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775849976623"
      },
      {
        "type": "mcq",
        "text": "المواطنة الرقمية لا تتعلق بالهوية الثقافية أو القيم المجتمعية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية ترتبط ارتباطاً وثيقاً بالقيم المجتمعية، فهي تهدف إلى تحقيق الفائدة للمجتمع ، وتقوم على مبادئ مثل احترام الآخرين واللياقة.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850013793"
      },
      {
        "type": "mcq",
        "text": "استخدام التكنولوجيا لأغراض إيجابية يعكس سلوك المواطن الرقمي.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تساعد الفرد على استخدام التكنولوجيا بما يحقق الفائدة للفرد والمجتمع.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850064055"
      },
      {
        "type": "mcq",
        "text": "المواطنة الرقمية تقتصر على البالغين فقط.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تشمل جميع الأعمار، والدليل على ذلك وجود دور للمعلم في تعزيز المواطنة عند الطلاب.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850107876"
      },
      {
        "type": "mcq",
        "text": "من حقوق المواطن الرقمي: حماية بياناته والتفاعل بحرية وأمان.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "من الحقوق والمسؤوليات الرقمية حماية الخصوصية الشخصية ، ومن الأمن الرقمي حماية البيانات ، مع ضرورة التنقل في الإنترنت بمسؤولية وأمان.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850150942"
      },
      {
        "type": "mcq",
        "text": "تكنولوجيا المعلومات لم تؤثر على مفهوم المواطنة.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لقد أثرت التكنولوجيا بشكل كبير، مما أدى إلى ظهور مصطلح جديد وهو \"المواطن الرقمي\" بجانب المواطنة التقليدية",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850195755"
      },
      {
        "type": "mcq",
        "text": "البعد القانوني من أبعاد المواطنة الرقمية يشمل المساواة أمام القانون والحقوق المدنية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "تُعتبر العبارة صواباً لأن المواطنة الرقمية هي امتداد وتطبيق للمواطنة التقليدية في البيئة الافتراضية؛ فالبعد القانوني الذي يضمن المساواة والتمتع بالحقوق المدنية ينتقل مع الفرد إلى العالم الرقمي لضمان حماية حقوقه وتنظيم مسؤولياته القانونية تحت مظلة الدولة، مما يعزز قيم العدالة الاجتماعية رقمياً.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850247950"
      },
      {
        "type": "mcq",
        "text": "لا تتطلب المواطنة الرقمية أي وعي سياسي أو اجتماعي.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المواطنة الرقمية تتطلب وعياً اجتماعياً، حيث تشمل \"اللياقة الرقمية\" التواصل باحترام وأدب في المحادثات عبر الإنترنت ، وتتطلب التفاعل بطريقة حساسة وأخلاقية.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850291729"
      },
      {
        "type": "mcq",
        "text": "تهدف المواطنة الرقمية إلى إعداد جيل قادر على التفاعل الواعي في البيئة الرقمية.",
        "score": 1,
        "options": [
          "صواب",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "مفهوم المواطنة الرقمية يتضمن قدرة الفرد على التفاعل مع المستخدمين والمحتوى الرقمي بطريقة نشطة ونقدية وأخلاقية وواعية.",
        "studentId": "s_founder_hardcoded",
        "showExp": true,
        "id": "q_1775850330203"
      }
    ],
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1777298325651",
    "timestamp": "2026-04-27T13:58:45.651Z",
    "titleAr": "امتحان سريع علي الفصل الاول",
    "titleEn": "quick quiz on chapter one",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "تعريف الاستوديو الإذاعي هو مكان مخصص ومجهز هندسياً وتقنياً لإنتاج المواد الإذاعية فقط ؟\n",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "",
        "studentId": "students_1775379443604",
        "showExp": false,
        "id": "q_1777298401018"
      },
      {
        "type": "mcq",
        "text": "يتم تجهيز الاستوديو من خلال ثلاثه طرق (العزل الصوتي, المعالجه الصوتيه, التحسين الصوتي)\n",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "عشان هما طريقتين بس العزل والمعالجه",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298452909"
      },
      {
        "type": "mcq",
        "text": "ما هو الافضل ؟ استخدام البناء المزدوج ام الثلاثي ام الفردي مع مواد عازله قويه للاستوديو\n",
        "score": 1,
        "options": [
          "بناء فردي",
          "بناء ثلاثي",
          "بناء مزدوج"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "لا يوجد حاجه تسمي بناء فردي او ثلاثي",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298549761"
      },
      {
        "type": "mcq",
        "text": "العزل الصوتي هو ان تتحكم في سلوك الصوت داخل الاستوديو ",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "العزل الصوتي هو منع تسرب أي ضوضاء من الخارج إلى داخل الاستوديو",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298620529"
      },
      {
        "type": "mcq",
        "text": "أي نوع من المواد يُفضل استخدامه في تبطين جدران استوديو الموسيقى والغناء؟",
        "score": 1,
        "options": [
          "مواد شديدة الامتصاص",
          "مواد عاكسة للصوت ",
          "مواد عازلة للاهتزازات",
          "مواد متوسطة الامتصاص."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "عشان المواد العاكسه بتزيد زمن الرنين فيزداد فخامه الصوت",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298699153"
      },
      {
        "type": "mcq",
        "text": "ي عمليه تنفيذ العزل الصوتي يتم استخدام:\nالأبواب :استخدام نظام \"الباب المزدوج\" بمواد ثقيلة وعازلة.\nالتكييف :الاستوديو يكون خالياً من النوافذ تماما،ً ويُستبدل بتكييف عادي\nسد الثغرات :يتم تغطية فتحة المفتاح في الباب بكتلة متحركة من \"الكاوتش \"لمنع أي تسرب للصوت من الفتحات الصغيرة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "المفروض يتم تركييب تكييف مركزي صامت",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298773152"
      },
      {
        "type": "mcq",
        "text": "طاولة مراقبة الصوت (الميكسر) مسؤولة فقط عن تجميع مصادر الصوت المختلفة ولا يمكنها التحكم في مستوى قوة الصوت",
        "score": 1,
        "options": [
          "خطأ",
          "صح"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "إلى جانب التجميع، يُعد الميكسر الأداة الأساسية للتحكم في 'علو ووطي' الصوت وعمل الدمج (الميكس).",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298830817"
      },
      {
        "type": "mcq",
        "text": "سماعة التخاطب يستخدمها المذيع عشان يسمع تعليمات المخرج \"وهو على الهواء\"",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تعمل سماعة التخاطب فقط عندما المخرج بيكلم المذيع وهو جوه الاستوديو تكون الميكروفونات مغلقة للحديث قبل أو بعد الهواء.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777298976995"
      },
      {
        "type": "mcq",
        "text": "أي تقنية من تقنيات الانتقالات الصوتية تعتمد على تلاشي صوت تدريجياً بالتزامن مع ظهور صوت آخر تدريجياً لعمل انتقال ناعم؟",
        "score": 1,
        "options": [
          "Cutting (القطع)",
          "Fade In/Out (الخفوت والظهور)",
          "Blendind (الدمج)",
          "Sigue (السيجواي)"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "تسمح هذه التقنية بنعومة الانتقال وتجنب الفجوات الصامتة عن طريق التداخل التدريجي للصوتين.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777299061255"
      },
      {
        "type": "mcq",
        "text": "ما هي الوظيفة الأساسية لرأس التسجيل في أجهزة شرائط التسجيل؟",
        "score": 1,
        "options": [
          "نسخ الأجزاء المطلوبة إلى شريط جديد.",
          "قراءة الشريط وتحويله لصوت مسموع.",
          "تحويل التيار الكهربائي إلى نبضات مغناطيسية على الشريط.",
          "مسح أي مادة مسجلة سابقاً لتجهيز الشريط."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "تقوم هذه الرأس بطباعة الذبذبات الصوتية القادمة كتيار كهربائي إلى نبضات تُحفظ على الشريط المغناطيسي.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777299140444"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "",
    "startTime": "",
    "endTime": "",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1777408169446",
    "timestamp": "2026-04-28T20:29:29.446Z",
    "titleAr": "اختبار سريع اخر علي الفصل الاول ",
    "titleEn": "Another quick quiz on the first semester",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "في استوديو الدراما، أي الأجزاء الآتية يُستخدم لإعطاء المستمع إيحاءً بأن المشهد التمثيلي يدور داخل غرفه أو مكتب؟",
        "score": 1,
        "options": [
          "الاستوديو المتوسط",
          "الاستوديو الميت",
          "الاستوديو الحي",
          "الاستوديو الاحاديث"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "لانه يعطي صدي صوت يتناسب مع طبيعه الانعكسات داخل الغرفه او المكتب",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777408422637"
      },
      {
        "type": "mcq",
        "text": "ما هو نوع الانعكاس الصوتي والمواصفات التي يحتاجها 'استوديو الأحاديث' المخصص للمناقشات؟",
        "score": 1,
        "options": [
          "صدى صوت منعدم تماماً لمنع تداخل أصوات الضيوف.",
          "صدي صوت متوسط جداً لإعطاء حيوية للصوت",
          "يشبه مواصفات استوديو الربط حيث يحتاج لمواد ماصه اكثر.",
          "صدى صوت مرتفع ليغطي على ضوضاء الخلفية"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "استوديو الأحاديث يتطلب وضوحاً عالياً للحوارات، لذا فهو يشبه استوديو الربط في المواد الماصه الكثيره= زمن رنين اقل.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409517274"
      },
      {
        "type": "mcq",
        "text": "بما أن الميكروفون يحول ذبذبات الصوت إلى تيار كهربائي 'ضعيف'، فما هو الجهاز المستخدم في الاستوديو لتقوية هذه الإشارة ودفعها عبر الكابل إلى غرفة المراقبة؟",
        "score": 1,
        "options": [
          "طاولة مراقبة الصوت (الميكسر)",
          "رأس التسجيل",
          "جهاز المكبر",
          "جهاز Uher الألماني"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "وظيفة المكبر الأساسية هي أخذ الإشارة الكهربائية الضعيفة جداً من الميكروفون وتقويتها لضمان وصولها سليمة لغرفة المراقبة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409619473"
      },
      {
        "type": "mcq",
        "text": "ما هي اتجاهية 'الميكروفون الديناميكي' وما مدى مناسبته للعمل داخل الاستوديو المغلق؟\n",
        "score": 1,
        "options": [
          "قلبي الشكل، ويستخدم فقط في استوديو الموسيقى.",
          "غير اتجاهي (يلتقط من جميع الاتجاهات)، ولا يُفضل داخل الاستوديو إلا باقتراب المذيع منه جداً.",
          "ثنائي الاتجاه (من الأمام والخلف) ومثالي للدراما في الاستوديو.",
          "اتجاهي (يلتقط من اتجاه واحد) وهو الأفضل للاستوديو."
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "لأنه يلتقط الصوت من كل مكان، فإنه قد يلتقط ضوضاء الاستوديو أو صدى الجدران، لذا يقتصر استخدامه بالداخل على حالات التحدث عن قُرب شديد (6-8 بوصة).",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409739718"
      },
      {
        "type": "mcq",
        "text": "أي الميكروفونات التالية يُعد ممتازاً داخل الاستوديو لدرجة أن المخرجين يفضلونه في الموسيقى والدراما لكونه يلغي أصوات الجوانب (ثنائي الاتجاه)؟\n",
        "score": 1,
        "options": [
          "الميكروفون اللاسلكي",
          "الميكروفون القلبي",
          "الميكروفون الديناميكي",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "يلتقط من الأمام والخلف فقط مما يمنع تشويش الجوانب، ويعطي جودة عالية تناسب الدراما والموسيقى في الاستوديو.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409821468"
      },
      {
        "type": "mcq",
        "text": "لتحقيق 'توازن الميكروفون' في حال وجود عدة أشخاص يتحدثون أمام (ميكروفون واحد)، ما هو الإجراء الصحيح الذي يجب اتخاذه؟\n",
        "score": 1,
        "options": [
          "رفع مستوى الصوت للجميع بشكل متساوٍ عبر طاولة المراقبة.",
          "تغيير وضع الميكروفون ليكون غير اتجاهي.",
          "أن يبتعد أو يقترب كل شخص حسب 'قوة صوته الأصلي'.",
          "استخدام سماعة تخاطب لكل متحدث."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا هو الحل العملي لضبط التوازن؛ صاحب الصوت القوي يبتعد قليلاً، وصاحب الصوت الضعيف يقترب ليتساوى خروج الأصوات.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777409901285"
      },
      {
        "type": "mcq",
        "text": "بخصوص الأدوات الإذاعية، لماذا تُعتبر 'الساعة' من أهم الأشياء داخل الاستوديو؟",
        "score": 1,
        "options": [
          "لضبط المواعيد بالثانية ومعرفة مدة البرنامج بالضبط.",
          "لحساب زمن رنين الصوت بدقة هندسية.",
          "لتحويل الميكروفونات للعمل آلياً.",
          "لمعرفة وضبط سرعات شرائط التسجيل."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الإذاعة تعتمد على الخريطة الزمنية بالثانية لتنظيم الفواصل والبرامج بدقة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410015345"
      },
      {
        "type": "mcq",
        "text": "ما هي الأداة التي يعتمد عليها المذيع بالأساس لتلقي التوجيهات من المخرج 'وهو على الهواء مباشرة' دون أن يتأثر البث؟\n",
        "score": 1,
        "options": [
          "سماعة التخاطب",
          "سماعة الرأس",
          "السماعات الخارجية",
          "الايربودز"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "ارتداء المذيع لسماعة الرأس يضمن وصول صوت المخرج لأذن المذيع فقط أثناء عمل الميكروفونات.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410142304"
      },
      {
        "type": "mcq",
        "text": "ما هي الوظيفة الأساسية لـ 'الأسطوانات' في غرفة المراقبة، وبماذا تتميز أنواعها؟\n",
        "score": 1,
        "options": [
          "تُستخدم لتسجيل الشرائط، وتختلف سرعاتها بين 19 و 27 لفه",
          "تُستخدم لعمل مونتاج النسخ (Dubb Editing) بين جهازين",
          "تُستخدم لتشغيل المواد الموسيقية والمؤثرات الصوتية، وتختلف أنواعها حسب عدد اللفات في الدقيقة",
          "تُستخدم كأداة لحفظ أرشيف البرامج المكتوبة وتختلف أحجامها."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "تشغيل المواد الاذاعيه هي الوظيفة التقليدية للأسطوانات الإذاعية، وتتنوع أجهزتها لتدعم سرعات 16، 33.3، 45، و 78 لفة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410322832"
      },
      {
        "type": "mcq",
        "text": "يُعرف استوديو الربط باسم آخر، ويتميز بمواصفات هندسية معينة لضمان وضوح الكلمات، فما هي؟\n",
        "score": 1,
        "options": [
          "الاستوديو الميت، ومساحته صغيرة وزمن رنين مرتفع.",
          "الاستوديو الحي، ومساحته متوسطة وزمن رنين منعدم.",
          "الاستوديو التنفيذي، ومساحته صغيرة وزمن رنين منخفض",
          "استوديو المونتاج، ومساحته كبيرة وزمن رنين عالي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا هو الاسم الثاني لاستوديو الربط، ومساحته وزمن رنينه المنخفض يضمنان وضوح صوت المذيع التام.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410472319"
      },
      {
        "type": "mcq",
        "text": "أي جزء من أجزاء استوديو الدراما يُستخدم لإعطاء إيحاء صوتي بتمثيل مشهد داخل قبو؟\n",
        "score": 1,
        "options": [
          "الاستوديو المتوسط",
          "الاستوديو الميت",
          "الاستوديو الحي",
          "استوديو الأحاديث"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الاستوديو الحي يتميز بصدى صوت مرتفع، مما يجعله مثالياً لتمثيل الأماكن المغلقة التي يتردد فيها الصوت مثل الأقبية والجبال.\n",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410649550"
      },
      {
        "type": "mcq",
        "text": "تعتبر 'غرفة المراقبة' المركز الرئيسي لإدارة العملية الإذاعية، فأي من التالي يُعد من مهامها الأساسية؟",
        "score": 1,
        "options": [
          "عمليات الحذف والإضافة ونسخ الشرائط حصراً.",
          "تسجيل الأصوات الخارجية في الشارع.",
          "عزل الضوضاء عن استوديو الربط فقط.",
          "تجميع مصادر الصوت وخلطها (مزج الكلام مع الموسيقى والمؤثرات)."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "تقوم غرفة المراقبة باستقبال الإشارات من الميكروفونات والأجهزة الأخرى ومزجها معاً وفقاً للسيناريو عبر طاولة الصوت.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410734318"
      },
      {
        "type": "mcq",
        "text": "أي الميكروفونات التالية يُعتبر 'غير اتجاهي' (يلقط من كل حتة)، ولذلك لا يُفضل استخدامه داخل الاستوديو إلا إذا اقترب منه المذيع جداً؟",
        "score": 1,
        "options": [
          "الميكروفون الديناميكي",
          "الميكروفون القلبي",
          "الميكروفون المهجن",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الميكروفون الديناميكي يلتقط الصوت من جميع الاتجاهات، مما يجعله عرضة لالتقاط صدى الاستوديو، لذا لا يُنصح به بالداخل إلا عند التحدث عن قرب شديد.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410828800"
      },
      {
        "type": "mcq",
        "text": "ما هو الميكروفون الأمثل للاستخدام عند تسجيل أغنية أو برنامج به جمهور، حيث يركز على صوت المؤدي ويمنع صوت الآلات أو الجمهور المحيط؟",
        "score": 1,
        "options": [
          "الميكروفون الديناميكي",
          "الميكروفون القلبي",
          "الميكروفون اللاسلكي",
          "الميكروفون الشريطي"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "يلتقط الميكروفون القلبي الصوت من اتجاه واحد فقط (الأمام)، مما يوفر عزلاً ممتازاً لصوت المغني عن الضوضاء المحيطة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410894029"
      },
      {
        "type": "mcq",
        "text": "الميكروفون الديناميكي هو الأفضل في الإذاعة الخارجية والمقابلات في الشارع لكونه قوياً ويتحمل ساعات العمل الطويلة.",
        "score": 1,
        "options": [
          "صح",
          "خطأ"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "بالفعل، الميكروفون الديناميكي يتحمل ظروف العمل الشاقة ورخيص الثمن، مما يجعله مثالياً للشارع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777410978341"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "",
    "startTime": "",
    "endTime": "",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  },
  {
    "id": "quizzes_1777448343262",
    "timestamp": "2026-04-29T07:39:03.262Z",
    "titleAr": "اختبار علي الفصل التاني",
    "titleEn": "Quiz on the second semester",
    "isShuffled": true,
    "feedbackMode": "end",
    "subjectId": "subjects_1775125681706",
    "publisherId": "students_1775379443604",
    "questions": [
      {
        "type": "mcq",
        "text": "أي من المراحل التالية تُعرف بأنها مرحلة 'ما قبل الإنتاج' وتشمل الخطوات التأسيسية مثل البحث وكتابة النص واختيار فريق العمل؟",
        "score": 1,
        "options": [
          "مرحلة المونتاج",
          "مرحلة التنفيذ",
          "مرحلة المزج الصوتي",
          "مرحلة الإعداد"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "تتضمن هذه المرحلة كافة التجهيزات الورقية والبحثية التي تتم قبل بدء العمل الفني.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777448448836"
      },
      {
        "type": "mcq",
        "text": "لماذا يُعتبر 'تحديد الجمهور المستهدف' الخطوة الأولى والأساسية التي تسبق حتى اختيار فكرة البرنامج الإذاعي؟",
        "score": 1,
        "options": [
          "للتأكد من توفر الميزانية الكافية لإنتاج البرنامج.",
          "لاختيار أنواع الميكروفونات المناسبة للتسجيل.",
          "لأنه يسهل تحديد الفكرة واختيار القالب الإذاعي.",
          "لأنه يسهل حجز فريق العمل وتحديد الفكره."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "معرفة خصائص المستمعين توجه فريق العمل لاختيار مواضيع تهمهم وقوالب تتناسب مع طبيعتهم.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777448629955"
      },
      {
        "type": "mcq",
        "text": "عند تخطيط وقت البث لبرنامج موجه خصيصاً لـ 'المرأة العاملة'، أي من الأوقات التالية يُعد اختياراً خاطئاً سيؤدي لانصرافها عن الاستماع؟",
        "score": 1,
        "options": [
          "وقت ذروة عملها مثل الساعة الثانية ظهراً.",
          "فترات المساء بعد انتهاء المهام اليومية.",
          "أيام العطلات الأسبوعية.",
          "أوقات الصباح الباكر أثناء الذهاب للعمل."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "بث البرنامج في أوقات الانشغال القصوى يضمن عدم قدرة هذه الفئة على متابعة الراديو",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777451823259"
      },
      {
        "type": "mcq",
        "text": "إذا قرر المعد كتابة برنامج إذاعي يناقش 'قضايا الإدمان وأزمة الإسكان'، فمن أي مصادر استمداد الأفكار استوحى هذا الموضوع؟",
        "score": 1,
        "options": [
          "الظواهر الجديدة",
          "الصراع ضد الكوارث الطبيعية",
          "صراع الخير والشر",
          "الصراع من أجل حل المشكلات"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "القضايا الاجتماعية المعقدة مثل الإسكان والإدمان تندرج تحت مساعي المجتمع لإيجاد حلول جذرية لمشكلاته.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777452079057"
      },
      {
        "type": "mcq",
        "text": "تعتمد مرحلة الإعداد على جمع المعلومات من مصادر متنوعة، فأي من التالي يُصنف بوضوح ضمن 'المصادر المكتبية'؟\n",
        "score": 1,
        "options": [
          "اللقاءات المباشرة مع الخبراء المتخصصين.",
          "استطلاعات رأي الجمهور في الشارع.",
          "التقارير الحكومية وأرشيف البرامج السابقة.",
          "المداخلات الهاتفية أثناء البرامج المباشرة."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذه المواد موثقة ومحفوظة وتتطلب بحثاً واطلاعاً للحصول على المعلومات الداعمة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777452156938"
      },
      {
        "type": "mcq",
        "text": "في حال استخدام 'مؤثر صوتي مسجل مسبقاً' لصوت الرعد أو أمواج البحر أثناء تنفيذ البرنامج، فهذا يُعد من المؤثرات:\n",
        "score": 1,
        "options": [
          "الطبيعية",
          "المصادر الشخصية",
          "موسيقى التتر",
          "الصناعية"
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "المؤثرات التي تكون جاهزة ومسجلة مسبقاً لتوضع في المونتاج تُصنف كمؤثرات صناعية.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777452223746"
      },
      {
        "type": "mcq",
        "text": "يُعد الحفاظ على 'وحدة البرنامج' من أهم شروط كتابة النص الإذاعي (الاسكريبت). ماذا يعني هذا المبدأ الفني؟\n",
        "score": 1,
        "options": [
          "استخدام لغة واحدة (فصحى أو عامية) دون دمج بينهما إطلاقاً.",
          "أن يتم تسجيل البرنامج في استوديو واحد فقط لضمان وحدة الصوت.",
          "ترابط كافة عناصر وفقرات البرنامج لتخدم الهدف النهائي والموضوع الأساسي.",
          "أن يتكون البرنامج بأكمله من فقرة واحدة متصلة دون أي فواصل."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الوحدة تعني أن تساهم كل فقرة ومقابلة ومؤثر صوتي في بناء الفكرة الرئيسية دون تشتيت المستمع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777452316026"
      },
      {
        "type": "mcq",
        "text": "ما هي الطريقة الفعالة التي يتبعها المخرج الإذاعي مع 'الضيوف' قبل بدء التسجيل الفعلي داخل الاستوديو لضمان جودة الأداء؟",
        "score": 1,
        "options": [
          "تجنب الحديث معهم وترك هذه المهمة بالكامل لفني الصوت.",
          "منحهم النص لقراءته دون توجيه.",
          "إجراء دردشة ودية معهم لكسر رهبة الميكروفون وإعطائهم التعليمات الأساسية.",
          "بدء التسجيل فور دخولهم لالتقاط عفويتهم الأولى."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "هذا الإجراء يمنح الضيف شعوراً بالأمان ويوضح له كيفية التعامل مع الإشارات والتوقيتات براحة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453002686"
      },
      {
        "type": "mcq",
        "text": "أي العمليات التالية تُعتبر العملية النهائية التي يقوم فيها فني الصوت بـ 'دمج العناصر الصوتية' (كلام المذيع، المؤثرات، والموسيقى) في توقيتات محددة؟",
        "score": 1,
        "options": [
          "التجميع النهائي",
          "المونتاج",
          "المزج الصوتي ",
          "التقييم الشكلي"
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "عملية الميكس هي الخلط الفني والدقيق لطبقات الصوت المختلفة لتخرج للمستمع في شكل احترافي متوازن.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453193815"
      },
      {
        "type": "mcq",
        "text": "إذا أراد فريق العمل قياس مدى اهتمام الجمهور وحرصهم على المتابعة 'أثناء الدورة الإذاعية للبرنامج'، فأي نوع من التقييم يجب أن يعتمدوا عليه؟",
        "score": 1,
        "options": [
          "التقييم المرحلي",
          "تقييم المضمون",
          "التقييم الشكلي",
          "التقييم النهائي"
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "يعتمد هذا التقييم على رصد ردود الفعل الفورية عبر المكالمات والرسائل أثناء فترة البث المستمرة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453265907"
      },
      {
        "type": "mcq",
        "text": "إذا كان البرنامج الإذاعي موجهاً لـ 'الأطباء والمهندسين'، فكيف يُصنف هذا الجمهور؟\n",
        "score": 1,
        "options": [
          "جمهور عام مهني.",
          "جمهور خاص (فئات سنية).",
          "جمهور خاص (فئات مهنية).",
          "جمهور خاص (فئات جغرافية)."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "توجيه البرنامج لمهن محددة يجعله موجهاً لجمهور خاص مصنف حسب المهنة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453851910"
      },
      {
        "type": "mcq",
        "text": "برنامج يتابع تحركات المشاهير وأخبار حياتهم اليومية، ما هو مصدر استمداد فكرة هذا البرنامج؟\n",
        "score": 1,
        "options": [
          "الموضوعات الإعلامية.",
          "الحياة اليومية.",
          "الظواهر الجديدة.",
          "الاهتمامات الإنسانية."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "فضول الناس لمعرفة حياة المشاهير والأشخاص تحت الأضواء يندرج تحت الاهتمامات الإنسانية.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777453925308"
      },
      {
        "type": "mcq",
        "text": "أثناء خطوة جمع المادة والتواصل مع الضيوف، لماذا يُنصح المعد دائماً بتوفير 'شخصيات بديلة'؟\n",
        "score": 1,
        "options": [
          "لزيادة مدة البرنامج في حال كان قصيراً.",
          "لعمل صراع أفكار بين الضيوف على الهواء.",
          "لضمان عدم تعطل العمل في حال اعتذار الضيف الأساسي.",
          "لتنويع مصادر المعلومات المكتبية."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "الضيف البديل هو خطة طوارئ تنقذ حلقة البرنامج من الإلغاء إذا حدث ظرف طارئ للضيف الأساسي.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777454001288"
      },
      {
        "type": "mcq",
        "text": "ا هو نوع الموسيقى الذي يُستخدم حصراً 'للفصل بين الفقرات وتغيير الحالة المزاجية' للمستمع؟\n",
        "score": 1,
        "options": [
          "موسيقى التتر.",
          "المؤثرات الصناعية.",
          "موسيقى الربط.",
          "المزج الصوتي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "موسيقى الربط تُستخدم داخل البرنامج للتنقل السلس بين الفقرات وتغيير الإيقاع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777454560753"
      },
      {
        "type": "mcq",
        "text": "في خطوة 'التجميع النهائي' للإعداد، ماذا يُقصد بمصطلح (الخريطة الصوتية)؟\n",
        "score": 1,
        "options": [
          "تحديد أماكن الموسيقى والمؤثرات والتسجيلات الخارجية داخل النص.",
          "وضع التصور النهائي لتوزيع الفقرات.",
          "تحديد زمن دقيق لكل فقرة بالثانية.",
          "رسم مخطط هندسي لمواقع الميكروفونات في الاستوديو."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "الخريطة الصوتية ترسم متى يدخل كل مؤثر صوتي أو موسيقى ضمن سياق الحلقة.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777454660466"
      },
      {
        "type": "mcq",
        "text": "لضمان بداية قوية وجذابة للاسكريبت، يمكن للمعد استخدام عدة تقنيات. أي من التالي يُعتبر إحدى هذه التقنيات المذكورة في الفصل؟\n",
        "score": 1,
        "options": [
          "نقل المستمع لموقع الحدث مباشرة.",
          "استخدام كلمات غير مألوفة لإثارة الأنتباه.",
          "بدء البرنامج بشرح مفصل لأهداف الحلقة.",
          "توديع المستمع بلطف ووعده بلقاء جديد."
        ],
        "correctAnswers": [
          0
        ],
        "modelAnswer": "",
        "explanation": "هذه التقنيه المباشرة تخلق إثارة وتضع المستمع في قلب الحدث فوراً، وهي من أنجح طرق البداية القوية.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777454971408"
      },
      {
        "type": "mcq",
        "text": "ما هي الخطوة الإدارية الهامة التي يجب على المخرج القيام بها 'بعد انتهاء التسجيل' وقبل حفظ الشريط؟",
        "score": 1,
        "options": [
          "الاتصال بالجمهور لعمل تقييم مرحلي.",
          "ملء 'استمارة بيانات الإنتاج' التي تتضمن اسم البرنامج ومدته وتاريخه",
          "تغيير الديكور استعداداً للبرنامج التالي",
          "القيام بالمونتاج الفوري للبرنامج"
        ],
        "correctAnswers": [
          1
        ],
        "modelAnswer": "",
        "explanation": "تُرفق هذه الاستمارة بالشريط لتوثيق كافة تفاصيله وضمان بثه في وقته المحدد دون أخطاء.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777455024702"
      },
      {
        "type": "mcq",
        "text": "بعد التقييم المرحلي، قرر فريق العمل 'تعديل' البرنامج. متى يتم اتخاذ قرار التعديل عادة؟\n",
        "score": 1,
        "options": [
          "إذا كانت الرسالة مفهومة ومقبولة تماماً لدى الجمهور.",
          "إذا تم تغيير وقت البث بسبب المنافسة.",
          "إذا كانت الرسالة غير فعالة أو غير مفهومة تماماً.",
          "إذا كان هناك نقص أو سوء فهم لبعض أجزاء الرسالة."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "التعديل هو الحل لتصحيح المسار وسد النواقص لإنقاذ البرنامج وتحسينه.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777455179322"
      },
      {
        "type": "mcq",
        "text": "إذا كان البرنامج يهدف إلى 'تحويل السلوكيات الخاطئة إلى سلوكيات مرغوبة اجتماعياً لدفع التنمية'، فهذا يندرج تحت أي من أهداف تقييم المضمون؟",
        "score": 1,
        "options": [
          "تنمية الوعي.",
          "تغيير الاتجاهات.",
          "تعديل التصرفات الظاهريه.",
          "التقييم الشكلي."
        ],
        "correctAnswers": [
          2
        ],
        "modelAnswer": "",
        "explanation": "السلوك هو التصرف الظاهري، وتعديله هو أعلى درجات التأثير الإيجابي للبرامج لدفع التنمية.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777455618214"
      },
      {
        "type": "mcq",
        "text": "من طرق قياس رجع الصدى (Feedback)، أي وسيلة تُعتبر سريعة ومنخفضة التكلفة للتواصل المباشر مع الجمهور؟",
        "score": 1,
        "options": [
          "البريد المباشر.",
          "شبكات التواصل الاجتماعي.",
          "المجموعات البؤرية (استطلاع الرأي).",
          "الأحاديث التليفونية."
        ],
        "correctAnswers": [
          3
        ],
        "modelAnswer": "",
        "explanation": "المكالمات الهاتفية توفر تواصلاً لحظياً وسريعاً وتكلفتها منخفضة للتقييم السريع.",
        "studentId": "students_1775379443604",
        "showExp": true,
        "id": "q_1777455758792"
      }
    ],
    "examMode": "practice",
    "emailPolicy": "none",
    "adminEmails": "",
    "startTime": "",
    "endTime": "",
    "latePolicy": "hard_stop",
    "allowBackNavigation": false,
    "yearId": "year_1",
    "semesterId": "semesters_1775125622791"
  }
];